Repository: pyOpenSci/python-package-guide
Catalog: locales/*/LC_MESSAGES/index.po
Languages: es, ja

source: Tutorials
es: Tutoriales
ja: チュートリアル

source: Packaging
es: Enpaquetado
ja: パッケージング

source: Documentation
es: Documentación
ja: ドキュメンテーション

source: Tests
es: Pruebas
ja: テスト

source: Testing
es: Verificando
ja: テスト

source: Continuous Integration
ja: 継続的インテグレーション

source: pyOpenSci Python Package Guide
es: La guía de paquetes de Python de pyOpenSci
ja: pyOpenSci Pythonパッケージガイド

source: We support the Python tools that scientists need to create open science workflows.
es: Nosotros ayudamos a los científicos a crear flujos de trabajo de ciencia abierta.
ja: 私たちは、科学者がオープンサイエンスのワークフローを作成するために必要なPythonツールをサポートしています。

source: GitHub release (latest by date)
es: Versiones en GitHub (la más reciente por fecha)
ja: GitHubリリース(日付順最新)

source: About this guide
es: Sobre esta guía
ja: このガイドについて

source: Image with the pyOpenSci flower logo in the upper right hand corner. The image shows the packaging lifecycle. The graphic shows a high level overview of the elements of a Python package. The inside circle has 5 items - user documentation, code/api, test suite, contributor documentation, project metadata / license / readme. In the middle of the circle is says maintainers and has a small icon with people. On the outside circle there is an arrow and it says infrastructure.
ja: 右上にpyOpenSciの花のロゴがある画像。画像はパッケージングのライフサイクルを示しています。図にはPythonパッケージの要素のハイレベルな概要が示されています。内側の円には5つの項目があります - ユーザードキュメント、コード/API、テストスイート、コントリビュータードキュメント、プロジェクトメタデータ/ライセンス/readme。円の真ん中にはメンテナーと書かれ、人と小さなアイコンがあります。外側の円には矢印があり、インフラストラクチャと書かれています。

source: This guide will help you:
es: Esta guía te ayudará a:
ja: このガイドはあなたのお役に立つでしょう:

source: Learn how to create a Python package from start to finish
es: Aprender como crear un paquete de Python de principio a fin
ja: Pythonパッケージの作成方法を最初から最後まで学ぶ

source: Understand the broader Python packaging tool ecosystem
es: Entender el ecosistema de herramientas de empaquetado de Python
ja: 幅広いPythonパッケージングツールのエコシステムを理解する

source: Navigate and make decisions around tool options
es: Navegar y tomar decisiones sobre las opciones de las herramientas
ja: ツールオプションのナビゲートと決定

source: Understand all of the pieces of creating and maintaining a Python package
es: Entender todas las etapas de la creación y mantenimiento de un paquete de Python
ja: Pythonパッケージの作成と保守のすべてを理解する

source: You will also find best practice recommendations and curated lists of community resources surrounding packaging and package documentation.
es: Tambien encontrarás recomendaciones y listas de recursos comunitarios sobre empaquetado y documentación de paquetes.
ja: また、パッケージングとパッケージドキュメンテーションにまつわるベストプラクティスの推奨や、コミュニティリソースのキュレーションリストもご覧いただけます。

source: TODO: change the navigation of docs to have a
ja: TODO: ドキュメントのナビゲーションに

source: user documentation contributor / maintainer documentation
es: documentación para colaboradores / mantenedores
ja: ユーザードキュメント コントリビューター / メンテナ ドキュメント

source: development guide
es: guía de desarrollo
ja: 開発ガイド

source: contributing guide
es: guía de contribución
ja: コントリビュートガイド

source: Community docs
es: Documentación de la comunidad
ja: コミュニティドキュメント

source: readme, coc, license
es: readme, coc, licencia
ja: readme、coc、ライセンス

source: Publish your docs
es: Publique su documentación
ja: ドキュメントを公開する

source: _new_ Tutorial Series: Create a Python Package
es: _nuevo_ Tutoriales: Crear un paquete de Python
ja: _new_ チュートリアルシリーズ: Pythonパッケージの作成

source: The first round of our community-developed, how to create a Python package tutorial series for scientists is complete! Join our community review process or watch development of future tutorials in our [GitHub repo here](https://github.com/pyOpenSci/python-package-guide).
ja: コミュニティが開発した、科学者のためのPythonパッケージの作り方チュートリアルシリーズの第一弾が完成しました！ コミュニティのレビュープロセスに参加したり、 [GitHub リポジトリはこちら](https://github.com/pyOpenSci/python-package-guide) で今後のチュートリアルの開発を見守ったりしてください。

source: ✿ Create a Package Tutorials ✿
es: ✿ Tutorial de Como Crear un Paquete ✿
ja: ✿ チュートリアルパッケージの作成 ✿

source: [What is a Python package?](/tutorials/intro)
es: [¿Que es un paquete de Python?](/tutorials/intro)
ja: [Pythonパッケージとは何か?](/tutorials/intro)

source: [Make your code installable](/tutorials/create-python-package)
ja: [コードをインストール可能にする](/tutorials/create-python-package)

source: [Publish your package to (test) PyPI](/tutorials/publish-pypi)
es: [Publica tu paquete en (test) PyPI](/tutorials/publish-pypi)
ja: [パッケージを(テスト用の)PyPIに公開する](/tutorials/publish-pypi)

source: [Publish your package to conda-forge](/tutorials/publish-conda-forge)
es: [Publica tu paquete en conda-forge](/tutorials/publish-conda-forge)
ja: [パッケージを conda-forge に公開する](/tutorials/publish-conda-forge)

source: ✿ Package Metadata Tutorials ✿
es: ✿ Tutoriales de Metadatos de Paquetes ✿
ja: ✿パッケージメタデータチュートリアル✿

source: [How to add a README file](/tutorials/add-readme)
es: [Como añadir un archivo README](/tutorials/add-readme)
ja: [READMEファイルの追加方法](/tutorials/add-readme)

source: [How to add metadata to a pyproject.toml file for publication to PyPI.](/tutorials/pyproject-toml.md)
es: [Como añadir metadatos a un archivo pyproject.toml para publicación en PyPI.](/tutorials/pyproject-toml.md)
ja: [PyPIに公開するためにpyproject.tomlファイルにメタデータを追加する方法](/tutorials/pyproject-toml.md)

source: ✿ Packaging Tool Tutorials ✿
es: ✿ Tutoriales sobre Herramientas de Empaquetado ✿
ja: ✿パッケージングツールのチュートリアル✿

source: [Introduction to Hatch](/tutorials/get-to-know-hatch)
es: [Introducción a Hatch](/tutorials/get-to-know-hatch)
ja: [Hatch入門](/tutorials/get-to-know-hatch)

source: ✿ Reference Guides ✿
ja: ✿ リファレンスガイド ✿

source: [Command Line Reference Guide](/tutorials/command-line-reference)
ja: [コマンドラインリファレンスガイド](/tutorials/command-line-reference)

source: Python Packaging for Scientists
es: Paquetes Python para Científicos
ja: 科学者のためのPythonパッケージング

source: Learn about Python packaging best practices. You will also get to know the the vibrant ecosystem of packaging tools that are available to help you with your Python packaging needs.
es: Aprende sobre las mejores prácticas de empaquetado de Python. También conocerás el vibrante ecosistema de herramientas de empaquetado que están disponibles para ayudarte con tus necesidades de empaquetado de Python.
ja: Python のパッケージングのベストプラクティスについて学びます。 また、Python のパッケージングを支援するために利用可能なパッケージングツールの活発なエコシステムを知ることができます。

source: ✨ Create your package ✨
es: ✨ Crea tu paquete ✨
ja: ✨パッケージの作成✨

source: [Package file structure](/package-structure-code/python-package-structure)
es: [Estructura de archivos de paquete](/package-structure-code/python-package-structure)
ja: [パッケージファイル構造](/package-structure-code/python-package-structure)

source: [Package metadata / pyproject.toml](package-structure-code/pyproject-toml-python-package-metadata.md)
es: [Metadatos de paquete / pyproject.toml](package-structure-code/pyproject-toml-python-package-metadata.md)
ja: [パッケージメタデータ / pyproject.toml](package-structure-code/pyproject-toml-python-package-metadata.md)

source: [Build your package (sdist / wheel)](package-structure-code/python-package-distribution-files-sdist-wheel.md)
es: [Construye tu paquete (sdist / wheel)](package-structure-code/python-package-distribution-files-sdist-wheel.md)
ja: [パッケージのビルド (sdist / wheel)](package-structure-code/python-package-distribution-files-sdist-wheel.md)

source: [Declare dependencies](package-structure-code/declare-dependencies.md)
es: [Declara dependencias](package-structure-code/declare-dependencies.md)
ja: [依存関係の宣言](package-structure-code/declare-dependencies.md)

source: [Navigate the packaging tool ecosystem](package-structure-code/python-package-build-tools.md)
es: [Aprende el ecosistema de herramientas de empaquetado](package-structure-code/python-package-build-tools.md)
ja: [パッケージングツールのエコシステムをナビゲートする](package-structure-code/python-package-build-tools.md)

source: [Non pure Python builds](package-structure-code/complex-python-package-builds.md)
es: [Construcción de paquetes que incluyen otros lenguajes](package-structure-code/complex-python-package-builds.md)
ja: [純粋な Python 以外のビルド](package-structure-code/complex-python-package-builds.md)

source: ✨ Publish your package ✨
es: ✨ Publica tu paquete ✨
ja: ✨パッケージを公開する✨

source: Gain a better understanding of the Python packaging ecosystem Learn about best practices for:
es: Entiende el ecosistema de empaquetado de Python.Aprende sobre las mejores prácticas para:
ja: Pythonのパッケージングエコシステムをより深く理解するためのベストプラクティスを学ぶ:

source: [Package versioning & release](/package-structure-code/python-package-versions.md)
es: [Versionado y lanzamiento de paquetes](/package-structure-code/python-package-versions.md)
ja: [パッケージのバージョン管理とリリース](/package-structure-code/python-package-versions.md)

source: [Publish to PyPI & Conda-forge](/package-structure-code/publish-python-package-pypi-conda.md)
es: [Publica en PyPI y Conda-forge](/package-structure-code/publish-python-package-pypi-conda.md)
ja: [PyPIとConda-forgeへの公開](/package-structure-code/publish-python-package-pypi-conda.md)

source: ✨ Write The Docs ✨
es: ✨ Escribe la Documentación ✨
ja: ✨ドキュメントを書く✨

source: [Create documentation for your users](/documentation/write-user-documentation/intro)
es: [Crea documentación para tus usuarios](/documentation/write-user-documentation/intro)
ja: [ユーザーのための文書を作成する](/documentation/write-user-documentation/intro)

source: [Core files to include in your package repository](/documentation/repository-files/intro)
es: [Archivos importantes en tu repositorio de paquetes](/documentation/repository-files/intro)
ja: [パッケージリポジトリに含めるコアファイル](/documentation/repository-files/intro)

source: [Write tutorials to show how your package is used](/documentation/write-user-documentation/create-package-tutorials)
es: [Escribe tutoriales para mostrar como se usa tu paquete](/documentation/write-user-documentation/create-package-tutorials)
ja: [パッケージがどのように使われるかを示すチュートリアルを書く](/documentation/write-user-documentation/create-package-tutorials)

source: ✨ Developer Docs ✨
es: ✨ Documentación para Desarrolladores ✨
ja: ✨開発者向けドキュメント✨

source: [Create documentation for collaborating developers](/documentation/repository-files/contributing-file)
es: [Crea documentación para colaboradores y desarrolladores](/documentation/repository-files/contributing-file)
ja: [共同開発者のためのドキュメントの作成](/documentation/repository-files/contributing-file)

source: [Write a development guide](/documentation/repository-files/development-guide)
es: [Escribe una guía de desarrollo](/documentation/repository-files/development-guide)
ja: [開発ガイドを書く](/documentation/repository-files/development-guide)

source: ✨ Document For A Community ✨
es: ✨ Documentos para la Comunidad ✨
ja: ✨コミュニティのためのドキュメント✨

source: [Writing a README file](/documentation/repository-files/readme-file-best-practices)
es: [Escribe un archivo README](/documentation/repository-files/readme-file-best-practices)
ja: [READMEファイルの書き方](/documentation/repository-files/readme-file-best-practices)

source: [Set norms with a Code of Conduct](/documentation/repository-files/code-of-conduct-file)
es: [Establece normas con un Código de Conducta](/documentation/repository-files/code-of-conduct-file)
ja: [行動規範で規範を定める](/documentation/repository-files/code-of-conduct-file)

source: [License your package](/documentation/repository-files/license-files)
es: [Licencia tu paquete](/documentation/repository-files/license-files)
ja: [パッケージのライセンス](/documentation/repository-files/license-files)

source: ✨ Publish Your Docs ✨
es: ✨ Publica tu Documentación ✨
ja: ✨ドキュメントを公開する✨

source: [How to publish your docs](/documentation/hosting-tools/intro)
es: [Como publicar tu documentación](/documentation/hosting-tools/intro)
ja: [ドキュメントを公開する方法](/documentation/hosting-tools/intro)

source: [Using Sphinx](/documentation/hosting-tools/intro)
es: [Usando Sphinx](/documentation/hosting-tools/intro)
ja: [Sphinxを使う](/documentation/hosting-tools/intro)

source: [Markdown, MyST, and ReST](/documentation/hosting-tools/myst-markdown-rst-doc-syntax)
es: [Markdown, MyST, y ReST](/documentation/hosting-tools/myst-markdown-rst-doc-syntax)
ja: [Markdown、MyST、およびReST](/documentation/hosting-tools/myst-markdown-rst-doc-syntax)

source: [Host your docs on Read The Docs or GitHub Pages](/documentation/hosting-tools/publish-documentation-online)
ja: [Read The Docs または GitHub Pages でドキュメントをホストする](/documentation/hosting-tools/publish-documentation-online)

source: *We are actively working on this section. [Follow development here.](https://github.com/pyOpenSci/python-package-guide)*
es: *Estamos trabajando activamente en esta sección. [Sigue el desarrollo aquí.](https://github.com/pyOpenSci/python-package-guide)*
ja: *私たちはこのセクションに積極的に取り組んでいます。 [開発のフォローはこちら](https://github.com/pyOpenSci/python-package-guide)*

source: ✨ Tests for your Python package ✨
es: ✨ Pruebas para tu paquete ✨
ja: ✨Pythonパッケージのテスト✨

source: [Intro to testing](tests/index.md)
es: [Introducción a las pruebas](tests/index.md)
ja: [テスト入門](tests/index.md)

source: [Write tests](tests/write-tests)
es: [Escribe pruebas](tests/write-tests)
ja: [テストを書く](tests/write-tests)

source: [Types of tests](tests/test-types)
es: [Tipos de pruebas](tests/test-types)
ja: [テストの種類](tests/test-types)

source: ✨ Run your tests ✨
es: ✨ Ejecuta tus pruebas ✨
ja: ✨テストの実行✨

source: [Run tests locally](tests/run-tests)
es: [Ejecuta pruebas en local](tests/run-tests)
ja: [ローカルでテストを実行する](tests/run-tests)

source: [Run tests in CI](tests/tests-ci)
es: [Ejecuta pruebas en CI](tests/tests-ci)
ja: [CIでテストを実行する](tests/tests-ci)

source: Contributing
es: Contribuir
ja: 貢献

source: ✨ Code style & Format ✨
es: ✨ Estilo de Código y Formato ✨
ja: ✨コードスタイルとフォーマット✨

source: [Code style](package-structure-code/code-style-linting-format.md)
es: [Estilo de Código](package-structure-code/code-style-linting-format.md)
ja: [コードスタイル](package-structure-code/code-style-linting-format.md)

source: ✨ Want to contribute? ✨
es: ✨ ¿Quieres contribuir? ✨
ja: ✨貢献したいですか？ ✨

source: We welcome contributions to this guide. Learn more about how you can contribute.
es: Agradecemos las contribuciones a esta guía. Aprende más sobre como puedes contribuir.
ja: このガイドへのご貢献をお待ちしております。貢献方法についてはこちらをご覧ください。

source: xkcd comic showing a stick figure on the ground and one in the air. The one on the ground is saying. `You're flying! how?` The person in the air replies `Python!` Below is a 3 rectangle comic with the following text in each box. Box 1 - I learned it last night. Everything is so simple. Hello world is just print hello world. Box 2 - the person on the ground says - come join us programming is fun again. It's a whole new world. But how are you flying? box 3 - the person flying says - i just typed import antigravity. I also sampled everything in the medicine cabinet. But i think this is the python. The person on the ground is saying - that's it?
ja: xkcdの漫画で、地面に置かれた棒人間と空中にある棒人間が描かれている。地上にいる人が言っている。 `あなたは飛んでいる！どうやって？` 空中にいる人は `Python!` と答える。以下は3つの長方形のマンガで、各ボックスに次のテキストが入っている。ボックス1 - 昨夜学んだ。すべてがとてもシンプルだ。Hello worldはprint hello worldだけ。ボックス2 - 地上にいる人が言う。まったく新しい世界だ。でもどうやって飛んでるの？ボックス3 - 飛んでいる人はこう言う。- `反重力をインポートしました。薬箱の中のものも全部試しました。でもこれがpythonだと思う。地上の人はこう言っている。- これで終わり？

source: A community-created guidebook
es: Una guía creada por la comunidad
ja: コミュニティが作るガイドブック

source: Every page in this guidebook goes through an extensive community review process. To ensure our guidebook is both beginner-friendly and accurate, we encourage reviews from a diverse set of pythonistas and scientists with a wide range of skills and expertise.
es: Cada página en esta guía es revisada extensamente por la comunidad. Para asegurar que nuestra guía sea accesible a principiantes y precisa, realizamos revisiones con un conjunto diverso de pythonistas y científicos con una amplia gama de habilidades y experiencia.
ja: このガイドブックのすべてのページは、コミュニティの広範なレビュープロセスを経ています。 このガイドブックが初心者にやさしく、正確であることを保証するために、私たちは幅広いスキルと専門知識を持つ多様なpythonistaや科学者からのレビューを奨励しています。

source: View guidebook contributors
es: Ver los colaboradores de la guía
ja: ガイドブックの貢献者を見る

source: Who this guidebook is for
es: A quién va dirigida esta guía
ja: このガイドブックの対象者

source: This guidebook is for anyone interested in learning more about Python packaging. It is beginner-friendly and will provide:
es: Esta guía es para cualquier persona interesada en aprender más sobre el empaquetado de Python. Es accesible para principiantes y proporcionará:
ja: このガイドブックはPythonのパッケージングについてもっと学びたいと思っている人のためのものです。 初心者に優しく、以下を提供します:

source: Beginning-to-end guidance on creating a Python package.
es: Ayuda de principio a fin para crear un paquete de Python.
ja: Pythonパッケージの作成に関する初歩から終わりまでのガイダンス。

source: Resources to help you navigate the Python packaging ecosystem of tools and approaches to packaging.
es: Recursos para ayudarte a navegar el ecosistema de herramientas y enfoques de empaquetado de Python.
ja: Python のパッケージングエコシステムをナビゲートするのに役立つリソースです。

source: A curated list of resources to help you get your package into documented, usable and maintainable shape.
es: Una lista de recursos seleccionados para ayudarte a documentar, usar y mantener tu paquete.
ja: あなたのパッケージが文書化され、使用可能で保守可能な形になるのを助けるリソースの厳選されたリストです。

source: Where this guide is headed
es: El futuro de esta guía
ja: このガイドの方向性

source: If you have ideas of things you'd like to see here clarified in this guide, [we invite you to open an issue on GitHub.](https://github.com/pyOpenSci/python-package-guide/issues).
es: Si tienes ideas de cosas que te gustaría ver aclaradas en esta guía, [te invitamos a abrir un issue en GitHub.](https://github.com/pyOpenSci/python-package-guide/issues).
ja: このガイドで明確にしてほしいことがあれば、 [GitHubにissueを開いてください。](https://github.com/pyOpenSci/python-package-guide/issues) 。

source: If you have questions about our peer review process or packaging in general, you are welcome to use our [pyOpenSci Discourse forum](https://pyopensci.discourse.group/).
es: Si tienes preguntas sobre nuestro proceso de peer review o sobre el empaquetado en general, eres bienvenido a usar nuestro [foro de Discourse de pyOpenSci](https://pyopensci.discourse.group/).
ja: レビュープロセスやパッケージング全般について質問がある場合は、 [pyOpenSci Discourse forum](https://pyopensci.discourse.group/) をご利用ください。

source: This living Python packaging guide is updated as tools and best practices evolve in the Python packaging ecosystem. We will be adding new content over the next year.
ja: これは Python のパッケージングエコシステムにおけるツールやベストプラクティスの進化に合わせて更新されるこの生きた Python パッケージングガイドです。 来年にかけて新しいコンテンツを追加していく予定です。

source: ![GitHub release (latest by date)](https://img.shields.io/github/v/release/pyopensci/python-package-guide?color=purple&display_name=tag&style=plastic) [![](https://img.shields.io/github/stars/pyopensci/python-package-guide?style=social)](https://github.com/pyopensci/contributing-guide) [![DOI](https://zenodo.org/badge/556814582.svg)](https://zenodo.org/badge/latestdoi/556814582)
es: ![Releases en GitHub (por fecha)](https://img.shields.io/github/v/release/pyopensci/python-package-guide?color=purple&display_name=tag&style=plastic) [![](https://img.shields.io/github/stars/pyopensci/python-package-guide?style=social)](https://github.com/pyopensci/contributing-guide) [![DOI](https://zenodo.org/badge/556814582.svg)](https://zenodo.org/badge/latestdoi/556814582)

source: [Make your code installable](/tutorials/installable-code)
es: [Como hacer que tu código sea instalable](/tutorials/installable-code)
