Repository: pyOpenSci/python-package-guide
Catalog: locales/*/LC_MESSAGES/package-structure-code.po
Languages: es, ja

source: The conda ecosystem evolved years ago to provide support for, and simplify the process of, managing software dependencies in scientific Python projects.
es: El ecosistema de conda evolucionó hace años para proporcionar soporte y simplificar el proceso de gestión de dependencias de software en proyectos científicos de Python.
ja: condaエコシステムは、科学的なPythonプロジェクトにおけるソフトウェアの依存関係を管理するためのサポートを提供し、そのプロセスを簡素化するために数年前に発展しました。

source: Many of the core scientific Python projects depend upon or wrap around tools and extensions that are written in other languages, such as C++. In the early stages of the scientific ecosystem's development, these non-Python extensions and tools were not well supported on PyPI, making publication difficult. In recent years there is more support for complex builds that allow developers to bundle non-Python code into a Python distribution using the [wheel distribution format](python-wheel).
es: Muchos de los proyectos científicos de Python dependen de o envuelven herramientas y extensiones escritas en otros lenguajes, como C++. En las primeras etapas del desarrollo del ecosistema científico, estas extensiones y herramientas no escritas en Python no eran compatibles en PyPI, lo que hacía que la publicación fuera difícil. En los últimos años, hay más soporte para construcciones complejas que permiten a los desarrolladores empaquetar código no escrito en Python en una distribución de Python usando el [formato de distribución de rueda](python-wheel).
ja: 科学的なPythonプロジェクトのコアの多くは、C++などの他の言語で書かれたツールや拡張機能に依存したり、その周りを取り巻いたりしています。科学エコシステムの開発の初期段階では、これらのPython以外の拡張機能やツールはPyPIで十分にサポートされておらず、公開が困難でした。近年、開発者が [wheel distribution format](python-wheel) を使ってPython以外のコードをPythonディストリビューションにバンドルできるような、複雑なビルドのサポートが増えました。

source: Conda provides a mechanism to manage these dependencies and ensure that the required packages are installed correctly.
es: Conda proporciona un mecanismo para gestionar estas dependencias y asegurar que los paquetes requeridos se instalen correctamente.
ja: Condaは、これらの依存関係を管理し、必要なパッケージが正しくインストールされるようにするメカニズムを提供します。

source: While conda was originally created to support Python packages, it is now used across all languages. This cross-language support makes it easier for some packages to include and have access to tools written in other languages, such as C/C++ (gdal), Julia, or R. Creating an environment that mixes all of these packages is usually easier and more consistent with full-fledged package managers like conda.
es: Si bien conda se creó originalmente para admitir paquetes de Python, ahora se usa en todos los lenguajes. Este soporte entre lenguajes facilita que algunos paquetes incluyan y tengan acceso a herramientas escritas en otros lenguajes, como C/C++ (gdal), Julia o R. Crear un entorno que mezcle todos estos paquetes suele ser más fácil y más consistente con herramientas de administración de paquetes como conda.
ja: condaはもともとPythonのパッケージをサポートするために作られたが、今ではあらゆる言語で使われています。この言語間サポートにより、C/C++ (gdal) 、Julia、Rなど、他の言語で書かれたツールを簡単に取り込んだり、利用したりできるパッケージもあります。これらのパッケージをすべてミックスした環境を作るのは、通常、condaのような本格的なパッケージマネージャを使った方が簡単で、一貫性があります。

source: conda channels
es: Canales de conda
ja: condaチャンネル

source: conda built packages are housed within repositories that are called channels. The conda package manager can install packages from different channels.
es: Los paquetes construidos con conda se alojan en repositorios que se llaman canales. El administrador de paquetes conda puede instalar paquetes de diferentes canales.
ja: condaでビルドされたパッケージは、チャンネルと呼ばれるリポジトリに格納されます。 condaパッケージマネージャは異なるチャンネルからパッケージをインストールすることができます。

source: There are several core public channels that most people use to install packages using conda, including:
es: Existen varios canales públicos principales que la mayoría de las personas utilizan para instalar paquetes con conda, incluidos:
ja: 多くの人がcondaを使ってパッケージをインストールする際に使う、いくつかのコアなパブリックチャンネルがあります:

source: **defaults:** this is a channel managed by Anaconda. It is the version of the Python packages that you will install if you install the Anaconda Distribution. Anaconda (the company) decides what packages live on the `defaults` channel.
es: **defaults:** este es un canal administrado por Anaconda. Es la versión de los paquetes de Python que instalará si instala la Distribución de Anaconda. Anaconda (la empresa) decide qué paquetes viven en el canal `defaults`.
ja: **defaults:** これは Anaconda が管理するチャンネルです。 Anaconda ディストリビューションをインストールするとインストールされる Python パッケージのバージョンです。 どのパッケージが `defaults` チャンネルにあるかは Anaconda (会社) が決定します。

source: **conda-forge** emerged as many of the scientific packages did not exist in the `defaults` Anaconda channel.
es: **conda-forge** surgió motivado por que muchos de los paquetes científicos no existían en el canal `defaults` de Anaconda.
ja: 科学的パッケージの多くが `defaults` Anaconda チャンネルに存在しなかったため、**conda-forge** が出現しました。

source: Conda channels represent various repositories that you can install packages from. Because conda-forge is community maintained, anyone can submit a recipe there. PyPI is also a community maintained repository. Anyone can submit a package to PyPI and test PyPI. Unlike conda-forge there are no manual checks of packages submitted to PyPI.
es: Los canales de conda representan varios repositorios desde los que puede instalar paquetes. Dado que conda-forge es mantenido por la comunidad, cualquiera puede enviar una receta allí. PyPI también es un repositorio mantenido por la comunidad. Cualquiera puede enviar un paquete a PyPI y a test PyPI. A diferencia de conda-forge, no hay comprobaciones manuales de los paquetes enviados a PyPI.
ja: Condaチャンネルは、パッケージをインストールできる様々なリポジトリです。 conda-forge はコミュニティによって管理されているため、誰でもレシピを投稿することができます。 PyPIもコミュニティによって管理されているリポジトリです。 誰でもPyPIにパッケージを投稿し、PyPIをテストすることができます。 conda-forge とは異なり、PyPI に投稿されたパッケージを手動でチェックすることはありません。

source: conda channels, PyPI, conda, pip - Where to publish your package
es: Canal de conda, PyPI, conda, pip - Dónde publicar su paquete
ja: conda channels, PyPI, conda, pip - パッケージを公開する場所

source: You might be wondering why there are different package repositories that can be used to install Python packages.
es: Es posible que se pregunte por qué hay diferentes repositorios de paquetes que se pueden usar para instalar paquetes de Python.
ja: なぜPythonパッケージをインストールするのに様々なパッケージリポジトリがあるのか不思議に思うかもしれません。

source: And more importantly you are likely wondering how to pick the right repository to publish your Python package.
es: Y, lo que es más importante, es probable que se esté preguntando cómo elegir el repositorio adecuado para publicar su paquete de Python.
ja: さらに重要なことは、Pythonパッケージを公開するのに適切なリポジトリをどのように選べばいいのか悩んでいることでしょう。

source: The answer to both questions relates dependency conflicts.
es: La respuesta a ambas preguntas se relaciona con conflictos de dependencias.
ja: どちらの質問に対する答えも、依存関係のコンフリクトに関係しています。

source: Image showing an XKCD comic that shows a web of Python environments and tools and installations. At the bottom is says - My python environment has become so degraded that my laptop has been declared a superfund site.
es: Imagen que muestra un cómic de XKCD que muestra una red de entornos y herramientas de Python e instalaciones. En la parte inferior dice - Mi entorno de Python se ha degradado tanto que mi ordenador portátil ha sido declarado un sitio de superfinanciación.
ja: 画像はXKCDのコミックで、Pythonの環境とツール、インストールの網を描いています。一番下にはこう書いてあります - 私のパイソン環境は劣化しすぎて、私のラップトップはスーパーファンドサイトに指定された。

source: Installing Python and Python packages from different repositories can lead to environment conflicts where a version of on package doesn't work with a version of another package. To keep your environments clean and working, it's best to install packages from the same repository. So use pip to install everything. Or use conda. If you can, try to avoid installing package from both pip and conda into the same environment.
es: Instalar Python y paquetes de Python desde diferentes repositorios puede llevar a conflictos de entorno donde una versión de un paquete no funciona con una versión de otro paquete. Para mantener sus entornos limpios y funcionando, es mejor instalar paquetes desde el mismo repositorio. Por lo tanto, use pip para instalar todo. O use conda. Si puede, intente evitar instalar paquetes tanto de pip como de conda en el mismo entorno.
ja: Python と Python パッケージを異なるリポジトリからインストールすると、あるバージョンのパッケージが別のパッケージのバージョンと動作しないといった環境の衝突につながる可能性があります。 環境をクリーンに保ち、動作させるためには、同じリポジトリからパッケージをインストールするのがベストです。 そのため、pipを使ってすべてをインストールする。 あるいはcondaを使う。 できることなら、pipとcondaの両方のパッケージを同じ環境にインストールしないようにしましょう。

source: Managing Python package dependency conflicts
es: Gestión de conflictos de dependencias de paquetes de Python
ja: Pythonパッケージの依存関係の競合を管理する

source: Python environments can encounter conflicts because Python tools can be installed from different repositories. Broadly speaking, Python environments have a smaller chance of dependency conflicts when the tools are installed from the same package repository. Thus environments that contain packages installed from both pip and conda are more likely to yield dependency conflicts.
es: Los entornos de Python pueden encontrar conflictos porque las herramientas de Python se pueden instalar desde diferentes repositorios. En términos generales, los entornos de Python tienen una menor probabilidad de conflictos de dependencias cuando las herramientas se instalan desde el mismo repositorio de paquetes. Por lo tanto, los entornos que contienen paquetes instalados tanto desde pip como desde conda tienen más probabilidades de generar conflictos de dependencias.
ja: Python環境は、Pythonツールが異なるリポジトリからインストールされることがあるため、競合に遭遇する可能性があります。 大まかに言えば、Python環境は、ツールが同じパッケージリポジトリからインストールされるとき、依存関係の衝突の可能性が小さくなります。 そのため、pip と conda の両方からインストールされたパッケージを含む環境は、依存関係の衝突が起こりやすくなります。

source: Many install packages directly from conda `defaults` channel. However, because this channel is managed by Anaconda, the packages available on it are limited to those that Anaconda decides should be core to a stable installation. The conda-forge channel was created to complement the `defaults` channel. It allows anyone to submit a package to be published in the channel . Thus, `conda-forge` channel ensures that a broad suite of user-developed community packages can be installed from conda.
es: Muchos instalan paquetes directamente desde el canal `defaults` de conda. Sin embargo, debido a que este canal es administrado por Anaconda, los paquetes disponibles en él están limitados a aquellos que Anaconda decide que deben ser fundamentales para una instalación estable. El canal conda-forge se creó para complementar el canal `defaults`. Permite a cualquiera enviar un paquete para ser publicado en el canal. Por lo tanto, el canal `conda-forge` garantiza que se puedan instalar una amplia gama de paquetes de la comunidad desarrollados por el usuario desde conda.
ja: 多くのパッケージは conda `defaults` チャンネルから直接インストールします。 しかし、このチャンネルは Anaconda によって管理されているため、このチャンネルで利用可能なパッケージは、Anaconda が安定したインストールの中核となるべきと判断したものに限定されます。 conda-forge チャンネルは `defaults` チャンネルを補完するために作成されました。 誰でもこのチャンネルで公開するパッケージを投稿することができます。 このように、 `conda-forge` チャネルは、ユーザが開発したコミュニティパッケージの広範なスイートを conda からインストールできるようにします。

source: Take-aways: If you can, publish on both PyPI and conda-forge to accommodate more users of your package
es: Conclusión: Si puede, publique tanto en PyPI como en conda-forge para acomodar a más usuarios de su paquete
ja: 教訓: 可能であれば、PyPI と conda-forge の両方で公開し、より多くのユーザがあなたのパッケージを利用できるようにしましょう。

source: The take-away here for maintainers is that if you anticipate users wanting to use conda to manage their local environments (which many do), you should consider publishing to both PyPI and the conda-forge channel (_more on that below_).
es: La conclusión aquí para los mantenedores es que si anticipa que los usuarios querrán usar conda para administrar sus entornos locales (lo cual muchos hacen), debería considerar publicar tanto en PyPI como en el canal conda-forge (_más sobre eso a continuación_).
ja: メンテナにとって重要なことは、もしユーザがローカル環境の管理にcondaを使いたいと考えているのであれば（多くのユーザがそうしている）、PyPIとconda-forge channelの両方に公開することを検討すべきだということです (_詳しくは後述します) 。

source: Additional resources
es: Recursos adicionales
ja: その他のリソース

source: [learn more about why conda-forge was created, here](https://conda-forge.org/docs/user/introduction.html)
es: [aprende más sobre por qué se creó conda-forge, aquí](https://conda-forge.org/docs/user/introduction.html)
ja: [conda-forgeがなぜ作られたのか、詳しくはこちら](https://conda-forge.org/docs/user/introduction.html)

source: [To learn more about conda terminology, check out their glossary.](https://docs.conda.io/projects/conda/en/latest/glossary.html )
es: [Para aprender más sobre la terminología de conda, consulte su glosario.](https://docs.conda.io/projects/conda/en/latest/glossary.html )
ja: [condaの用語についてもっと知りたい方は、用語集をご覧ください。](https://docs.conda.io/projects/conda/en/latest/glossary.html )

source: How to submit to conda-forge
es: Como publicar en conda-forge
ja: conda-forgeへの投稿方法

source: While pyOpenSci doesn't require you to add your package to conda-forge, we encourage you to consider doing so!
es: ¡Si bien pyOpenSci no requiere que agregue su paquete a conda-forge, le sugerimos que lo considere!
ja: pyOpenSciはあなたのパッケージをconda-forgeに追加する必要はありませんが、追加することを検討することを推奨します！

source: Once your package is on PyPI, the process to add your package to conda-forge is straight forward to do. [You can follow the detailed steps provided by the conda-forge maintainer team.](https://conda-forge.org/docs/maintainer/adding_pkgs.html).
es: Una vez que su paquete esté en PyPI, el proceso para agregar su paquete a conda-forge es sencillo de hacer. [Puede seguir los pasos detallados proporcionados por el equipo de mantenimiento de conda-forge.](https://conda-forge.org/docs/maintainer/adding_pkgs.html).
ja: パッケージが PyPI に登録されたら、conda-forge にパッケージを追加する手順は簡単です。 [conda-forge メンテナチームが提供している詳細な手順に従うことができます](https://conda-forge.org/docs/maintainer/adding_pkgs.html) 。

source: Click here for a tutorial on adding your package to conda-forge.
es: Haga clic aquí para un tutorial sobre cómo agregar su paquete a conda-forge.
ja: conda-forgeにパッケージを追加するチュートリアルはこちらをご覧ください。

source: If you want a step by step tutorial, click here.
es: Si desea un tutorial paso a paso, haga clic aquí.
ja: ステップバイステップのチュートリアルをご覧になりたい方は、こちらをクリックしてください。

source: Once your package is added, you will have a feedstock repository on GitHub with your packages name
es: Una vez que se agregue su paquete, tendrá un repositorio de feedstock en GitHub con el nombre de su paquete
ja: パッケージが追加されると、GitHub の feedstock リポジトリにパッケージ名が追加されます。

source: [Here is an example conda-forge feedstock for the pyOpenSci approved package - movingpandas](https://github.com/conda-forge/movingpandas-feedstock)
es: [Aquí hay un ejemplo de feedstock de conda-forge para el paquete aprobado por pyOpenSci - movingpandas](https://github.com/conda-forge/movingpandas-feedstock)
ja: [pyOpenSci承認パッケージ - movingpandas のconda-forgeフィードストックの例です](https://github.com/conda-forge/movingpandas-feedstock)

source: Maintaining your conda-forge package repository
es: Mantenimiento de su repositorio de paquetes conda-forge
ja: conda-forge パッケージリポジトリの管理

source: Once your package is on the conda-forge channel, maintaining it is simple. Every time that you push a new version of your package to PyPI, it will kick off a continuous integration build that updates your package in the conda-forge repository. Once that build is complete, you will get a notification to review the update.
es: Una vez que su paquete esté en el canal conda-forge, mantenerlo es simple. Cada vez que envíe una nueva versión de su paquete a PyPI, se iniciará una compilación de integración continua que actualizará su paquete en el repositorio conda-forge. Una vez que se complete esa compilación, recibirá una notificación para revisar la actualización.
ja: いったんあなたのパッケージが conda-forge チャンネルに登録されれば、それを維持するのは簡単です。 新しいバージョンのパッケージを PyPI にプッシュするたびに、conda-forge リポジトリのパッケージを更新する継続的インテグレーションビルドが開始されます。 ビルドが完了すると、更新を確認するための通知が届きます。

source: You can merge the pull request for that update once you are happy with it. A ready-to-merge PR usually means ensuring that your project's dependencies (known as runtime requirements) listed in the updated YAML file found in the pull request match the PyPI metadata of the new release.
es: Puede hacer merge de la pull request para esa actualización una vez que esté contento con ella. Una pull request lista para hacer merge generalmente significa asegurarse de que las dependencias de su proyecto (conocidas como requisitos en tiempo de ejecución) enumeradas en el archivo YAML actualizado en la solicitud de cambio coincidan con los metadatos de PyPI de la nueva versión.
ja: プルリクエストの内容に満足したら、プルリクエストをマージすることができます。 すぐにマージできるPRとは、通常、プルリクエストにある更新されたYAMLファイルに記載されているあなたのプロジェクトの依存関係（実行時要件として知られています）が、新しいリリースのPyPIメタデータと一致していることを確認することです。

source: Use a pyproject.toml file for your package configuration & metadata
es: Use un archivo pyproject.toml para la configuración y metadatos de su paquete
ja: パッケージの設定とメタデータにはpyproject.tomlファイルを使用します。

source: Important pyproject.toml take aways
es: Conclusiones importantes de pyproject.toml
ja: pyproject.tomlから得られる重要なこと

source: There are only two tables that are required for an installable Python package: **[build-system]** and **[project]**. The **[project]** table stores your package's metadata.
es: Existen solo dos tablas que son necesarias para un paquete de Python instalable: **[build-system]** y **[project]**. La tabla **[project]** almacena los metadatos de su paquete.
ja: インストール可能なPythonパッケージに必要なテーブルは2つだけです: **[build-system]** と **[project]** です。 **[project]** テーブルにはパッケージのメタデータが格納されます。

source: There are only two _required_ fields in the **[project]** table: **name=** and **version=**.
es: Existen solo dos campos _requeridos_ en la tabla **[project]**: **name=** y **version=**.
ja: **[project]** テーブルの必須フィールドは2つだけです: **name=**と **version=** です。

source: We suggest you add additional metadata to your `pyproject.toml` file as it will make it easier for users to find your project on PyPI.
es: Le sugerimos que agregue metadatos adicionales a su archivo `pyproject.toml` ya que facilitará que los usuarios encuentren su proyecto en PyPI.
ja: `pyproject.toml` ファイルにメタデータを追加することをお勧めします。 そうすることで、ユーザがPyPIであなたのプロジェクトを見つけやすくなります。

source: When you are adding classifiers to the [project] table, only use valid values from [PyPI’s classifier page](https://PyPI.org/classifiers/). An invalid value here will raise an error when you build your package or publish to PyPI.
es: Cuando esté agregando clasificadores a la tabla [project], solo use valores válidos de [la página de clasificadores de PyPI](https://PyPI.org/classifiers/). Un valor inválido aquí generará un error cuando construya su paquete o publique en PyPI.
ja: [project] テーブルに分類を追加するときは、 [PyPIの分類ページ](https://PyPI.org/classifiers/) にある有効な値のみを使用してください。 ここで無効な値を指定すると、パッケージをビルドするときやPyPIに公開するときにエラーが発生します。

source: There is no specific order for tables in the `pyproject.toml` file. However fields need to be placed within the correct table sections. For example `requires =` always need to be associated with the **[build-system]** table.
es: No hay un orden específico para las tablas en el archivo `pyproject.toml`. Sin embargo, los campos deben colocarse dentro de las secciones de tabla correctas. Por ejemplo, `requires =` siempre debe estar asociado con la tabla **[build-system]**.
ja: `pyproject.toml` ファイル内のテーブルには特定の順番はありません。 しかし、フィールドは正しいテーブルセクションに配置する必要があります。 例えば `requires =` は常に **[build-system]** テーブルと関連付ける必要があります。

source: **python-requires**: is important to have in your `pyproject.toml` file as it helps pip install your package.
es: **python-requires**: es importante tenerlo en su archivo `pyproject.toml` ya que ayuda a pip a instalar su paquete.
ja: **python-requires**: `pyproject.toml`ファイルに記述することが重要です。 これはpipがパッケージをインストールするのに役立つからです。

source: when these are published, remove this todo
es: cuando se publiquen, elimine este todo
ja: これらが公開されたら、このtodoを削除します

source: Need help creating your pyproject.toml file? This tutorial will walk you through the process.
es: ¿Necesita ayuda para crear su archivo pyproject.toml? Este tutorial lo guiará a través del proceso.
ja: pyproject.tomlファイルの作成にヘルプが必要ですか？ このチュートリアルはそのプロセスを説明します。

source: Click here if need help migrating from setup.py/setup.cfg to pyproject.toml
es: Haga clic aquí si necesita ayuda para migrar de setup.py/setup.cfg a pyproject.toml
ja: setup.py/setup.cfg から pyproject.toml への移行にヘルプが必要な場合はここをクリックしてください。

source: About the pyproject.toml file
es: Aceca del archivo pyproject.toml
ja: pyproject.tomlファイルについて

source: Every modern Python package should include a `pyproject.toml` file. If your project is pure Python and you're using a `setup.py` or `setup.cfg` file to describe its metadata, you should consider migrating your metadata and build information to a `pyproject.toml` file.
es: Cada paquete de Python moderno debe incluir un archivo `pyproject.toml`. Si su proyecto solamente utiliza Python y está utilizando un archivo `setup.py` o `setup.cfg` para describir sus metadatos, debería considerar migrar sus metadatos e información de construcción a un archivo `pyproject.toml`.
ja: 最近の Python パッケージには `pyproject.toml` ファイルが含まれているはずです。 もしあなたのプロジェクトが純粋な Python で、メタデータを記述するために `setup.py` や `setup.cfg` ファイルを使っているなら、メタデータとビルド情報を `pyproject.toml` ファイルに移行することを検討するべきです。

source: If your project isn’t pure-python, you might still require a `setup.py` file to build the non Python extensions. However, a `pyproject.toml` file should still be used to store your project’s metadata.
es: Si su proyecto utiliza otros lenguajes ademas de Python, es posible que aún necesite un archivo `setup.py` para construir las extensiones que no están escritas en Python. Pero aun así, aún se debe usar un archivo `pyproject.toml` para almacenar los metadatos de su proyecto.
ja: あなたのプロジェクトが純粋な Python でない場合、Python 以外の拡張機能をビルドするために `setup.py` ファイルが必要になるかもしれません。 しかし、プロジェクトのメタデータを保存するために `pyproject.toml` ファイルを使用する必要があります。

source: What happened to setup.py & how do i migrate to pyproject.toml?
es: ¿Qué pasó con setup.py y cómo migro a pyproject.toml?
ja: setup.pyに何が起こったのか、そしてどのようにpyproject.tomlに移行するのか？

source: Prior to August 2017, Python package metadata was stored either in the `setup.py` file or a `setup.cfg` file. In recent years, there has been a shift to storing Python package metadata in a much more user-readable `pyproject.toml` format. Having all metadata in a single file:
es: Antes de agosto de 2017, los metadatos de los paquetes de Python se almacenaban en el archivo `setup.py` o en un archivo `setup.cfg`. En los últimos años, se ha pasado a almacenar los metadatos de los paquetes de Python en el fichero `pyproject.toml`, que es mucho más legible para el usuario. Tener todos los metadatos en un solo archivo:
ja: 2017年8月以前は、Pythonパッケージのメタデータは `setup.py` ファイルか `setup.cfg` ファイルに保存されていました。 近年、Python パッケージのメタデータは、よりユーザが読みやすい `pyproject.toml` フォーマットで保存されるようになりました。 すべてのメタデータを1つのファイルに持つことです:

source: simplifies package management,
es: simplifica la gestión de paquetes,
ja: パッケージ管理を簡素化します、

source: allows you to use a suite of different [build backends](https://www.pyopensci.org/python-package-guide/package-structure-code/python-package-build-tools.html#build-back-ends) such as (flit-core, hatchling, pdm-build), and
es: le permite usar una serie de diferentes [backends de construcción](https://www.pyopensci.org/python-package-guide/package-structure-code/python-package-build-tools.html#build-back-ends) como (flit-core, hatchling, pdm-build), y
ja: (flit-core, hatchling, pdm-build)のような一連の異なる [ビルドバックエンド](https://www.pyopensci.org/python-package-guide/package-structure-code/python-package-build-tools.html#build-back-ends) を使うことができます。
