Repository: pyOpenSci/python-package-guide
Catalog: locales/*/LC_MESSAGES/package-structure-code.po
Languages: es, ja

source: Optional dependencies dependencies can be optionally installed by users depending upon their needs. There are two broad groups of optional dependencies:
es: Las dependencias opcionales pueden ser instaladas opcionalmente por los usuarios dependiendo de sus necesidades. Hay dos grupos amplios de dependencias opcionales:
ja: オプションの依存関係依存関係は、ユーザーが必要に応じてオプションでインストールすることができます。 オプションの依存関係には、大きく分けて2つのグループがあります:

source: **Development dependencies**: These are dependencies that are required to support development of your package. They include tools to run tests such as `pytest`, linters (like `flake8` and `ruff`) and code formatters such as `black` and even automation tools such as `nox` or `tox` that run tasks.
es: **Dependencias de desarrollo**: Estas son dependencias que son necesarias para apoyar el desarrollo de su paquete. Incluyen herramientas para ejecutar pruebas como `pytest`, linters (como `flake8` y `ruff`) y formateadores de código como `black` e incluso herramientas de automatización como `nox` o `tox` que ejecutan tareas.
ja: **開発依存** :これらは、あなたのパッケージの開発をサポートするために必要な依存関係です。pytest` のようなテストを実行するツールや、 ( `flake8` や `ruff` のような) リンター、`black` のようなコードフォーマッター、さらにはタスクを実行する `nox` や `tox` のような自動化ツールも含まれます。

source: **Feature dependencies:** These are dependencies that a user can chose to install to add functionality to your package.
es: **Dependencias de funcionalidades:** Estas son dependencias que un usuario puede elegir instalar para agregar funcionalidad a su paquete.
ja: **Feature dependencies:** これらは、パッケージに機能を追加するために、ユーザーが インストールを選択できる依存関係です。

source: When a Python project is installed, the Python package manager (either `pip` or `conda`) installs your package's dependencies automatically. This ensures that when you call a function in a specific dependency, it is available in your user's environment.
es: Cuando se instala un proyecto de Python, el administrador de paquetes de Python (ya sea `pip` o `conda`) instala automáticamente las dependencias de su paquete. Esto garantiza que cuando llame a una función en una dependencia específica, esté disponible en el entorno de su usuario.
ja: Python プロジェクトがインストールされると、Python パッケージマネージャ (`pip` または `conda`) はパッケージの依存関係を自動的にインストールします。これにより、特定の依存関係にある関数を呼び出すと、ユーザーの環境でその関数が利用できるようになります。

source: Dependencies can be added to your pyproject.toml file
es: Las dependencias se pueden agregar a su archivo pyproject.toml
ja: 依存関係はpyproject.tomlファイルに追加できます

source: In the [pyproject.toml overview page](pyproject-toml-python-package-metadata), you learned how to set up a **pyproject.toml** file with basic metadata for your package. On this page, you will learn how to specify different types of dependencies in your `pyproject.toml`.
es: En la página de descripción general de [pyproject.toml](pyproject-toml-python-package-metadata), aprendió cómo configurar un archivo **pyproject.toml** con metadatos básicos para su paquete. En esta página, aprenderá cómo especificar diferentes tipos de dependencias en su `pyproject.toml`.
ja: [pyproject.tomlの概要ページ](pyproject-toml-python-package-metadata) では、パッケージの基本的なメタデータを持つ **pyproject.toml** ファイルをセットアップする方法を学びました。 このページでは、 `pyproject.toml` で異なるタイプの依存関係を指定する方法を学びます。

source: How do you declare dependencies?
es: ¿Cómo declarar dependencias?
ja: 依存関係はどのように宣言するのか？

source: We recommend that you declare your dependencies using your `pyproject.toml` file. This ensures that all of the metadata associated with your package is declared in a single place, making it simpler for users and contributors to understand your package infrastructure.
es: Recomendamos que declare sus dependencias utilizando su archivo `pyproject.toml`. Esto garantiza que todos los metadatos asociados con su paquete se declaren en un solo lugar, lo que facilita a los usuarios y colaboradores comprender la infraestructura de su paquete.
ja: 依存関係は `pyproject.toml` ファイルを使って宣言することを推奨します。 こうすることで、パッケージに関連するすべてのメタデータが一箇所で宣言され、ユーザや貢献者がパッケージのインフラストラクチャを理解するのがより簡単になります。

source: Previously, it was common to use a `requirements.txt` file to declare package dependencies. However in recent years, the ecosystem has moved to storing this information in your **pyproject.toml** file. You may notice however that some projects still maintain a `requirements.txt` file for specific local development needs.
es: Anteriormente, era común usar un archivo `requirements.txt` para declarar las dependencias del paquete. Sin embargo, en los últimos años, el ecosistema ha pasado a almacenar esta información en su archivo **pyproject.toml**. Sin embargo, puede notar que algunos proyectos todavía mantienen un archivo `requirements.txt` para necesidades específicas de desarrollo local.
ja: 以前は `requirements.txt` ファイルを使ってパッケージの依存関係を宣言するのが一般的でした。しかし近年、エコシステムはこの情報を **pyproject.toml** ファイルに保存するようになりました。しかし、プロジェクトによっては、特定のローカルな開発ニーズのために `requirements.txt` ファイルを保持していることに気づくかもしれません。

source: Other ways you may see packages storing dependencies
es: Otros métodos que puede ver para almacenar dependencias de paquetes
ja: パッケージが依存関係を保存する他の方法

source: If a project contains extensions written in other languages, you may need a `setup.py` file. Or you may contribute to a package that us using `setup.cfg` for dependency declaration. [Learn more about this in the setuptools documentation](https://setuptools.pypa.io/en/latest/userguide/dependency_management.html#declaring-required-dependency)
es: Si un proyecto contiene extensiones escritas en otros lenguajes, es posible que necesite un archivo `setup.py`. O puede contribuir a un paquete que esté utilizando `setup.cfg` para la declaración de dependencias. [Obtenga más información sobre esto en la documentación de setuptools](https://setuptools.pypa.io/en/latest/userguide/dependency_management.html#declaring-required-dependency)
ja: プロジェクトが他の言語で書かれた拡張機能を含んでいる場合、 `setup.py` ファイルが必要になるかもしれません。あるいは、依存関係の宣言に `setup.cfg` を使っているパッケージに貢献することもできます。 [これについては setuptools のドキュメントを参照してください](https://setuptools.pypa.io/en/latest/userguide/dependency_management.html#declaring-required-dependency)

source: Add required dependencies to your pyproject.toml file
es: Añadir dependencias requeridas a su archivo pyproject.toml
ja: 必要な依存関係をpyproject.tomlファイルに追加

source: Your core project dependencies need to be installed by a package manager such as `pip` or `conda` when a user installs your package. You can add those dependencies to the `dependencies` array located within the `[project]` table of your **pyproject.toml** file. This looks something like this:
es: Las dependencias principales de su proyecto deben ser instaladas por un administrador de paquetes como `pip` o `conda` cuando un usuario instala su paquete. Puede agregar esas dependencias a la clave `dependencies` ubicada dentro de la tabla `[project]` de su archivo **pyproject.toml**. Se asemejará a lo siguiente:
ja: コアプロジェクトの依存関係は、ユーザがパッケージをインストールするときに `pip` や `conda` のようなパッケージマネージャによってインストールされる必要があります。 これらの依存関係は、**pyproject.toml** ファイルの `[project]` テーブルにある `dependencies` 配列に追加することができます。 これは次のようになります:

source: Remember that fewer dependencies to install reduces the likelihood of version mismatches in user environments.
es: Recuerde que menos dependencias para instalar reduce la probabilidad de desajustes de versiones en los entornos de los usuarios.
ja: インストールする依存関係を少なくすることで、ユーザー環境でのバージョン不一致の可能性が低くなることを覚えておいてください。

source: A dependency example
es: Un ejemplo de dependencia
ja: 依存関係の例

source: Let's pretend you have a package called `plotMe` that creates beautiful plots of data stored in `numpy` arrays. To create your plots in the `plotMe` package, you use the `seaborn` package to stylize our plots and also `numpy` to process array formatted data.
es: Digamos que tiene un paquete llamado `plotMe` que crea gráficos hermosos de datos almacenados en matrices `numpy`. Para crear gráficos con el paquete `plotMe`, utiliza el paquete `seaborn` para estilizar los gráficos y también `numpy` para procesar datos formateados en matrices.
ja: `numpy` 配列に格納されたデータの美しいプロットを作成する `plotMe` というパッケージがあるとしましょう。 `plotMe` パッケージでプロットを作成するには、 `seaborn` パッケージを使用してプロットをスタイリングし、 `numpy` パッケージを使用して配列フォーマットのデータを処理します。

source: In the example above, the plotMe package, depends upon two packages:
es: En el ejemplo anterior, el paquete plotMe depende de dos paquetes:
ja: 上の例では、plotMeパッケージは2つのパッケージに依存しています:

source: This means that in order for plotMe to work in a user's `environment` when installed, you also need to ensure that they have both of those required `dependencies` installed in their environment too.
es: Esto significa que para que plotMe funcione en un `entorno` de usuario cuando se instala, también debe asegurarse de que tengan instaladas esas dos `dependencias` requeridas en su entorno.
ja: つまり、plotMeをインストールしたユーザーの `環境` で動作させるためには、そのユーザーの環境にも必要な `依存関係` の両方がインストールされていることを確認する必要があります。

source: Declaring a dependency in your `pyproject.toml` file will ensure that it is listed as a required dependency when your package is published to PyPI and that a package manager (`pip` or `conda`) will automatically install it into a user's environment alongside your package:
es: Declarar una dependencia en su archivo `pyproject.toml` garantizará que se liste como una dependencia requerida cuando su paquete se publique en PyPI y que un administrador de paquetes (`pip` o `conda`) la instalará automáticamente en el entorno de un usuario junto con su paquete:
ja: 依存関係を `pyproject.toml` ファイルで宣言することで、あなたのパッケージが PyPI に公開されるときに必須の依存関係としてリストされ、パッケージマネージャ ( `pip` や `conda` ) があなたのパッケージと一緒にユーザーの環境に自動的にインストールするようになります:

source: Optional dependencies for building your documentation, running your tests and building your package's distribution files are often referred to as development dependencies. These are the dependencies that a user needs to work on your package locally and perform tasks such as:
es: Las dependencias opcionales para construir su documentación, ejecutar sus tests y construir los archivos de distribución de su paquete a menudo se denominan dependencias de desarrollo. Estas son las dependencias que un usuario necesita para trabajar en su paquete localmente y realizar tareas como:
ja: ドキュメントの構築、テストの実行、パッケージの配布ファイルの構築のための オプションの依存関係は、しばしば開発依存関係と呼ばれます。 これらは、ユーザがあなたのパッケージをローカルで作業し、以下のようなタスクを実行するために必要な依存関係です:

source: running your test suite
es: correr su suite de tests
ja: テストスイートの実行

source: building your documentation
es: construir su documentación
ja: ドキュメントの作成

source: linting and other code cleanup tools
es: linting y otras herramientas de limpieza de código
ja: リンティングとその他のコードクリーンナップツール

source: Create optional dependency groups
es: Crear grupos de dependencias opcionales
ja: オプションの依存グループを作成する

source: To declare optional dependencies in your **pyproject.toml** file:
es: Para declarar dependencias opcionales en su archivo **pyproject.toml**:
ja: **pyproject.toml** ファイルでオプションの依存関係を宣言します:

source: Create named groups of dependencies using the syntax:
es: Crear grupos nombrados de dependencias utilizando la sintaxis:
ja: 構文を使って、依存関係の名前付きグループを作成します:

source: Installing packages from GitHub / Gitlab
es: Instalando paquetes desde GitHub / Gitlab
ja: GitHub / Gitlab からパッケージをインストールする

source: If you have dependencies that need to be installed directly from GitHub using a `git+https` installation approach, you can do so using the pyproject.toml file like so:
es: Si tiene dependencias que deben instalarse directamente desde GitHub utilizando un enfoque de instalación `git+https`, puede hacerlo utilizando el archivo pyproject.toml de la siguiente manera:
ja: GitHubから直接インストールする必要がある依存関係がある場合は、`git+https`というインストール方法を使います、以下のように `pyproject.toml` ファイルを使用します:

source: IMPORTANT: For security reasons, if your library depends on a GitHub-hosted project, you will need to point to a specific commit/tag/hash of that repository in order to upload your project to PyPI
es: IMPORTANTE: Por razones de seguridad, si su biblioteca depende de un proyecto alojado en GitHub, deberá apuntar a un commit/tag/hash específico de ese repositorio para cargar su proyecto en PyPI
ja: 重要:セキュリティ上の理由から、あなたのライブラリがGitHubでホストされているプロジェクトに依存している場合、あなたのプロジェクトをPyPIにアップロードするには、そのリポジトリの特定のコミット/タグ/ハッシュを指す必要があります。

source: Below we've created three sets of optional development dependencies named: tests, docs and lint. We've also added a set of feature dependencies.
es: A continuación, hemos creado tres conjuntos de dependencias de desarrollo opcionales llamadas: tests, docs y lint. También hemos agregado un conjunto de dependencias de funcionalidades.
ja: 以下では、tests、docs、lintという3つのオプションの開発依存関係を作成しました。また、機能依存のセットも追加しました。

source: Additional dependency resources
es: Recursos de dependencias adicionales
ja: その他の依存リソース

source: [Learn more: View PyPA's overview of declaring optional dependencies](https://packaging.python.org/en/latest/specifications/declaring-project-metadata/#dependencies-optional-dependencies)
es: [Más información: Vea la descripción general de PyPA sobre la declaración de dependencias opcionales](https://packaging.python.org/en/latest/specifications/declaring-project-metadata/#dependencies-optional-dependencies)
ja: [詳細はこちら: PyPAのオプション依存関係の宣言の概要を見る](https://packaging.python.org/en/latest/specifications/declaring-project-metadata/#dependencies-optional-dependencies)

source: Install dependency groups
es: Instalar grupos de dependencias
ja: 依存グループをインストールする

source: Using `python -m pip install` vs. `pip install`
es: Usando `python -m pip install` vs. `pip install`
ja: `python -m pip install` と `pip install` の比較

source: In all of the examples in this guide, you will notice we are calling `pip` using the syntax:
es: En todos los ejemplos de esta guía, notará que estamos llamando a `pip` utilizando la sintaxis:
ja: このガイドのすべての例で、構文を使って `pip` を呼び出していることに気づくでしょう:

source: Calling pip using `python -m` ensures that the `pip` that you are using to install your package comes from your current active Python environment. We strongly suggest that you use this approach whenever you call `pip` to avoid installation conflicts.
es: Llamar a pip usando `python -m` asegura que la versión de `pip` que está utilizando para instalar su paquete provenga de su entorno de Python activo actual. Le sugerimos encarecidamente que utilice este método siempre que llame a `pip` para evitar conflictos de instalación.
ja: `python -m` を使用して pip を呼び出すと、パッケージをインストールするために使用する `pip` が、現在アクティブな Python 環境のものであることが保証されます。インストールの衝突を避けるために、 `pip` を呼び出すときは常にこの方法を使うことを強く推奨します。

source: To ensure this works as you want it to, activate your package's development environment prior to installing anything using `pip`.
es: Para asegurarse de que esto funcione como desea, active el entorno de desarrollo de su paquete antes de instalar cualquier cosa usando `pip`.
ja: これが思い通りに動くようにするには、 `pip` を使って何かをインストールする前に、パッケージの開発環境を有効にしてください。

source: You can install development dependencies using the groups that you defined above using the syntax:
es: Puede instalar dependencias de desarrollo utilizando los grupos que definió anteriormente usando la sintaxis:
ja: 上記で定義したグループを使用して、構文を使って開発依存ファイルをインストールすることができます:

source: Above you install:
es: Previamente instaló:
ja: 上記でインストールするのは:

source: dependencies needed for your documentation (`docs`),
es: dependencias necesarias para su documentación (`docs`),
ja: ドキュメント (`docs`) に必要な依存関係、

source: your package
es: su paquete
ja: あなたのパッケージ

source: using pip. Below you install your package, required dependencies and optional test dependencies.
es: usando pip. A continuación, instala su paquete, las dependencias requeridas y las dependencias de tests opcionales.
ja: pipを使います。 以下では、パッケージ、必要な依存関係、オプションのテスト依存関係をインストールします。

source: For zsh shell users
es: Para usuarios de shell zsh
ja: zshシェルユーザーの場合

source: There are different shell applications that you and your package contributors might use.
es: Hay diferentes aplicaciones de shell que usted y los colaboradores de su paquete podrían usar.
ja: あなたやパッケージの貢献者が使うかもしれません、さまざまなシェルアプリケーションがあります。

source: zsh is the shell that comes by default on newer Mac OS computers
es: zsh es la shell que viene por defecto en los ordenadored Mac OS más nuevos
ja: zsh は、新しい Mac OS コンピュータにデフォルトで搭載されているシェルです

source: Windows users may use a tool such as git bash
es: Usuarios de Windows pueden usar una herramienta como git bash
ja: Windowsユーザーは、git bashのようなツールを使うことができます

source: Some shells don't support unquoted brackets (`[tests]`) which is why we add quotes to the command in this guide like this:
es: Algunas shells no admiten corchetes sin comillas (`[tests]`), por eso agregamos comillas al comando en esta guía de la siguiente manera:
ja: シェルによっては、引用符で囲まれていない括弧 (`[tests]`) をサポートしていないものもあるので、このガイドではこのようにコマンドに引用符を追加しています:

source: In some cases you may see commands without the quotes in guidebooks or contributing guides like the example below:
es: En algunos casos, puede ver comandos sin comillas en guías o guías de contribución como el ejemplo a continuación:
ja: ガイドブックやコントリビューションガイドでは、以下の例のように引用符を使わないコマンドを見かけることがあります:

source: Calling your-package[tests] without the double quotes will work on some shells *but not all*.
es: Llamar a su-paquete[tests] sin las comillas dobles funcionará en algunas shells *pero no en todas*.
ja: 二重引用符を付けずに your-package[tests] を呼び出すと、一部のシェルでは動作しますが、 *すべてではありません* 。

source: Combining sets of dependencies
es: Combina conjuntos de dependencias
ja: 依存関係のセットを組み合わせる

source: Above we reviewed how to install dependencies from your `pyproject.toml`. In some cases you may want to group sets of dependencies like so:
es: Anteriormente hemos discutido cómo instalar dependencias desde su `pyproject.toml`. En algunos casos, es posible que desee agrupar conjuntos de dependencias de la siguiente manera:
ja: 上記では、 `pyproject.toml` から依存関係をインストールする方法を説明しました。 場合によっては、依存関係のセットをこのようにグループ化したいこともあるでしょう:

source: The above allows you to install both the tests and docs dependency lists using the command:
es: Lo anterior le permite instalar tanto las listas de dependencias de tests como de docs usando el comando:
ja: 上記のコマンドを使えば、testsとdocsの両方の依存リストをインストールできます:

source: When you install dependencies using the above syntax:
es: Cuando instala dependencias utilizando la sintaxis anterior:
ja: 上記の構文を使って依存関係をインストールする場合:

source: `pip` will also install your package and its core dependencies.
es: `pip` también instalará su paquete y sus dependencias principales.
ja: `pip` はあなたのパッケージとそのコアの依存関係もインストールします。

source: Where does conda fit in?
es: Dónde encaja conda?
ja: condaはどこに入りますか？

source: The `pyproject.toml` file allows you to list any Python package published on PyPI (or on GitHub/ GitLab) as a dependency. Once you create this file, declare dependencies, [build your package](python-package-distribution-files-sdist-wheel.md) and [publish your package to PyPI](publish-python-package-pypi-conda.md), people can install both your package and all of it's dependencies with one command.
es: El archivo `pyproject.toml` le permite enumerar cualquier paquete de Python publicado en PyPI (o en GitHub / GitLab) como una dependencia. Una vez que cree este archivo, declare dependencias, [construya su paquete](python-package-distribution-files-sdist-wheel.md) y [publique su paquete en PyPI](publish-python-package-pypi-conda.md), las personas pueden instalar tanto su paquete como todas sus dependencias con un solo comando.
ja: `pyproject.toml` ファイルを使うと、PyPI(またはGitHub/ GitLab)で公開されているPythonパッケージを依存関係として列挙することができます。 このファイルを作成し、依存関係を宣言し、 [パッケージをビルドする](python-package-distribution-files-sdist-wheel.md) 、 [パッケージをPyPIに公開する](publish-python-package-pypi-conda.md) とすると、1つのコマンドであなたのパッケージと依存関係のあるパッケージの両方をインストールすることができます。

source: This works great if your package is pure-python (no other languages used).
es: Esto funciona muy bien si su paquete es de Python puro (no se utilizan otros lenguajes).
ja: これは、パッケージが純粋なpython (他の言語が使われていない) のであれば、とてもうまくいきます。

source: Some packages, particularly in the scientific Python ecosystem, require dependencies that are not written in Python. Conda was created to support distribution of tools that have code written in both Python and languages other than Python.
es: Algunos paquetes, especialmente en el ecosistema científico de Python, requieren dependencias que no están escritas en Python. Conda se creó para admitir la distribución de herramientas que tienen código escrito tanto en Python como en otros lenguajes que no sean Python.
ja: いくつかのパッケージ、特に科学的なPythonエコシステムでは、Pythonで書かれていない依存関係を必要とします。 Condaは、PythonとPython以外の言語の両方で書かれたコードを持つツールの配布をサポートするために作られました。

source: Support conda users with environment.yml files
es: Apoye a los usuarios de conda con archivos environment.yml
ja: environment.yml ファイルで conda ユーザーをサポートする

source: The above workflow assumes that you want to publish your package on PyPI. And then you plan to publish to conda-forge (optionally), [by submitting a recipe using grayskull](https://www.pyopensci.org/python-package-guide/package-structure-code/publish-python-package-pypi-conda.html).
es: El flujo de trabajo anterior asume que desea publicar su paquete en PyPI. Y luego planea publicar en conda-forge (opcionalmente), [enviando una receta usando grayskull](https://www.pyopensci.org/python-package-guide/package-structure-code/publish-python-package-pypi-conda.html).
ja: 上記のワークフローは、PyPIでパッケージを公開することを想定しています。そして、 [grayskullを使ってレシピを投稿する](https://www.pyopensci.org/python-package-guide/package-structure-code/publish-python-package-pypi-conda.html) ことで、conda-forgeに(オプションで)公開する予定です。

source: If you want to support conda users, you may want to also maintain a conda environment that they can use to install your package. Maintaining a conda environment will also help you test that your package installs as you expect into a conda environment.
es: Si desea apoyar a los usuarios de conda, es posible que también desee mantener un entorno de conda que puedan usar para instalar su paquete. Mantener un entorno de conda también le ayudará a probar que su paquete se instala como espera en un entorno de conda.
ja: conda ユーザーをサポートしたいのであれば、彼らがあなたのパッケージをインス トールするのに使える conda 環境も管理した方が良いでしょう。 conda 環境を維持することは、あなたのパッケージが conda 環境に期待通りにインストールされるかをテストするのにも役立ちます。

source: A note for conda users
es: Una nota para los usuarios de conda
ja: condaユーザーへのメモ

source: If you use a conda environment for developing your tool, keep in mind that when you install your package using `python -m pip install -e .` (or using pip in general), dependencies will be installed from PyPI rather than conda.
es: Si utiliza un entorno de conda para desarrollar su herramienta, tenga en cuenta que cuando instala su paquete usando `python -m pip install -e .` (o usando pip en general), las dependencias se instalarán desde PyPI en lugar de conda.
ja: ツールの開発にconda環境を使用している場合、 `python -m pip install -e .` を使用してパッケージをインストールするとき（または一般的にpipを使用するとき）、依存関係はcondaではなくPyPIからインストールされることに注意してください。

source: Thus, if you are running a conda environment, installing your package in "editable" mode risks dependency conflicts. This is particularly important if you have a spatial package that requires geospatial system libraries like GDAL or another system-level dependency.
es: Por lo tanto, si está ejecutando un entorno de conda, instalar su paquete en modo "editable" puede provocar conflictos de dependencia. Esto es particularmente importante si tiene un paquete que requiere bibliotecas de sistema geoespaciales como GDAL u otra dependencia de nivel de sistema.
ja: したがって、conda環境を実行している場合、パッケージを "editable "モードでインス トールすると、依存関係が衝突する危険性があります。 これは、GDALのような地理空間システムライブラリや他のシステムレベルの依存関係を必要とする空間パッケージがある場合、特に重要です。
