Repository: pyOpenSci/python-package-guide
Catalog: locales/*/LC_MESSAGES/package-structure-code.po
Languages: es, ja

source: aligns with modern best practices.
es: se alinea con las mejores prácticas modernas.
ja: 現代のベストプラクティスに合致しています。

source: The standard file that Python packages use to [specify build requirements and metadata is called a **pyproject.toml**](https://packaging.python.org/en/latest/specifications/declaring-project-metadata/). Adding metadata, build requirements and package dependencies to a **pyproject.toml** file replaces storing that information in a setup.py or setup.cfg file.
es: El archivo estándar que utilizan los paquetes de Python para [especificar los requisitos de construcción y los metadatos se llama **pyproject.toml**](https://packaging.python.org/en/latest/specifications/declaring-project-metadata/). Agregar metadatos, requisitos de construcción y dependencias de paquetes a un archivo **pyproject.toml** reemplaza el almacenamiento de esa información en un archivo setup.py o setup.cfg.
ja: Python パッケージが [ビルド要件とメタデータを指定するために使う標準のファイルは **pyproject.toml** と呼ばれます](https://packaging.python.org/en/latest/specifications/declaring-project-metadata/) 。メタデータ、ビルド要件、パッケージの依存関係を **pyproject.toml** ファイルに追加することは、 setup.py や setup.cfg ファイルに情報を格納することに取って代わります。

source: About the .toml format
es: Aceca del formato .toml
ja: .toml フォーマットについて

source: The **pyproject.toml** file is written in [TOML (Tom's Obvious, Minimal Language) format](https://toml.io/en/). TOML is an easy-to-read structure that is founded on key/value pairs. Each section in the **pyproject.toml** file contains a `[table identifier]`. Below that table identifier are key/value pairs that support configuration for that particular table.
es: El archivo **pyproject.toml** está escrito en [formato TOML (del inglés, Tom's Obvious, Minimal Language)](https://toml.io/en/). TOML es una estructura fácil de leer que se basa en pares clave/valor. Cada sección en el archivo **pyproject.toml** contiene un `[identificador de tabla]`. Debajo de ese identificador de tabla hay pares clave/valor que admiten la configuración para esa tabla en particular.
ja: **pyproject.toml**ファイルは [TOML(Tom's Obvious, Minimal Language)フォーマット](https://toml.io/en/) で書かれています。 TOMLは読みやすい構造で、キーと値のペアで成り立っています。 **pyproject.toml** ファイルの各セクションは `[テーブル識別子]` を含んでいます。 そのテーブル識別子の下には、その特定のテーブルの設定をサポートするキーと値のペアがあります。

source: Below `[build-system]` is considered a table in the toml language.
es: Bajo `[build-system]` se espera una tabla en el lenguaje TOML.
ja: `[build-system]` 以下はtoml言語ではテーブルとみなされます。

source: Within the `build-system` table below `requires =` is a key.
es: Denro de la tabla `build-system` debajo de `requires =` hay una clave.
ja: 以下の `build-system` テーブルの中で `requires =` がキーです。

source: The associated value for `requires` is an array containing the value `"hatchling"`.
es: El valor asociado para `requires` es un array que contiene el valor `"hatchling"`.
ja: `requires` に関連する値は、値 `"hatchling"` を含む配列です。

source: How the pyproject.toml is used when you build a package
es: ¿Cómo se usa el pyproject.toml cuando se construye un paquete?
ja: パッケージのビルド時にpyproject.tomlがどのように使用されるか

source: When you publish to PyPI, you will notice that each package has metadata listed. Let’s have a look at [xclim](https://pypi.org/project/xclim/), one of our [pyOpenSci packages](https://www.pyopensci.org/python-packages.html). Notice that on the PyPI landing page you see some metadata about the package including python, maintainer information and more. PyPI is able to populate this metadata because it was defined using correct syntax and classifiers by Xclim's maintainers, [pyproject.toml file](https://github.com/Ouranosinc/xclim/blob/master/pyproject.toml). This metadata when the xclim package is built, is translated into a distribution file that allows PyPI to read the metadata and print it out on their website.
es: Cuando publique en PyPI, notará que cada paquete tiene metadatos listados. Echemos un vistazo a [xclim](https://pypi.org/project/xclim/), uno de nuestros [paquetes de pyOpenSci](https://www.pyopensci.org/python-packages.html). Observe que en la página de inicio de PyPI ve algunos metadatos sobre el paquete, incluido Python, información del mantenedor y más. PyPI puede poblar estos metadatos porque fueron definidos utilizando la sintaxis correcta y clasificadores por los mantenedores de Xclim, [archivo pyproject.toml](https://github.com/Ouranosinc/xclim/blob/master/pyproject.toml). Estos metadatos cuando se construye el paquete xclim, se traducen en un archivo de distribución que permite a PyPI leer los metadatos e imprimirlos en su sitio web.
ja: PyPIに公開すると、各パッケージにメタデータがリストされていることに気づくでしょう。[pyOpenSciパッケージ](https://www.pyopensci.org/python-packages.html) の一つである [xclim](https://pypi.org/project/xclim/) を見てみましょう。PyPIのランディングページには、pythonやメンテナ情報など、パッケージに関するメタデータが表示されていることに注目してください。PyPIは、Xclimのメンテナ [pyproject.toml file](https://github.com/Ouranosinc/xclim/blob/master/pyproject.toml) によって正しい構文と分類子を用いて定義されたメタデータを入力することができます。xclimパッケージがビルドされるとき、このメタデータは配布ファイルに変換され、PyPIがメタデータを読み込んでウェブサイトに出力できるようになります。

source: Image showing the left side bar of PyPI for the package xclim. The section at the top says Classifier. Below there is a list of items including Development status, intended audience, License, natural language, operating system, programming language and topic. Below each of those sections are various classifier options." width="300px">
es: Imagen que muestra la barra lateral izquierda de PyPI para el paquete xclim. La sección en la parte superior dice Clasificador. Debajo hay una lista de elementos que incluyen: estado de desarrollo, audiencia prevista, licencia, idioma natural, sistema operativo, lenguaje de programación y tema. Debajo de cada una de esas secciones hay varias opciones de clasificación." width="300px">
ja: xclimパッケージのPyPI左サイドバーの画像です。一番上のセクションにはClassifierとあります。その下に、開発状況、対象読者、ライセンス、自然言語、オペレーティングシステム、プログラミング言語、トピックなどの項目があります。 これらの各セクションの下には、さまざまな分類オプションがあります。 " width="300px">

source: When you add the classifier section to your pyproject.toml and your package is built, the build tool organizes the metadata into a format that PyPI can understand and represent on your PyPI landing page. These classifiers also allow users to sort through packages by version of python they support, categories and more.
es: Cuando agregue la sección de clasificación a su pyproject.toml y se construya su paquete, la herramienta de construcción organiza los metadatos en un formato que PyPI puede entender y representar en la página de inicio de PyPI. Estos clasificadores también permiten a los usuarios ordenar los paquetes por la versión de Python que admiten, categorías y más.
ja: pyproject.tomlにclassifierセクションを追加してパッケージがビルドされると、ビルドツールはメタデータをPyPIが理解できる形式に整理し、PyPIのランディングページに表示します。 これらの分類子により、ユーザはサポートするpythonのバージョンやカテゴリなどでパッケージをソートすることもできます。

source: Benefits of using a pyproject.toml file
es: Beneficios de usar un archivo pyproject.toml
ja: pyproject.tomlファイルを使用する利点

source: Including your package's metadata in a separate human-readable **pyproject.toml** format also allows someone to view the project's metadata in a GitHub repository.
es: Incluir los metadatos de su paquete en un formato **pyproject.toml** separado y legible para humanos también permite a alguien ver los metadatos del proyecto en un repositorio de GitHub.
ja: パッケージのメタデータを人間が読める **pyproject.toml** 形式で含めると、GitHubのリポジトリでプロジェクトのメタデータを見ることができます。

source: Setup.py is still useful for complex package builds
es: Setup.py sigue siendo útil para construcciones de paquetes complejas
ja: Setup.py は、複雑なパッケージのビルドに便利です。

source: Using **setup.py** to manage package builds and metadata [can cause problems with package development](https://blog.ganssle.io/articles/2021/10/setup-py-deprecated.html). In some cases where a Python package build is complex, a **setup.py** file may be required. While this guide will not cover complex builds, we will provide resources working with complex builds in the future.
es: Usar **setup.py** para gestionar construcciones de paquetes y metadatos [puede causar problemas con el desarrollo de paquetes](https://blog.ganssle.io/articles/2021/10/setup-py-deprecated.html). En algunos casos donde la construcción de un paquete de Python es compleja, puede ser necesario un archivo **setup.py**. Si bien esta guía no cubrirá construcciones complejas, proporcionaremos recursos para trabajar con construcciones complejas en el futuro.
ja: パッケージのビルドとメタデータを管理するために **setup.py** を使うことは [パッケージ開発に問題を引き起こす可能性があります](https://blog.ganssle.io/articles/2021/10/setup-py-deprecated.html) 。 Python パッケージのビルドが複雑な場合、**setup.py** ファイルが必要になるかもしれません。 このガイドでは複雑なビルドは扱いませんが、将来的には複雑なビルドを扱うリソースを提供する予定です。

source: Optional vs. Required pyproject.toml file fields
es: Campos opcionales vs. requeridos en el archivo pyproject.toml
ja: pyproject.toml ファイルのフィールドの任意と必須

source: When you create your `pyproject.toml` file, there are numerous metadata fields that you can use. Below we suggest specific fields to get you started that support publication on PyPI and users finding your package.
es: Cuando cree su archivo `pyproject.toml`, hay numerosos campos de metadatos que puede usar. A continuación, sugerimos campos específicos para comenzar que admiten la publicación en PyPI y que los usuarios encuentren su paquete.
ja: `pyproject.toml` ファイルを作成するとき、使用できるメタデータフィールドがたくさんあります。 以下では、PyPI での公開とユーザがあなたのパッケージを見つけることをサポートする、特定のフィールドを提案します。

source: [An overview of all of the project metadata elements can be found here.](https://packaging.python.org/en/latest/specifications/core-metadata/#project-url-multiple-use)
es: [Una descripción general de todos los elementos de metadatos del proyecto se puede encontrar aquí.](https://packaging.python.org/en/latest/specifications/core-metadata/#project-url-multiple-use)
ja: [プロジェクトの全メタデータ要素の概要は、こちらをご覧ください。](https://packaging.python.org/en/latest/specifications/core-metadata/#project-url-multiple-use)

source: Optional fields to include in the `[project]` table
es: Campos opcionales para incluir en la tabla `[project]`
ja: `[project]` テーブルに含めるオプションフィールド

source: We strongly suggest that you also add the metadata keys below as they will help users finding your package on PyPI. These fields will make it clear how your package is structured, what platforms you support and what dependencies your package requires.
es: Le sugerimos que también agregue las claves de metadatos a continuación, ya queayudarán a los usuarios a encontrar su paquete en PyPI. Estos campos dejarán claro cómo está estructurado su paquete, qué plataformas admite y qué dependencias requiere su paquete.
ja: 以下のメタデータキーも追加することを強くお勧めします。 これらのフィールドを追加することで、あなたのパッケージがどのような構造になっているのか、どのプラットフォームをサポートしているのか、どのような依存関係が必要なのかを明確にすることができます。

source: **Description:** this is a short one-line description of your package.
es: **Description:** esta es una descripción corta de una línea de su paquete.
ja: **Description:** これはあなたのパッケージの短い一行説明です。

source: **Readme:** A link to your README.md file is used for the long long-description. This information will be published on your packages PyPI landing page.
es: **Readme:** Un enlace a su archivo README.md se utiliza para la descripción larga. Esta información se publicará en la página de inicio de su paquete en PyPI.
ja: **Readme:** 長い長い説明には README.md ファイルへのリンクが使われます。 この情報はあなたのパッケージのPyPIランディングページで公開されます。

source: **Requires-python** (used by pip): this is a field that is used by pip. Here you tell the installer whether you are using Python 2.x or 3.x. Most projects will be using 3.x.
es: **Requires-python** (usado por pip): este es un campo que es utilizado por pip. Aquí le dice al instalador si está utilizando Python 2.x o 3.x. La mayoría de los proyectos estarán utilizando 3.x.
ja: **Requires-python** (pipで使用): これはpipが使用するフィールドです。 ここでは、Python 2.xと3.xのどちらを使っているかをインストーラに伝えます。 ほとんどのプロジェクトは3.xを使うでしょう。

source: **License:** the license you are using
es: **License:** la licencia que está utilizando
ja: **ライセンス:** 使用しているライセンス

source: **Authors:** these are the original authors of the package. Sometimes the authors are different from the maintainers. Other times they might be the same.
es: **Authors:** estos son los autores originales del paquete. A veces los autores son diferentes de los mantenedores. Otras veces pueden ser los mismos.
ja: **Authors:** パッケージの原作者です。 作者がメンテナと異なることもあります。 また、同じ場合もあります。

source: **Maintainers:** you can choose to populate this or not. You can populate this using a list with a sub element for each author or maintainer name, email
es: **Maintainers:** puede optar por completar esto o no. Puede completar esto utilizando una lista con un subelemento para cada nombre de autor o una cadena de texto conmantenedor, correo electrónico
ja: **Maintainers:** これを入力するかどうかを選択できます。 各作者やメンテナーの名前、Eメール、メールアドレスなどのサブ要素を持つリストを使って、この情報を入力することができます。

source: **dependencies:** dependencies are optional but we strongly suggest you include them in your pyproject.toml. Dependencies will be installed by pip when your project is installed creating a better user-experience.
es: **Dependencies:** las dependencias son opcionales, pero le sugerimos que las incluya en su pyproject.toml. Las dependencias se instalarán con pip cuando se instale su proyecto, creando una mejor experiencia de usuario.
ja: **dependencies:** 依存関係はオプションですが、pyproject.tomlに含めることを強く推奨します。 依存関係はプロジェクトがインストールされるときにpipによってインストールされ、より良いユーザーエクスペリエンスを提供します。

source: **`[project.optional-dependencies]`:** the optional or development dependencies will be installed if someone runs `python -m pip install projectname[dev]`. This is a nice way to include your development dependencies for users who may wish to contribute to your project.
es: **`[project.optional-dependencies]`:** las dependencias opcionales o de desarrollo se instalarán si alguien ejecuta `python -m pip install projectname[dev]`. Esta es una buena manera de incluir sus dependencias de desarrollo para los usuarios que deseen contribuir a su proyecto.
ja: **`[project.optional-dependencies]`:** 誰かが `python -m pip install projectname[dev]` を実行したときに、オプションまたは開発用の依存パッケージがインストールされます。 これは、あなたのプロジェクトに貢献したいユーザのために、開発用の依存関係を含める良い方法です。

source: **keywords:** These are the keywords that will appear on your PyPI landing page. Think of them as words that people might use to search for your package.
es: **keywords:** Estas son las palabras clave que aparecerán en la página de inicio de su paquete en PyPI. Piense en ellas como palabras que la gente podría usar para buscar su paquete.
ja: **keywords:** これらはPyPIのランディングページに表示されるキーワードです。 人々があなたのパッケージを検索するときに使う言葉だと考えてください。

source: **classifiers:** The classifiers section of your metadata is also important for the landing page of your package in PyPI and for filtering of packages in PyPI. A list of [all options for classifiers can be found her](https://PyPI.org/classifiers/)e. Some of the classifiers that you should consider including
es: **classifiers:** La sección de clasificadores de sus metadatos también es importante para la página de inicio de su paquete en PyPI y para filtrar paquetes en PyPI. Una lista de [todas las opciones de clasificadores se puede encontrar aquí](https://PyPI.org/classifiers/). Algunos de los clasificadores que debería considerar incluir
ja: **classifiers:** メタデータのclassifiersセクションは、PyPIでのパッケージのランディングページや、PyPIでのパッケージのフィルタリングにも重要です。 [分類子の全オプションはこちらです](https://PyPI.org/classifiers/) 。 以下のようなクラシファイアを検討する必要があります。

source: Development Status
ja: 開発状況

source: Intended Audience
ja: 対象読者

source: Topic
ja: トピック

source: Programming language
ja: プログラミング言語

source: Advanced options in the pyproject.toml file
es: Opcciones avanzadas en el archivo pyproject.toml
ja: pyproject.tomlファイルの高度なオプション

source: The examples at the bottom of this page contain ...
es: Los ejemplos en la parte inferior de esta página contienen ...
ja: このページの下にある例には ...

source: **`[project.scripts]` (Entry points):** Entry points are optional. If you have a command line tool that runs a specific script hosted in your package, you may include an entry point to call that script directly at the command line (rather than at the Python shell).
es: **`[project.scripts]` (Puntos de entrada):** Los puntos de entrada son opcionales. Si tiene una herramienta de línea de comandos que ejecuta un script específico alojado en su paquete, puede incluir un punto de entrada para llamar a ese script directamente en la línea de comandos (en lugar de en la shell de Python).
ja: **`[project.scripts]` (Entry points):** エントリーポイントは任意です。 パッケージでホストされている特定のスクリプトを実行するコマンドラインツールがある場合、そのスクリプトを(Pythonシェルではなく)コマンドラインで直接呼び出すためのエントリポイントを含めることができます 。

source: Add dependencies to your pyproject.toml file
es: Añadir dependencias a su archivo pyproject.toml
ja: pyproject.tomlファイルに依存関係を追加

source: The pyproject.toml file can also be used as a replacement for the requirements.txt file which has been traditionally used to store development dependencies such as pytest, code formatters such as Black and documentation tools such as sphinx.
es: El archivo pyproject.toml también se puede utilizar como un reemplazo del archivo requirements.txt que tradicionalmente se ha utilizado para almacenar dependencias de desarrollo como pytest, formateadores de código como Black y herramientas de documentación como sphinx.
ja: pyproject.tomlファイルは、従来pytestのような開発依存ファイル、Blackのようなコードフォーマッタ、sphinxのようなドキュメントツールを保存するために使われてきたrequirements.txtファイルの代わりとして使うこともできます。

source: To add dependencies to your build, add a `[project.optional-dependencies]` table to your pyproject.toml file.
es: Para agregar dependencias a su construcción, agregue una tabla `[project.optional-dependencies]` a su archivo pyproject.toml.
ja: ビルドに依存関係を追加するには、 `[project.optional-dependencies]` テーブルをpyproject.tomlファイルに追加します。

source: Then specify dependency groups as follows:
es: Después, especifique grupos de dependencias de la siguiente manera:
ja: 次に、依存グループを以下のように指定する:

source: Following the above example, you install dependencies like this:
es: Siguiendo el ejemplo anterior, instala dependencias de la siguiente manera:
ja: 上記の例に従って、依存関係を次のようにインストールします:

source: The above will install both your package in editable mode and all of the dependencies declared in the tests section of your `[project.optional-dependencies]` table.
es: Lo anterior instalará tanto su paquete en modo editable como todas las dependencias declaradas en la sección de pruebas de su tabla `[project.optional-dependencies]`.
ja: 上記は、編集可能モードのパッケージと、 `[project.optional-dependencies]` テーブルのtestsセクションで宣言されたすべての依存関係の両方をインストールします。

source: To install all dependencies and also your package, you'd use:
es: Para instalar todas las dependencias y también su paquete, usaría:
ja: すべての依存関係をインストールし、あなたのパッケージもインストールするには、次のようにします:

source: Recursive dependencies
es: Dependencias recursivas
ja: 再帰的依存関係

source: You can also setup sets of recursive dependencies. [See this blog post for more.](https://hynek.me/articles/python-recursive-optional-dependencies/)
es: También puede configurar conjuntos de dependencias recursivas. [Vea esta publicación en el blog para más información.](https://hynek.me/articles/python-recursive-optional-dependencies/)
ja: 再帰的依存関係のセットをセットアップすることもできます。 [詳しくはこのブログ記事を参照。](https://hynek.me/articles/python-recursive-optional-dependencies/)

source: Example pyproject.toml for building using hatchling
es: Ejemplo de pyproject.toml para construir usando hatchling
ja: hatchlingを使用してビルドするpyproject.tomlの例

source: Below is an example build configuration for a Python project. This example package setup uses **hatchling** to build the [package's sdist and wheels](python-package-distribution-files-sdist-wheel).
es: A continuación se muestra un ejemplo de configuración de construcción para un proyecto de Python. Esta configuración de paquete de ejemplo utiliza **hatchling** para construir los [archivos sdist y wheels del paquete](python-package-distribution-files-sdist-wheel).
ja: 以下は Python プロジェクトのビルド設定の例です。 このパッケージの設定例では、 [パッケージの sdist と wheel](python-package-distribution-files-sdist-wheel) をビルドするのに **hatchling** を使っています。

source: Notice that dependencies are specified in this file.
es: Nótese que las dependencias se especifican en este archivo.
ja: このファイルには依存関係が指定されています。

source: Example pyproject.toml for building using setuptools
es: Ejemlo de pyproject.toml para construir usando setuptools
ja: setuptoolsを使ってビルドするpyproject.tomlの例

source: The package metadata including authors, keywords, etc is also easy to read. Below you can see the same TOML file that uses a different build system (setuptools). Notice how simple it is to swap out the tools needed to build this package!
es: Los metadatos del paquete, incluidos los autores, palabras clave, etc., también son fáciles de leer. A continuación, puede ver el mismo archivo TOML que utiliza un sistema de construcción diferente (setuptools). ¡Observe lo simple que es cambiar las herramientas necesarias para construir este paquete!
ja: 作者やキーワードなどを含むパッケージのメタデータも読みやすいです。 下の図は、異なるビルドシステム(setuptools)を使った同じTOMLファイルです。 このパッケージのビルドに必要なツールを入れ替えるのがいかに簡単かに注目してください！

source: In this example package setup you use:
es: En esta configuración de paquete de ejemplo, usas:
ja: このパッケージのセットアップ例では:

source: **setuptools** to build the [package's sdist and wheels](python-package-distribution-files-sdist-wheel)
es: **setuptools** para construir los [archivos sdist y wheels del paquete](python-package-distribution-files-sdist-wheel)
ja: [パッケージのsdistとwheel](python-package-distribution-files-sdist-wheel) をビルドするための **setuptools** 。

source: **setuptools_scm** to manage package version updates using version control tags
es: **setuptools_scm** para gestionar las actualizaciones de la versión del paquete utilizando etiquetas de control de versiones
ja: **setuptools_scm** は、バージョン管理タグを使ってパッケージのバージョン更新を管理します。

source: In the example below `[build-system]` is the first table of values. It has two keys that specify the build backend API and containing package:
es: En este ejemplo a continuación `[build-system]` es la primera tabla de valores. Tiene dos claves que especifican la API del backend de construcción y el paquete que contiene:
ja: 以下の例では、`[build-system]` が最初の値のテーブルです。 このテーブルには2つのキーがあり、ビルドバックエンドAPIとそれを含むパッケージを指定します:

source: [Click here to read about our packaging build tools including PDM, setuptools, Poetry and Hatch.](/package-structure-code/python-package-build-tools)
es: [Haga clic aquí para leer sobre nuestras herramientas de construcción de paquetes, incluidas PDM, setuptools, Poetry y Hatch.](/package-structure-code/python-package-build-tools)
ja: [PDM、setuptools、Poetry、Hatch などのパッケージビルドツールについてはこちらをご覧ください。](/package-structure-code/python-package-build-tools)

source: Python Packaging Tools
es: Herramientas de empaquetado de Python
ja: Pythonパッケージングツール

source: Tools for building your package
es: Herramientas para construir su paquete
ja: パッケージ構築のためのツール
