Repository: pyOpenSci/python-package-guide
Catalog: locales/*/LC_MESSAGES/package-structure-code.po
Languages: es, ja

source: Using Setuptools Back-end for Python Packaging with Build Front-end
es: Usando el backend de Setuptools para el empaquetado de Python con el frontend de Build
ja: PythonパッケージングのためのSetuptoolsバックエンドとBuildフロントエンドの使用

source: [Setuptools](https://setuptools.pypa.io/en/latest/) is the most mature Python packaging build tool with [development dating back to 2009 and earlier](https://setuptools.pypa.io/en/latest/history.html#). Setuptools also has the largest number of community users (according to the PyPA survey). Setuptools does not offer a user front-end like Flit, Poetry and Hatch offer. As such you will need to use other tools such as **build** to create your package distributions and **twine** to publish to PyPI.
es: [Setuptools](https://setuptools.pypa.io/en/latest/) es la herramienta de construcción de empaquetado de Python más madura con [desarrollo que data de 2009 y antes](https://setuptools.pypa.io/en/latest/history.html#). Setuptools también tiene el mayor número de usuarios de la comunidad (según la encuesta de PyPA). Setuptools no ofrece un frontend de usuario como Flit, Poetry y Hatch ofrecen. Como tal, necesitará usar otras herramientas como **build** para crear las distribuciones de su paquete y **twine** para publicar en PyPI.
ja: [Setuptools](https://setuptools.pypa.io/en/latest/)は最も成熟したPythonパッケージングビルドツールで、[開発は2009年以前にさかのぼります](https://setuptools.pypa.io/en/latest/history.html#)。 また、（PyPAの調査によると）Setuptoolsは最も多くのコミュニティユーザを抱えています。 Setuptoolsは、Flit、Poetry、Hatchのようなユーザーフロントエンドを提供していません。そのため、パッケージの配布を作成するには **build** を、PyPI に公開するには **twine** などの他のツールを使用する必要があります。

source: While setuptools is the most commonly used tool, we encourage package maintainers to consider using a more modern tool for packaging such as Poetry, Hatch or PDM.
es: Aunque setuptools es la herramienta más comúnmente utilizada, sugerimos a los mantenedores de paquetes a considerar usar una herramienta más moderna para el empaquetado como Poetry, Hatch o PDM.
ja: setuptoolsは最もよく使われるツールですが、パッケージメンテナには、PoetryやHatch、PDMなど、パッケージングにもっとモダンなツールを使うことを検討することをお勧めします。

source: We discuss setuptools here because it's commonly found in the ecosystem and contributors may benefit from understanding it.
es: Discutimos setuptools aquí porque se encuentra muy a menudo en el ecosistema y entenderlo puede beneficiarle.
ja: ここでsetuptoolsについて説明するのは、それがエコシステムでよく見られるものであり、貢献者がそれを理解することで恩恵を受けるかもしれないからです。

source: Setuptools Features
es: Características de Setuptools
ja: Setuptoolsの特徴

source: Some of features of setuptools include:
es: Algunas de las características de setuptools incluyen:
ja: setuptoolsの機能には次のようなものがあります:

source: Fully customizable build workflow
es: Flujo de trabajo de construcción completamente personalizable
ja: 完全にカスタマイズ可能なビルドワークフロー

source: Many scientific Python packages use it.
es: Muchos paquetes científicos de Python lo utilizan.
ja: 多くの科学的Pythonパッケージがこれを使用しています。

source: It offers version control based package versioning using **setuptools_scm**
es: Ofrece versionado de paquetes basado en control de versiones utilizando **setuptools_scm**
ja: **setuptools_scm** を使用したバージョン管理ベースのパッケージのバージョン管理を提供します。

source: It supports modern packaging using **pyproject.toml** for metadata
es: Admite empaquetado moderno utilizando **pyproject.toml** para metadatos
ja: メタデータに **pyproject.toml** を使用した最新のパッケージングをサポートしています。

source: Supports backwards compatibly for older packaging approaches.
es: Admite compatibilidad con versiones anteriores para enfoques de empaquetado antiguos.
ja: 古いパッケージングアプローチの下位互換性をサポートします。

source: Challenges using setuptools
es: Desafíos al usar setuptools
ja: setuptoolsの課題

source: Setuptools has a few challenges:
es: Setuptools tiene algunos desafíos:
ja: Setuptoolsにはいくつかの課題があります:

source: Setuptools does not support interactive features such as auto / tab completion by default if you are working in an IDE like VSCODE and using an editable install for development. [See notes here about pylance support](https://github.com/microsoft/pylance-release/blob/main/TROUBLESHOOTING.md#editable-install-modules-not-found). In comparison, tools such as flit, hatch, PDM support interactive features such as tab / auto completion when using an IDE like VSCODE or pycharm (as long as your version of pip is current!).
es: Setuptools no admite características interactivas como la detección automática de la API por defecto si está trabajando en un IDE como VSCODE y está utilizando una instalación editable para desarrollo. [Vea las notas aquí sobre el soporte de pylance](https://github.com/microsoft/pylance-release/blob/main/TROUBLESHOOTING.md#editable-install-modules-not-found). En comparación, herramientas como flit, hatch, PDM admiten características interactivas como la detección automática de la API cuando se utiliza un IDE como VSCODE o pycharm (¡siempre que su versión de pip esté actualizada!).
ja: Setuptoolsは、VSCODEのようなIDEで作業し、編集可能なインストーラを開発に使用している場合、デフォルトでは自動/タブ補完のようなインタラクティブな機能をサポートしていません。 [pylanceのサポートについてはこちらを参照](https://github.com/microsoft/pylance-release/blob/main/TROUBLESHOOTING.md#editable-install-modules-not-found) 。 それに比べて、flit、hatch、PDMのようなツールは、VSCODEやpycharmのようなIDE（pipのバージョンが最新である限り!）を使っているときに、タブや自動補完のようなインタラクティブな機能をサポートしています。

source: Because **setuptools** has to maintain backwards compatibility across a range of packages, it is not as flexible in its adoption of modern Python packaging standards.
es: Debido a que **setuptools** tiene que mantener la compatibilidad con versiones anteriores en una gama de paquetes, no es tan flexible en su adopción de los estándares de empaquetado de Python modernos.
ja: **setuptools** は様々なパッケージの後方互換性を維持しなければならないため、最新のPythonパッケージング標準を採用する柔軟性がありません。

source: The above-mentioned backwards compatibility makes for a more complex code-base.
es: La compatibilidad con versiones anteriores mencionada anteriormente hace que la base de código sea más compleja.
ja: 上記の後方互換性は、より複雑なコードベースとなります。

source: Your experience as a user will be less streamlined and simple using setuptools compared to other tools discussed on this page.
es: Su experiencia como usuario será más compleja utilizando setuptools en comparación con otras herramientas discutidas en esta página.
ja: このページで説明する他のツールに比べ、setuptoolsを使用した場合、ユーザーとしての体験は合理的でシンプルなものではなくなります。

source: There are also some problematic default settings that users should be aware of when using setuptools. For instance:
es: También hay algunas configuraciones predeterminadas problemáticas de las que los usuarios deben ser conscientes cuando usan setuptools. Por ejemplo:
ja: また、setuptoolsを使用する際にユーザーが注意すべき、問題のあるデフォルト設定がいくつかあります。 例えば:

source: setuptools will build a project without a name or version if you are not using a **pyproject.toml** file to store metadata.
es: setuptools construirá un proyecto sin nombre o versión si no está utilizando un archivo **pyproject.toml** para almacenar metadatos.
ja: メタデータを保存するために **pyproject.toml** ファイルを使用していない場合、setuptoolsは名前やバージョンなしでプロジェクトをビルドします。

source: setuptools also will include all of the files in your package repository if you do not explicitly tell it to exclude files using a **MANIFEST.in** file
es: setuptools también incluirá todos los archivos en el repositorio de su paquete si no le dice explícitamente que excluya archivos utilizando un archivo **MANIFEST.in**
ja: setuptoolsは、 **MANIFEST.in** ファイルを使ってファイルを除外するように明示的に指示しなければ、パッケージリポジトリ内のすべてのファイルも含めます。

source: Learn about Building a Python Package
es: Aprenda sobre la construcción de un paquete de Python
ja: Pythonパッケージのビルドについて学ぶ

source: You need to build your Python package in order to publish it to PyPI (or a conda channel). The build process organizes your code and metadata into a distribution format that can be uploaded to PyPI and subsequently downloaded and installed by users. NOTE: you need to publish a sdist to PyPI in order for conda-forge to properly build your package automatically.
es: Necesita construir su paquete de Python para publicarlo en PyPI (o en un canal de conda). El proceso de construcción organiza su código y metadatos en un formato de distribución que puede ser subido a PyPI y posteriormente descargado e instalado por los usuarios. NOTA: necesita publicar un sdist (distribución del código fuente) en PyPI para que conda-forge pueda construir su paquete automáticamente.
ja: PythonパッケージをPyPI（またはcondaチャンネル）に公開するには、ビルドする必要があります。ビルドプロセスは、あなたのコードとメタデータをPyPIにアップロードできる配布フォーマットに整理し、その後ユーザーがダウンロードしてインストールできるようにします。 注意: conda-forgeが適切にパッケージを自動ビルドするためには、sdistをPyPIに公開する必要があります。

source: What is building a Python package?
es: ¿Qué es construir un paquete de Python?
ja: Pythonパッケージのビルドとは何ですか？

source: To [publish your Python package](publish-python-package-pypi-conda) and make it easy for anyone to install, you first need to build it.
es: Para [publicar su paquete de Python](publish-python-package-pypi-conda) y hacer que sea fácil de instalar para cualquiera, primero necesita construirlo.
ja: [Pythonパッケージを公開](publish-python-package-pypi-conda) し、誰でも簡単にインストールできるようにするには、まずそれをビルドする必要があります。

source: But, what does it mean to build a Python package?
es: Pero, ¿qué significa construir un paquete de Python?
ja: しかし、Pythonのパッケージを作るとは何ですか？

source: [As shown in the figure above](#pypi-conda-channels), when you build your Python package, you convert the source files into something called a distribution package. A distribution package contains your source code and metadata about the package, in the format required by the Python Package Index, so that it can be installed by tools like pip.
es: [Como se muestra en la figura de arriba](#pypi-conda-channels), cuando construye su paquete de Python, convierte los archivos de código fuente en algo llamado paquete de distribución. Un paquete de distribución contiene su código fuente y metadatos sobre el paquete, en el formato requerido por el Python Package Index (PyPI), para que pueda ser instalado por herramientas como pip.
ja: [上の図のように](#pypi-conda-channels), Pythonパッケージをビルドするとき、ソースファイルをディストリビューションパッケージと呼ばれるものに変換します。 配布パッケージには、あなたのソースコードとパッケージのメタデータが、 Python Package Index が要求する形式で含まれています。

source: The term package used to mean many different things in Python and other languages. On this page, we adapt the convention of the [Python Packaging Authority](https://www.pypa.io/en/latest/) and refer to the product of the build step as a **distribution package**.
es: El término paquete solía significar muchas cosas diferentes en Python y otros lenguajes. En esta página, adaptamos la convención de la [Autoridad de Empaquetado de Python](https://www.pypa.io/en/latest/) y nos referimos al producto del paso de construcción como un **paquete de distribución**.
ja: Pythonや他の言語では、パッケージという言葉は様々な意味で使われています。 このページでは、 [Python Packaging Authority](https://www.pypa.io/en/latest/) の慣例に合わせ、ビルドステップの成果物を **配布パッケージ** と呼ぶことにします。

source: This process of organizing and formatting your code, documentation, tests and metadata into a format that both pip and PyPI can use, is called a build step.
es: Este proceso de organizar y formatear su código, documentación, pruebas y metadatos en un formato que tanto pip como PyPI pueden usar, se llama paso de construcción.
ja: あなたのコード、ドキュメント、テスト、メタデータをpipとPyPIの両方が使える形式に整理し、フォーマットするこのプロセスは、ビルドステップと呼ばれます。

source: Project metadata and PyPI
es: Metadatos del proyecto y PyPI
ja: プロジェクトのメタデータとPyPI

source: The metadata that both build tools and PyPI uses to describe and understand your package is generally stored in a [pyproject.toml file](pyproject-toml-python-package-metadata). This metadata is used for several purposes:
es: Los metadatos que tanto las herramientas de construcción como PyPI utilizan para describir y entender su paquete generalmente se almacenan en un [archivo pyproject.toml](pyproject-toml-python-package-metadata). Estos metadatos se utilizan para varios propósitos:
ja: ビルドツールとPyPIの両方があなたのパッケージを説明し理解するために使うメタデータは、一般的に [pyproject.tomlファイル](pyproject-toml-python-package-metadata) に格納されます。 このメタデータはいくつかの目的で使用されます:

source: It helps whatever tool you use to build your package (pip, [pypa's Build](https://pypi.org/project/build/) or an end-to-end tool such as poetry, PDM or Hatch) understand how to build your package. Information it provides to your build tool includes:
es: Ayuda a la herramienta que use para construir su paquete (pip, [Build de pypa](https://pypi.org/project/build/) o una herramienta de extremo a extremo como poetry, PDM o Hatch) a entender cómo construir su paquete. La información que proporciona a su herramienta de construcción incluye:
ja: パッケージのビルドに使用するツール(pip、 [pypa's Build](https://pypi.org/project/build/) 、またはpoetry、PDM、Hatchのようなエンドツーエンドツール)があなたのパッケージのビルド方法を理解するのに役立ちます。ビルドツールに提供される情報には以下のものがあります:

source: The `[build-system]` table in your pyproject.toml file tells pip what [build backend tool](build_backends) you wish to use for creating your sdist and wheel distributions.
es: La tabla `[build-system]` en su archivo pyproject.toml le dice a pip qué [herramienta de backend de construcción](build_backends) desea usar para crear sus distribuciones sdist (distribución del código fuente) y wheel (distribución construida).
ja: pyproject.tomlファイルの `[build-system]` テーブルは、sdistとwheelディストリビューションの作成に使用したい [ビルドバックエンドツール](build_backends) をpipに伝えます。

source: And the dependencies section of your project table tells the build tool and PyPI what dependencies your project requires.
es: Y la sección de dependencias de su tabla de proyecto le dice a la herramienta de construcción y a PyPI qué dependencias requiere su proyecto.
ja: また、プロジェクトテーブルの dependencies セクションは、ビルドツールと PyPI にプロジェクトが必要とする依存関係を伝えます。

source: When the build tool creates your package distribution file (the file that you publish on PyPI), it also creates a METADATA file which PyPI can read and use to help users find your package. For example:
es: Cuando la herramienta de construcción crea el archivo de distribución de su paquete (el archivo que publica en PyPI), también crea un archivo METADATA que PyPI puede leer y usar para ayudar a los usuarios a encontrar su paquete. Por ejemplo:
ja: ビルドツールがパッケージ配布ファイル（PyPIで公開するファイル）を作成するとき、PyPIが読み込んでユーザがあなたのパッケージを見つけるのに役立つMETADATAファイルも作成します。 例えば:

source: The `classifiers = ` section of your `[project]` table in the pyproject.toml file provides information that users on PyPI can use to filter for packages that contain specific licenses or that support specific versions of python.
es: La sección `classifiers = ` de su tabla `[project]` en el archivo pyproject.toml proporciona información que los usuarios en PyPI pueden usar para filtrar paquetes que contienen licencias específicas o que admiten versiones específicas de Python.
ja: pyproject.tomlファイルの `[project]` テーブルの `classifiers = ` セクションは、PyPIのユーザが特定のライセンスを含むパッケージや特定のバージョンのpythonをサポートするパッケージをフィルタリングするための情報を提供します。

source: What happened to setup.py and setup.cfg for metadata?
es: ¿Qué pasó con setup.py y setup.cfg para almacenar metadatos?
ja: メタデータのsetup.pyとsetup.cfgはどうなったのですか？

source: Project metadata used to be stored in either a setup.py file or a setup.cfg file. The current recommended practice for storing package metadata is to use a pyproject.toml file. [Learn more about the pyproject.toml file here.](pyproject-toml-python-package-metadata)
es: Los metadatos del proyecto solían almacenarse en un archivo setup.py o en un archivo setup.cfg. La práctica recomendada actual para almacenar metadatos de paquetes es utilizar un archivo pyproject.toml. [Aprenda más sobre el archivo pyproject.toml aquí.](pyproject-toml-python-package-metadata)
ja: プロジェクトのメタデータは、以前は setup.py ファイルか setup.cfg ファイルに保存されていました。パッケージのメタデータを保存するために現在推奨されている方法は、pyproject.tomlファイルを使用することです。 [pyproject.tomlファイルについての詳細はこちらです。](pyproject-toml-python-package-metadata)

source: An example - xclim
es: Un ejemplo - xclim
ja: 例 - xclim

source: You need to build your Python package in order to publish it to PyPI (or Conda). The build process organizes your code and metadata into a distribution format that can be uploaded to PyPI and subsequently downloaded and installed by users. NOTE: you need to publish a sdist to PyPI in order for conda-forge to properly build your package automatically.
es: Necesita construir su paquete de Python para publicarlo en PyPI (o Conda). El proceso de construcción organiza su código y metadatos en un formato de distribución que puede ser subido a PyPI y posteriormente descargado e instalado por los usuarios. NOTA: necesita publicar distribución del código fuente (sdist) en PyPI para que conda-forge pueda construir su paquete automáticamente.
ja: PythonパッケージをPyPI（またはConda）に公開するには、ビルドする必要があります。ビルドプロセスは、あなたのコードとメタデータをPyPIにアップロードできる配布フォーマットに整理し、その後ユーザーがダウンロードしてインストールできるようにします。 注意: conda-forgeが適切にパッケージを自動ビルドするためには、sdistをPyPIに公開する必要があります。

source: PyPI screenshot showing metadata for the xclim package.
es: Captura de pantalla de PyPI que muestra metadatos para el paquete xclim.
ja: xclimパッケージのメタデータを示すPyPIのスクリーンショット。

source: Maintainer names and GitHub usernames for the xclim package as they are displayed on PyPI. This information is recorded in your pyproject.toml and then processed by your build tool and stored in your packages sdist and wheel distributions.
es: Nombres de los mantenedores y nombres de usuario de GitHub para el paquete xclim tal como se muestran en PyPI. Esta información se registra en su pyproject.toml y luego es procesada por su herramienta de construcción y almacenada en las distribuciones sdist y wheel de sus paquetes.
ja: PyPI に表示されている xclim パッケージのメンテナ名と GitHub ユーザ名。 この情報はpyproject.tomlに記録され、ビルドツールで処理され、パッケージのsdistとwheelディストリビューションに保存されます。

source: How to create the distribution format that PyPI and Pip expects?
es: ¿Cómo crear el formato de distribución que PyPI y Pip esperan?
ja: PyPIやPipが期待する配布フォーマットを作るには？

source: You could in theory create your own scripts to organize your code the way PyPI wants it to be. However, just like there are packages that handle known structures such as Pandas for data frames and Numpy for arrays, there are packages and tools that help you create package build distribution files.
es: En teoría, podría crear sus propios scripts para organizar su código de la manera que PyPI quiere que sea. Sin embargo, al igual que hay paquetes que manejan estructuras conocidas como dataframes de Pandas y arrays de Numpy, hay paquetes y herramientas que le ayudan a crear archivos de distribución de construcción de paquetes.
ja: 理論的には、PyPIが望むようにコードを整理する独自のスクリプトを作成することができます。 しかし、データフレーム用のPandasや配列用のNumpyのような既知の構造を扱うパッケージがあるように、パッケージのビルド配布ファイルの作成を支援するパッケージやツールがあります。

source: There are a suite of packaging tools that can either help you with the entire packaging process or just one step of the process. For instance setuptools is a commonly used build back end that can be used to create your sdist and wheel. Whereas tools like Hatch, PDM, Poetry and flit help with other parts of the packaging process.
es: Existen una serie de herramientas de empaquetado que pueden ayudarle con todo el proceso de empaquetado o solo con un paso del proceso. Por ejemplo, setuptools es un backend de construcción comúnmente utilizado que se puede usar para crear su sdist y wheel. Mientras que herramientas como Hatch, PDM, Poetry y flit ayudan con otras partes del proceso de empaquetado.
ja: パッケージングツールには、パッケージングプロセス全体を支援するものもあれば、プロセスの1ステップだけを支援するものもあります。 例えばsetuptoolsはよく使われるビルドバックエンドで、sdistやwheelの作成に使うことができます。 一方、Hatch、PDM、Poetry、flitのようなツールは、パッケージングプロセスの他の部分を支援します。

source: While this can cause some confusion and complexity in the packaging ecosystem - for the most part, each tool provides the same distribution output (with minor differences that most users may not care about). Learn more about those tools on this page.
es: Si bien esto puede causar cierta confusión y complejidad en el ecosistema de empaquetado, en su mayor parte, cada herramienta proporciona la misma salida de distribución (con diferencias menores que a la mayoría de los usuarios pueden no importarles). Aprenda más sobre esas herramientas en esta página.
ja: これは、パッケージングエコシステムに混乱と複雑さをもたらす可能性がありますが、ほとんどの場合、各ツールは同じ配布出力を提供します（ほとんどのユーザーが気にしないような小さな違いはあります）。 これらのツールの詳細については、このページを参照してください。

source: Below, you will learn about the two distribution files that PyPI expects you to publish: sdist and wheel. You will learn about their structure and what files belong in each.
es: A continuación, aprenderá sobre los dos archivos de distribución que PyPI espera que publique: sdist y wheel. Aprenderá sobre su estructura y qué archivos pertenecen a cada uno.
ja: 以下では、PyPIが公開することを期待している2つの配布ファイル、sdistとwheelについて学びます。 sdistとwheelです。それぞれの構造と、どのようなファイルがあるのかについて学びます。

source: There are two core distribution files that you need to create to publish your Python package to PyPI source distribution (often called an sdist) and wheel. The sdist contains the raw source code for your package. The wheel (.whl) contains the built / compiled files that can be directly installed onto anyones' computer.
es: Hay dos archivos de distribución principales que necesita crear para publicar su paquete de Python en PyPI: la distribución de origen (a menudo llamada sdist) y la distribución construida (wheel). El sdist contiene el código fuente sin procesar de su paquete. La wheel (.whl) contiene los archivos construidos / compilados que se pueden instalar directamente en el ordenador de cualquier persona.
ja: PythonパッケージをPyPIに公開するために作成する必要がある配布ファイルは、ソース配布(sdist)とwheelの2つです。 sdistにはパッケージの生のソースコードが含まれています。 wheel(.whl)には、ビルド/コンパイルされたファイルが含まれており、誰のコンピュータにも直接インストールすることができます。

source: Learn more about both distributions below.
es: Aprenda más sobre ambas distribuciones a continuación.
ja: 両ディストリビューションの詳細は以下の通りです。

source: If your package is a pure python package with no additional build / compilation steps then the sdist and wheel distributions will have similar content. However if your package has extensions in other languages or is more complex in its build, the two distributions will be very different.
es: Si su paquete es un paquete de Python puro sin pasos adicionales de construcción / compilación, entonces las distribuciones sdist y wheel tendrán contenido similar. Sin embargo, si su paquete tiene extensiones en otros lenguajes o es más complejo en su construcción, las dos distribuciones serán muy diferentes.
ja: もし、あなたのパッケージが追加のビルド/コンパイルステップのない純粋なpythonパッケージであれば、sdistとwheelのディストリビューションは似たような内容になるでしょう。 しかし、もしあなたのパッケージが他の言語での拡張機能を持っていたり、ビルドがより複雑であったりする場合、2つのディストリビューションは大きく異なるでしょう。

source: Also note that we are not discussing conda build workflows in this section. [You can learn more about conda builds here.](https://conda.io/projects/conda-build/en/latest/user-guide/tutorials/index.html)
es: También tenga en cuenta que no estamos discutiendo flujos de trabajo de construcción de conda en esta sección. [Puede aprender más sobre las construcciones de conda aquí.](https://conda.io/projects/conda-build/en/latest/user-guide/tutorials/index.html)
ja: また、このセクションではcondaのビルドワークフローについては触れないことに注意してください。 [condaのビルドについてはこちらで詳しく説明しています](https://conda.io/projects/conda-build/en/latest/user-guide/tutorials/index.html)

source: **Source files** are the unbuilt files needed to build your package. These are the "raw / as-is" files that you store on GitHub or whatever platform you use to manage your code.
es: Los **archivos de código fuente** son los archivos sin construir necesarios para construir su paquete. Estos son los archivos "originales / sin procesar" que almacena en GitHub o en cualquier plataforma que utilice para gestionar su código.
ja: **ソースファイル** は、パッケージをビルドするために必要な、ビルドされていないファイルです。 これらは、GitHubやあなたがコードを管理するために使っているプラットフォームに保存する "raw / as-is" ファイルです。
