Repository: pyOpenSci/python-package-guide
Catalog: locales/*/LC_MESSAGES/package-structure-code.po
Languages: es, ja

source: Alternatively, you can install your package using `python -m pip install -e . --no-deps` to only install the package. And install the rest of your dependencies using a conda environment file.
es: Alternativamente, puede instalar su paquete usando `python -m pip install -e . --no-deps` para instalar solo el paquete. Instale el resto de sus dependencias usando un archivo de entorno de conda.
ja: あるいは、 `python -m pip install -e . --no-deps` を使ってパッケージだけをインストールすることもできます。そして、conda環境ファイルを使って残りの依存関係をインストールします。

source: Dependencies in Read the Docs
es: Dependencias en Read the Docs
ja: Read the Docs の依存関係

source: Now that you have your dependencies specified in your project, you can use them to support other workflows such as publishing to Read the Docs.
es: Ahora que ha especificado sus dependencias en su proyecto, puede usarlas para apoyar otros flujos de trabajo como la publicación en Read the Docs.
ja: プロジェクトで依存関係を指定できたので、Read the Docsへのパブリッシュなど、他のワークフローをサポートするためにそれらを使用できます。

source: [Read the Docs](https://readthedocs.org) is a documentation platform with a continuous integration / continuous deployment service that automatically builds and publishes your documentation.
es: [Read the Docs](https://readthedocs.org) es una plataforma de documentación con un servicio de integración continua / implementación continua que construye y publica automáticamente su documentación.
ja: [Read the Docs](https://readthedocs.org) は、継続的インテグレーション/継続的デプロイメントサービスを備えたドキュメントプラットフォームで、あなたのドキュメントを自動的にビルドして公開します。

source: If you are using Read the Docs to build your documentation, then you may need to install your dependencies using a **readthedocs.yaml** file.
es: Si está utilizando Read the Docs para construir su documentación, entonces es posible que necesite instalar sus dependencias utilizando un archivo **readthedocs.yaml**.
ja: Read the Docsを使用してドキュメントを構築している場合、 **readthedocs.yaml** ファイルを使用して依存関係をインストールする必要があるかもしれません。

source: Below is an example of installing the **docs** section of your dependency table in the pyproject.toml file within a readthedocs.yaml file.
es: A continuación se muestra un ejemplo de cómo instalar la sección **docs** de su tabla de dependencias en el archivo pyproject.toml dentro de un archivo readthedocs.yaml.
ja: 以下は、readthedocs.yamlファイル内のpyproject.tomlファイルに依存関係テーブルの **docs** セクションをインストールする例です。

source: Read the Docs and Python packages
es: Read the Docs y paquetes de Python
ja: Read the DocsとPythonパッケージ

source: [Learn more about creating a `readthedocs.yaml` file here. ](https://docs.readthedocs.io/en/stable/config-file/index.html)
es: [Aprenda más sobre cómo crear un archivo `readthedocs.yaml` aquí. ](https://docs.readthedocs.io/en/stable/config-file/index.html)
ja: [ `readthedocs.yaml` ファイルの作成方法についてはこちらをご覧ください。](https://docs.readthedocs.io/en/stable/config-file/index.html)

source: If you want to install dependencies using Poetry in Read the Docs, [you can learn more here.](https://docs.readthedocs.io/en/stable/build-customization.html#install-dependencies-with-poetry)
es: Si desea instalar dependencias usando Poetry en Read the Docs, [puede aprender más aquí. ](https://docs.readthedocs.io/en/stable/build-customization.html#install-dependencies-with-poetry)
ja: Read the DocsのPoetryを使って依存関係をインストールしたい場合は、 [こちらで詳しく説明されています。](https://docs.readthedocs.io/en/stable/build-customization.html#install-dependencies-with-poetry)

source: This is hidden. TO
ja: これは隠されています。TO

source: Intro
es: Introducción
ja: イントロ

source: Python package structure
es: Estructura de paquetes de Python
ja: Pythonパッケージ構造

source: pyproject.toml Package Metadata
es: Metadatos del paquete en pyproject.toml
ja: pyproject.toml パッケージのメタデータ

source: Build Your Package
es: Monta tu paquete
ja: パッケージをビルドする

source: Declare dependencies
es: Declara dependencias
ja: 依存関係の宣言

source: Package Build Tools
es: Herramientas de construcción de paquetes
ja: パッケージビルドツール

source: Complex Builds
es: Construcciones complejas
ja: 複雑なビルド

source: Publish with Conda / PyPI
es: Publicar con Conda / PyPI
ja: Conda / PyPIで公開する

source: Package versions
es: Versiones de paquetes
ja: パッケージバージョン

source: Code style
es: Estilo de código
ja: コードスタイル

source: ✨ 1. Package file structure ✨
es: ✨ 1. Estructura de archivos en el paquete ✨
ja: ✨ 1. パッケージのファイル構成 ✨

source: src layout, flat layout and where should tests folders live? No matter what your level of packaging knowledge is, this page will help you decide upon a package structure that follows modern python best practices.
es: ¿Distribución con estructura 'src', distribución plana y dónde deben vivir las carpetas de tests? Sin importar cuál sea su nivel de conocimiento sobre empaquetado, esta página le ayudará a decidir sobre una estructura de paquete que siga las mejores prácticas modernas para paquetes de Python.
ja: src レイアウト、フラットレイアウト、テストフォルダはどこに置くべきか？ あなたのパッケージング知識のレベルに関係なく、このページは最新のpythonのベストプラクティスに従ったパッケージ構造を決める助けになるでしょう。

source: ✨ 2. Learn about building your package ✨
es: ✨ 2. Aprende a construir tu paquete ✨
ja: ✨ 2. パッケージの構築について学ぶ✨

source: To publish your Python package on PyPI, you will need to first build it. The act of "building" refers to the process of placing your package code and metadata into a format that can be published on PyPI. Learn more about building your Python package.
es: Para publicar su paquete de Python en PyPI, primero deberá construirlo. El acto de "construir" se refiere al proceso de colocar su código de paquete y metadatos en un formato que se pueda publicar en PyPI. Aprenda más sobre cómo construir su paquete de Python.
ja: PythonパッケージをPyPIで公開するには、まずビルドする必要があります。 "ビルド" とは、パッケージのコードとメタデータをPyPIで公開できるような形式にすることです。 Pythonパッケージのビルドについての詳細はこちらをご覧ください。

source: ✨ 4. Add metadata ✨
es: ✨ 4. Agregar metadatos ✨
ja: ✨ 4. メタデータを追加する ✨

source: Learn how to add project metadata to your Python package to support both filtering on PyPI and also the metadata that a package installer needs to build and install your package.
es: Aprenda cómo agregar metadatos de proyecto a su paquete de Python para admitir tanto los filtros en PyPI como los metadatos que un instalador de paquetes necesita para construir e instalar su paquete.
ja: Python パッケージにプロジェクトのメタデータを追加して、PyPI でのフィルタリングと、パッケージインストーラがパッケージをビルドしてインストールするために必要なメタデータの両方をサポートする方法を学びましょう。

source: ✨ 3. What Python package tool should you use? ✨
es: ✨ 3. ¿Qué herramienta de empaquetado de Python debería usar? ✨
ja: ✨ 3. どのPythonパッケージツールを使うべきですか？ ✨

source: Learn more about the suite of packaging tools out there. And learn which tool might be best for you.
es: Aprenda más sobre la suite de herramientas de empaquetado disponibles. Y aprenda cuál podría ser la mejor herramienta para usted.
ja: パッケージングツール群についてもっと知りましょう。そして、どのツールがあなたに最適かを学びましょう。

source: ✨ 4. Publish to PyPI and Conda ✨
es: ✨ 4. Publicar en PyPI y Conda ✨
ja: ✨ 4. PyPIとCondaに公開する ✨

source: If you have a pure Python package, it's a straight forward process to publish to both PyPI and then a Conda channel such as conda-forge. Learn more here.
es: Si tiene un paquete de Python puro, publicar en PyPI y luego en un canal de Conda como conda-forge es un proceso sencillo. Aprenda más aquí.
ja: 純粋なPythonパッケージであれば、PyPIとconda-forgeのようなCondaチャネルの両方に公開するのは簡単です。 詳しくはこちら。

source: ✨ 5. Setup package versioning ✨
es: ✨ 5. Configurar el versionado de paquetes ✨
ja: ✨ 5. パッケージのバージョニングを設定する ✨

source: Semver (numeric versioning) and Calver (versioning using the date) are 2 common ways to version a package. Which one should you pick? Learn more here.
es: Semver (versionado numérico) y Calver (versionado usando la fecha) son 2 formas comunes de versionar un paquete. ¿Cuál debería elegir? Aprenda más aquí.
ja: Semver (数値によるバージョン管理) と Calver (日付によるバージョン管理) は、パッケージをバージョン管理する2つの一般的な方法です。 どちらを選ぶべきでしょうか？ 詳しくはこちら。

source: ✨ 6. Code style & linters ✨
es: ✨ 6. Estilo de código y linters ✨
ja: ✨6. コードスタイルとリンター✨

source: Black, blue, flake8, Ruff - which tools can help you ensure your package follows best practices for code format? Learn more about the options and why this is important here.
es: Black, blue, flake8, Ruff - ¿qué herramientas pueden ayudarlo a asegurarse de que su paquete siga las mejores prácticas para el formato de código? Aprenda más sobre las opciones y por qué esto es importante.
ja: Black、blue、flake8、Ruff - あなたのパッケージがコードフォーマットのベストプラクティスに従っていることを確認するのに役立つツールはどれですか？ オプションの詳細と、なぜこれが重要なのかについては、こちらをご覧ください。

source: Figure showing a decision tree with the various packaging tool front-end and back-end options.
es: Figura que muestra un árbol de decisiones con las diversas opciones de herramientas de empaquetado.
ja: 様々なパッケージングツールのフロントエンドとバックエンドのオプションの決定ツリーを示す図。

source: Diagram showing the various front-end build tools that you can select from. See the packaging tools page to learn more about each tool.
es: Diagrama que muestra las diversas herramientas de construcción de front-end que puede seleccionar. Consulte la página de herramientas de empaquetado para obtener más información sobre cada herramienta.
ja: 選択可能な様々なフロントエンドビルドツールを示す図。 各ツールの詳細については、パッケージングツールのページを参照してください。

source: If you are considering submitting a package for peer review, have a look at the bare-minimum [editor checks](https://www.pyopensci.org/software-peer-review/how-to/editor-in-chief-guide.html#editor-checklist-template) that pyOpenSci performs before a review begins. These checks are useful to explore for both authors planning to submit a package to us for review and for anyone who is just getting started with creating a Python package.
es: Si está considerando enviar un paquete para revisión por pares, eche un vistazo a las [comprobaciones mínimas del editor](https://www.pyopensci.org/software-peer-review/how-to/editor-in-chief-guide.html#editor-checklist-template) que realiza pyOpenSci antes de que comience una revisión. Estas comprobaciones son útiles para explorar tanto para los autores que planean enviar un paquete para su revisión como para cualquier persona que esté comenzando a crear un paquete de Python.
ja: 査読にパッケージを投稿しようと考えているなら、査読が始まる前にpyOpenSciが行う最低限の [editor checks](https://www.pyopensci.org/software-peer-review/how-to/editor-in-chief-guide.html#editor-checklist-template) を見てください。これらのチェックは、私たちにパッケージをレビューのために提出しようと計画している作者と、Pythonパッケージを作成し始めたばかりの人の両方にとって、調べるのに便利です。

source: What you will learn here
es: ¿Qué aprenderás aquí?
ja: ここで学べること

source: In this section of our Python packaging guide, we:
es: En esta sección de nuestra guía de empaquetado de Python, nosotros:
ja: Pythonパッケージングガイドのこのセクションでは、以下のことを説明します:

source: Suggest tools and approaches that both meet your needs and also support existing standards.
es: Sugerimos herramientas y enfoques que satisfacen sus necesidades y también respaldan los estándares existentes.
ja: ニーズを満たし、かつ既存の基準をサポートするツールやアプローチを提案します。

source: Align our suggestions with the most current, accepted [PEPs (Python Enhancement Protocols)](https://peps.python.org/pep-0000/) and the [Scientific Python community SPECs](https://scientific-python.org/specs/).
es: Alineamos nuestras sugerencias con los [PEPs (Protocolos de Mejora de Python)](https://peps.python.org/pep-0000/) más actuales y aceptados y las [especificaciones de la comunidad científica de Python (SPECs)](https://scientific-python.org/specs/).
ja: 私たちの提案を、現在受け入れられている [PEPs (Python Enhancement Protocols)](https://peps.python.org/pep-0000/) と [Scientific Python community SPECs](https://scientific-python.org/specs/) に合わせます。

source: In an effort to maintain consistency within our community, we also align with existing best practices being implemented by developers of core Scientific Python packages such as Numpy, SciPy and others.
es: En un esfuerzo por mantener la consistencia dentro de nuestra comunidad, también nos alineamos con las mejores prácticas existentes que están siendo implementadas por los desarrolladores de paquetes científicos de Python como Numpy, SciPy y otros.
ja: 私たちのコミュニティ内での一貫性を維持するために、NumpyやSciPyなどのScientific Pythonのコアパッケージの開発者によって実装されている既存のベストプラクティスとも連携しています。

source: Guidelines for pyOpenSci's packaging recommendations
es: Directrices para las recomendaciones de empaquetado de pyOpenSci
ja: pyOpenSciのパッケージング推奨のガイドライン

source: The flexibility of the Python programming language lends itself to a diverse range of tool options for creating a Python package. Python is so flexible that it is one of the few languages that can be used to wrap around other languages. The ability of Python to wrap other languages is one the reasons you will often hear Python described as a ["glue" language](https://numpy.org/doc/stable/user/c-info.python-as-glue.html)"
es: La flexibilidad del lenguaje de programación Python se presta a una amplia gama de opciones de herramientas para crear un paquete de Python. Python es tan flexible que es uno de los pocos lenguajes que se pueden usar para envolver otros lenguajes. La capacidad de Python para envolver otros lenguajes es una de las razones por las que a menudo escuchará que Python se describe como un ["lenguaje de pegamento"](https://numpy.org/doc/stable/user/c-info.python-as-glue.html)"
ja: Pythonプログラミング言語の柔軟性は、Pythonパッケージを作成するための多様なツールオプションに適しています。Pythonはとても柔軟で、他の言語を包み込むように使える数少ない言語のひとつです。Pythonが他の言語をラッピングする能力は、Pythonが ["glue" language](https://numpy.org/doc/stable/user/c-info.python-as-glue.html)" と表現されるのをよく耳にする理由の1つです。

source: If you are building a pure Python package, then your packaging setup can be simple. However, some scientific packages have complex requirements as they may need to support extensions or tools written in other languages such as C or C++.
es: Si está construyendo un paquete de Python puro, entonces su configuración de empaquetado puede ser simple. Sin embargo, algunos paquetes científicos tienen requisitos complejos, ya que pueden necesitar soportar extensiones o herramientas escritas en otros lenguajes como C o C++.
ja: 純粋なPythonパッケージを構築するのであれば、パッケージングのセットアップは単純でよいです。しかし、科学的なパッケージの中には、CやC++のような他の言語で書かれた拡張機能やツールをサポートする必要があり、複雑な要件を持つものがあります。

source: To support the many different uses of Python, there are many ways to create a Python package. In this guide, we suggest packaging approaches and tools based on:
es: Para satisfacer todos los usos posibles del lenguaje, hay muchas formas de crear un paquete de Python. En esta guía, sugerimos enfoques y herramientas de empaquetado basados en:
ja: Python の様々な使い方をサポートするために、Python パッケージを作成する方法はたくさんあります。 このガイドでは、パッケージングのアプローチとツールを提案します:

source: What we think will be best and easiest to adopt for those who are newer to packaging.
es: Lo que creemos que será lo mejor y más fácil de adoptar para aquellos que son nuevos en el empaquetado.
ja: パッケージングに慣れていない人たちにとって、私たちが最善で最も採用しやすいと考えるもの。

source: Tools that we think are well maintained and documented.
es: Heramientas que creemos que están bien mantenidas y documentadas.
ja: よく整備され、文書化されていると思われるツール。

source: A shared goal of standardizing packaging approaches across this (scientific) Python ecosystem.
es: Un objetivo compartido de estandarizar los enfoques de empaquetado en todo el ecosistema de Python científico.
ja: この (科学的な) Pythonエコシステム全体でパッケージングアプローチを標準化するという共通の目標。

source: Here, we also try to align our suggestions with the most current, accepted [Python community](https://packaging.python.org/en/latest/) and [scientific community](https://scientific-python.org/specs/).
es: Aquí, también intentamos alinear nuestras sugerencias con las prácticas más actuales y aceptadas [comunidad de Python](https://packaging.python.org/en/latest/) y [comunidad científica](https://scientific-python.org/specs/).
ja: ここでは、私たちの提案を、最新の、受け入れられている [Pythonコミュニティ](https://packaging.python.org/en/latest/) と [科学コミュニティ](https://scientific-python.org/specs/) に合わせることも試みています。

source: Suggestions in this guide are not pyOpenSci review requirements
es: Las sugerencias en esta guía no son requisitos de revisión de pyOpenSci
ja: このガイドの提案はpyOpenSciのレビュー要件ではありません

source: The suggestions for package layout in this section are made with the intent of being helpful; they are not specific requirements for your package to be reviewed and accepted into our pyOpenSci open source ecosystem.
es: Las sugerencias para la distribución de paquetes en esta sección se hacen con la intención de ayudarle; no son requisitos específicos para que su paquete sea revisado y aceptado en nuestro ecosistema de código abierto de pyOpenSci.
ja: このセクションのパッケージレイアウトの提案は、参考になることを意図しています。 これらは、あなたのパッケージがpyOpenSciオープンソースエコシステムにレビューされ、受け入れられるための特定の要件ではありません。

source: Please check out our [package scope page](https://www.pyopensci.org/software-peer-review/about/package-scope.html) and [review requirements in our author guide](https://www.pyopensci.org/software-peer-review/how-to/author-guide.html#) if you are looking for pyOpenSci's Python package review requirements!
es: ¡Consulte nuestra [página con el scope que cubre PyOpenSci](https://www.pyopensci.org/software-peer-review/about/package-scope.html) y [requisitos de revisión en nuestra guía para autores](https://www.pyopensci.org/software-peer-review/how-to/author-guide.html#) si está buscando los requisitos de revisión de paquetes que aplica pyOpenSci!
ja: pyOpenSciのPythonパッケージ審査要件をお探しの方は、 [package scope page](https://www.pyopensci.org/software-peer-review/about/package-scope.html) と [review requirements in our author guide](https://www.pyopensci.org/software-peer-review/how-to/author-guide.html#) をご覧ください！

source: Publishing Your Package In A Community Repository: PyPI or Anaconda.org
es: Publicar su paquete en un repositorio comunitario: PyPI o Anaconda.org
ja: コミュニティリポジトリでパッケージを公開する: PyPI または Anaconda.org

source: pyOpenSci requires that your package has an distribution that can be installed from a public community repository such as PyPI or a conda channel such as `bioconda` or `conda-forge` on Anaconda.org.
es: pyOpenSci requiere que su paquete tenga una distribución que se pueda instalar desde un repositorio comunitario público como PyPI o un canal de conda como `bioconda` o `conda-forge` en Anaconda.org.
ja: pyOpenSci は、あなたのパッケージが PyPI のようなパブリックコミュニティリポジトリや Anaconda.org の `bioconda` や `conda-forge` のような conda チャンネルからインストールできるディストリビューションを持っていることを要求します。

source: Below you will learn more about the various publishing options for your Python package.
es: A continuación, aprenderá más sobre las diversas opciones de publicación para su paquete de Python.
ja: 以下では、Pythonパッケージの様々な公開オプションについて詳しく説明します。

source: Installing packages in the same environment using both pip and conda can lead to package conflicts.
es: Instalar paquetes en el mismo entorno usando tanto pip como conda puede dar lugar a conflictos entre paquetes.
ja: pipとcondaの両方を使って同じ環境にパッケージをインストールすると、パッケージが競合する可能性があります。

source: To minimize conflicts for users who may be using conda (or pip) to manage local environments, consider publishing your package to both PyPI and the conda-forge channel on Anaconda.org.
es: Para minimizar conflictos para los usuarios que pueden estar usando conda (o pip) para administrar entornos locales, considere publicar su paquete tanto en PyPI como en el canal conda-forge en Anaconda.org.
ja: ローカル環境を管理するために conda (または pip) を使用しているかもしれないユーザーの競合を最小にするために、Anaconda.org の PyPI と conda-forge チャンネルの両方にパッケージを公開することを検討してください。

source: Below you will learn more specifics about the differences between PyPI and conda publishing of your Python package.
es: A continuación, aprenderá más sobre las diferencias específicas entre la publicación de su paquete de Python en PyPI y conda.
ja: 以下では、PythonパッケージのPyPI公開とconda公開の違いについて詳しく説明します。

source: What is PyPI
es: ¿Qué es PyPI?
ja: PyPIとは

source: [PyPI](https://pypi.org/) is an online Python package repository that you can use to both find and install and publish your Python package. There is also a test PyPI repository where you can test publishing your package prior to the final publication on PyPI.
es: [PyPI](https://pypi.org/) es un repositorio de paquetes de Python en línea que puede usar para encontrar, instalar y publicar su paquete de Python. También hay un repositorio de prueba de PyPI donde puede probar la publicación de su paquete antes de la publicación final en PyPI.
ja: [PyPI](https://pypi.org/) はオンラインのPythonパッケージリポジトリで、Pythonパッケージの検索やインストール、公開に利用できます。テスト用のPyPIリポジトリもあり、最終的にPyPIで公開する前に、パッケージの公開をテストすることができます。

source: Many if not most Python packages can be found on PyPI and are thus installable using `pip`.
es: Muchos, si no la mayoría, de los paquetes de Python se pueden encontrar en PyPI y, por lo tanto, se pueden instalar usando `pip`.
ja: ほとんどのPythonパッケージはPyPIで見つけることができ、 `pip` を使ってインストールすることができます。

source: The biggest different between using pip and conda to install a package is that conda can install any package regardless of the language(s) that it is written in. Whereas `pip` can only install Python packages.
es: La mayor diferencia entre usar pip y conda para instalar un paquete es que conda puede instalar cualquier paquete independientemente del lenguaje en el que esté escrito. Mientras que `pip` solo puede instalar paquetes de Python.
ja: パッケージのインストールにpipを使う場合とcondaを使う場合の最大の違いは、condaは(複数の)言語に関係なくどんなパッケージでもインストールできるということです。 一方、 `pip` は Python パッケージしかインストールできません。

source: Click here for a tutorial on publishing your package to PyPI.
es: Haga clic aquí para un tutorial sobre cómo publicar su paquete en PyPI.
ja: PyPIへのパッケージ公開のチュートリアルはこちら。

source: On the package build page, we discussed the [two package distribution types that you will create when making a Python package](python-package-distribution-files-sdist-wheel): SDist (packaged as a .tar.gz or .zip) and Wheel (.whl) which is really a zip file. Both of those file "bundles" will be published on PyPI when you use [a standard build tool](python-package-build-tools) to build your package.
es: En la página de construcción de paquetes, discutimos los [dos tipos de distribución de paquetes que creará al hacer un paquete de Python](python-package-distribution-files-sdist-wheel): SDist (empaquetado como .tar.gz o .zip) y Wheel (.whl) que es realmente un archivo zip. Ambos de esos "paquetes" de archivos se publicarán en PyPI cuando use [una herramienta de construcción estándar](python-package-build-tools) para construir su paquete.
ja: パッケージビルドのページで、 [Pythonパッケージを作るときに作成する2つのパッケージ配布タイプ](python-package-distribution-files-sdist-wheel) について説明しました: SDist (.tar.gzまたは.zipとしてパッケージ化) とWheel (.whl) は、実際にはzipファイルです。 [標準ビルドツール](python-package-build-tools) を使ってパッケージをビルドすると、これらのファイル "バンドル" は両方ともPyPIで公開されます。

source: What is conda and Anaconda.org?
es: ¿Qué es conda y Anaconda.org?
ja: condaとAnaconda.orgとは？

source: conda is an open source package and environment management tool. conda can be used to install tools from the [Anaconda repository](https://repo.anaconda.com/).
es: conda es una herramienta de gestión de paquetes y entornos de código abierto. conda se puede usar para instalar herramientas desde el [repositorio de Anaconda](https://repo.anaconda.com/).
ja: condaはオープンソースのパッケージと環境管理ツールです。condaは [Anacondaリポジトリ](https://repo.anaconda.com/) からツールをインストールするために使用できます。

source: Anaconda.org contains public and private repositories for packages. These repositories are known as channels (discussed below).
es: Anaconda.org contiene repositorios públicos y privados para paquetes. Estos repositorios se conocen como canales (discutidos a continuación).
ja: Anaconda.org にはパッケージのためのパブリックとプライベートのリポジトリがあります。 これらのリポジトリはチャンネルとして知られています（後述）。

source: A brief history of conda's evolution
es: Una breve historia de la evolución de conda
ja: condaの進化の簡単な歴史
