Repository: pyOpenSci/python-package-guide
Catalog: locales/*/LC_MESSAGES/package-structure-code.po
Languages: es, ja

source: You can find a thoughtful discussion of python semantic version [in this Python package guide](https://py-pkgs.org/07-releasing-versioning#automatic-version-bumping). Note that the guide hasn't been updated since 2020 and will potentially be updated in the future! But for now, some of the commands are dated but the content is still excellent.
es: Puede encontrar una discusión reflexiva sobre la versión semántica de Python [en esta guía de paquetes de Python](https://py-pkgs.org/07-releasing-versioning#automatic-version-bumping). ¡Tenga en cuenta que la guía no ha sido actualizada desde 2020 y potencialmente se actualizará en el futuro! Por ahora, algunos de los comandos están desactualizados, pero el contenido sigue siendo excelente.
ja: [このPythonパッケージガイド](https://py-pkgs.org/07-releasing-versioning#automatic-version-bumping) で、pythonのセマンティックバージョンについての丁寧な議論を見つけることができます。なお、このガイドは2020年以降更新されておらず、今後も更新される可能性があります！しかし、今のところ、いくつかのコマンドは古いが、内容は依然として素晴らしいです。

source: Python Semantic Release Pros
es: Beneficios de Python Semantic Release
ja: Pythonセマンティックリリースの長所

source: Follows semver versioning closely
es: Siguen de cerca el versionado semver
ja: センバーのバージョニングに忠実に従う

source: Enforces maintainers using descriptive commit messages which can simplify troubleshooting and ensure a cleaner and more self-describing git history.
es: Obliga a los mantenedores a usar mensajes de commit descriptivos que pueden simplificar la solución de problemas y garantizar un historial de git más limpio y autoexplicativo.
ja: 説明的なコミットメッセージを使ってメンテナを強制します。これにより、トラブルシューティングを簡素化し、よりクリーンで自己記述的なgit履歴を確保することができます。

source: Python Semantic Release Cons
es: Complicaciones con Python Semantic Release
ja: Pythonセマンティックリリースの短所

source: Requires very specific commit language to work. In practice some maintainers and contributors may not be able to maintain that level of specificity in commit messages (NOTE: there are bots that will check git commit messages in a repo)
es: Requiere un lenguaje de confirmación muy específico para funcionar. En la práctica, algunos mantenedores y colaboradores pueden no ser capaces de mantener ese nivel de especificidad en los mensajes de confirmación (NOTA: hay bots que verificarán los mensajes de confirmación de git en un repositorio)
ja: 動作させるには、非常に特殊なコミット言語が必要です。 実際には、メンテナや貢献者の中にはコミットメッセージにそのレベルの具体性を保てない人もいるでしょう (注意: リポジトリ内の git commit メッセージをチェックするボットがあります)。

source: Release happens at the command line. This makes is harder to implement a GitHub based release workflow as the wrong commit message could trigger a release.
es: La publicación se realiza en la línea de comandos. Esto hace que sea más complicado implementar un flujo de trabajo de publicación basado en GitHub, ya que un mensaje de confirmación incorrecto podría activar una publicación.
ja: リリースはコマンドラインで行われます。 このため、GitHub ベースのリリースワークフローを実装するのが難しくなります。間違ったコミットメッセージがリリースのトリガーになってしまう可能性があるからです。

source: The version number is manually updated in a configuration file such as `pyproject.toml` vs. in a package **\_version.py** file.
es: El número de versión se actualiza manualmente en un archivo de configuración como `pyproject.toml` en lugar de en un archivo de paquete **\_version.py**.
ja: バージョン番号は、 `pyproject.toml` のような設定ファイルとパッケージの **_version.py** ファイルの間で手動で更新されます。

source: The pre-commit workflow begins with you adding files that have changes to be staged in git. Next, you'd run git commit. When you run git commit, the pre-commit hooks will then run. In this example, Black, the code formatter and flake8, a linter both run. If all of the files pass Black and flake8 checks, then your commit will be recorded. If they don't, the commit is canceled. You will have to fix any flake8 issues, and then re-add / stage the files to be committed. [_Image Source_](https://ljvmiranda921.github.io/notebook/2018/06/21/precommits-using-black-and-flake8/*)
es: El flujo de trabajo de pre-commit comienza con usted agregando archivos que tienen cambios para hacer stage en git. A continuación, ejecutaría `git commit`. Cuando ejecute `git commit`, los pre-commit hooks se ejecutarán. En este ejemplo, Black, el formateador de código; y flake8, un linter; se ejecutan. Si todos los archivos pasan las comprobaciones de Black y flake8, entonces su commit se registrará. Si no lo hacen, el commit se cancela. Deberá corregir cualquier problema de flake8, y luego volver a agregar / hacer stage de los archivos para ser commiteados. [_Fuente de la imagen_](https://ljvmiranda921.github.io/notebook/2018/06/21/precommits-using-black-and-flake8/*)

source: In addition to calling tools, Pre-commit also has a suite of [built in format hooks](https://github.com/pre-commit/pre-commit-hooks#hooks-available) that you can call. Some, such as `trailing-whitespace` can be also useful to add to your pre-commit workflow to ensure clean, streamlined code files.
es: Además de llamar a herramientas, Pre-commit también tiene un conjunto de [hooks de formato integrados](https://github.com/pre-commit/pre-commit-hooks#hooks-available) que puede llamar. Algunos, como `trailing-whitespace`, también pueden ser útiles para agregar a su flujo de trabajo de pre-commit para garantizar archivos de código limpios y simplificados.

source: **Python packages that have extensions written in different languages (e.g. Fortran and C++) or that have non Python dependencies that are difficult to install (e.g. GDAL):** These packages often have complex build steps (more complex than a package with just a few C extensions for instance). As such, these packages require tools such as [scikit-build](https://scikit-build.readthedocs.io/en/latest/) or [meson-python](https://mesonbuild.com/Python-module.html) to build. NOTE: you can use meson-python with PDM.
es: **Paquetes de Python que tienen extensiones escritas en diferentes lenguajes (por ejemplo, Fortran y C++) o que tienen dependencias no escritas en Python que son difíciles de instalar (por ejemplo, GDAL):** Estos paquetes a menudo tienen pasos de compilación complejos (más complejos que un paquete con solo algunas extensiones en C, por ejemplo). Como tal, estos paquetes requieren herramientas como [scikit-build](https://scikit-build.readthedocs.io/en/latest/) o [meson-python](https://mesonbuild.com/Python-module.html) para construir. NOTA: puede usar meson-python con PDM.

source: [Dependency specifiers](https://packaging.python.org/en/latest/specifications/dependency-specifiers/)
es: [Especificadores de dependencias](https://packaging.python.org/en/latest/specifications/dependency-specifiers/)

source: version: 1.1.0
es: versión: 1.1.0

source: hatch_vcs Pros
es: Beneficios de hatch_vcs

source: hatch_vcs Cons
es: Complicaciones con hatch_vcs

source: setuptools_scm Pros
es: Beneficios de setuptools_scm

source: setuptools_scm Cons
es: Complicaciones con setuptools_scm
