Repository: pyOpenSci/python-package-guide
Catalog: locales/*/LC_MESSAGES/package-structure-code.po
Languages: es, ja

source: Source Distributions (**S** + **Dist**) are referred to as sdist. As the name implies, a SDIST contains the source code; it has not been built or compiled in any way. Thus, when a user installs your source distribution using pip, pip needs to run a build step first. For this reason, you could define a source distribution as a compressed archive that contains everything required to build a wheel (except for project dependencies) without network access.
es: Las distribuciones de código fuente (del inglés, _source distribution_) se denominan sdist. Como su nombre indica, una distribución sdist contiene el código fuente; no ha sido construido ni compilado de ninguna manera. Por lo tanto, cuando un usuario instala su distribución de código fuente usando pip, pip necesita ejecutar un paso de construcción primero. Por esta razón, podría definir una distribución sdist como un archivo comprimido que contiene todo lo necesario para construir una wheel (excepto las dependencias del proyecto) sin acceso a la red.
ja: Source Distributions（**S** + **Dist**）はsdistと呼ばれます。その名の通り、SDISTにはソースコードが含まれています; ビルドもコンパイルもされていません。 したがって、ユーザーがpipを使ってソースディストリビューションをインストールする場合、pipは最初にビルドステップを実行する必要があります。 このため、ソース・ディストリビューションを、（プロジェクトの依存関係を除いた）ホイールのビルドに必要なすべてを含む圧縮アーカイブとして、ネットワークアクセスなしで定義することができます。

source: Sdist is normally stored as a `.tar.gz` archive (often called a "tarball"). Thus, when a user installs your source distribution using pip, pip needs to run a build step first.
es: Normalmente, sdist se almacena como un archivo `.tar.gz` (a menudo llamado un "tarball"). Por lo tanto, cuando un usuario instala su distribución de origen usando pip, pip necesita ejecutar un paso de construcción primero.
ja: Sdist は通常、 `.tar.gz` アーカイブ (しばしば "tarball" と呼ばれます) として保存されます。 そのため、ユーザーが pip を使用してソースディストリビューションをインストールする場合、pip は最初にビルドステップを実行する必要があります。

source: Below is an example sdist for the stravalib Python package:
es: A continuación se muestra un ejemplo de sdist para el paquete de Python stravalib:
ja: 以下はstravalib Pythonパッケージのsdistの例です:

source: GitHub archive vs sdist
es: El archivo de GitHub vs sdist
ja: GitHubアーカイブとsdistの比較

source: When you make a release on GitHub, it creates a `git archive` that contains all of the files in your GitHub repository. While these files are similar to an sdist, these two archives are not the same. The sdist contains a few other items including a metadata directory and if you use `setuptools_scm` or `hatch_vcs` the sdist may also contain a file that stores the version.
es: Cuando se crea una versión en GitHub, se crea un `git archive` que contiene todos los archivos de su repositorio de GitHub. Si bien estos archivos son similares a un sdist, estos dos archivos no son iguales. El sdist contiene algunos otros elementos, incluido un directorio de metadatos y si utiliza `setuptools_scm` o `hatch_vcs`, el sdist también puede contener un archivo que almacena la versión.
ja: GitHub でリリースを作成すると、GitHub リポジトリ内のすべてのファイルを含む `git archive` が作成されます。これらのファイルはsdistと似ているが、これら2つのアーカイブは同じではない。sdistには、メタデータ・ディレクトリーや、 `setuptools_scm` や `hatch_vcs` を使う場合はバージョンを保存するファイルなど、他にもいくつかの項目が含まれています。

source: A wheel file is a ZIP-format archive whose filename follows a specific format (below) and has the extension `.whl`. The `.whl` archive contains a specific set of files, including metadata that are generated from your project's pyproject.toml file. The pyproject.toml and other files that may be included in source distributions are not included in wheels because it is a built distribution.
es: Un archivo wheel es un archivo en formato ZIP cuyo nombre sigue un formato específico (a continuación) y tiene la extensión `.whl`. El archivo `.whl` contiene un conjunto específico de archivos, incluidos metadatos que se generan a partir del archivo pyproject.toml de su proyecto. El pyproject.toml y otros archivos que pueden estar incluidos en las distribuciones de origen no se incluyen en las wheels porque es una distribución construida.
ja: ホイールファイルはZIP形式のアーカイブで、ファイル名は特定のフォーマット（下記）に従い、拡張子は `.whl` です。 `.whl` アーカイブには、プロジェクトのpyproject.tomlファイルから生成されたメタデータを含む特定のファイル群が含まれています。 pyproject.tomlや、ソース配布物に含まれる可能性のあるその他のファイルは、ビルドされた配布物であるため、wheelには含まれません。

source: The wheel (.whl) is your built binary distribution. **Binary files** are the built / compiled source files. These files are ready to be installed. A wheel (**.whl**) is a **zip** file containing all of the files needed to directly install your package. All of the files in a wheel are binaries - this means that code is already compiled / built. Wheels are thus faster to install - particularly if you have a package that requires build steps.
es: La wheel (.whl) es su distribución binaria construida. Los **archivos binarios** son los archivos de código fuente construidos / compilados. Estos archivos están listos para ser instalados. Una wheel (**.whl**) es un archivo **zip** que contiene todos los archivos necesarios para instalar directamente su paquete. Todos los archivos en una wheel son binarios, lo que significa que el código ya está compilado / construido. Por lo tanto, estas son más rápidas de instalar, particularmente si tiene un paquete que requiere pasos de construcción.
ja: wheel（.whl）は、ビルドされたバイナリーディストリビューションです。 **バイナリファイル** は、ビルド/コンパイルされたソースファイルです。 これらのファイルはすぐにインストールできます。 wheel (**.whl**) は、パッケージを直接インストールするために必要な すべてのファイルを含む **zip** ファイルです。 wheelに含まれるファイルはすべてバイナリで、これはコードがすでにコンパイル/ビルドされていることを意味します。 wheelの取り付けがより迅速に - 特にビルド・ステップが必要なパッケージの場合はそうなります。

source: The wheel does not contain any of your package's configuration files such as **setup.cfg** or **pyproject.toml**. This distribution is already built so it's ready to install.
es: La wheel no contiene ninguno de los archivos de configuración de su paquete como **setup.cfg** o **pyproject.toml**. Esta distribución ya está construida por lo que está lista para instalar.
ja: ホイールには、**setup.cfg** や **pyproject.toml** のようなパッケージの設定ファイルは含まれていません。 このディストリビューションはすでにビルドされていますので、すぐにインストールできます。

source: Because it is built, the wheel file will be faster to install for pure Python projects and can lead to consistent installs across machines.
es: Debido a que está construido, el archivo .whl será más rápido de instalar para proyectos de Python puro y llevará a instalaciones consistentes
ja: ビルドされているため、純粋な Python プロジェクトでは wheel ファイルのインストールが速くなり、マシン間で一貫したインストールができるようになります。

source: Wheels are also useful in the case that a package needs a **setup.py** file to support a more complex build. In this case, because the files in the wheel bundle are pre built, the user installing doesn't have to worry about malicious code injections when it is installed.
es: Las wheels también son útiles en el caso de que un paquete necesite un archivo **setup.py** para admitir una construcción más compleja. En este caso, debido a que los archivos en el paquete de wheel están preconstruidos, el usuario que lo instala no tiene que preocuparse por inyecciones de código malicioso cuando se instala.
ja: ウィールは、パッケージがより複雑なビルドをサポートするために **setup.py** ファイルを必要とする場合にも便利です。 この場合、wheelバンドルのファイルはあらかじめビルドされているので、インストールするユーザはインストール時に悪意のあるコードインジェクションを心配する必要がありません。

source: The filename of a wheel contains important metadata about your package.
es: El nombre de archivo de una wheel contiene metadatos importantes sobre su paquete.
ja: wheelのファイル名には、パッケージに関する重要なメタデータが含まれています。

source: Example: **stravalib-1.1.0.post2-py3-none.whl**
es: Por ejemplo: **stravalib-1.1.0.post2-py3-none.whl**
ja: 例: **stravalib-1.1.0.post2-py3-none.whl**

source: name: stravalib
es: nombre: stravalib
ja: 名前: stravalib

source: build-number: 2 (post2) [(read more about post here)](https://peps.python.org/pep-0440/#post-release-separators)
es: número de construcción: 2 (post2) [(lea más sobre post aquí)](https://peps.python.org/pep-0440/#post-release-separators)
ja: ビルド番号: 2 (post2) [(read more about post here)](https://peps.python.org/pep-0440/#post-release-separators)

source: py3: supports Python 3.x
es: py3: admite Python 3.x
ja: py3: Python 3.x をサポート

source: none: is not operating system specific (runs on windows, mac, linux)
es: none: no es específico del sistema operativo (se ejecuta en Windows, Mac, Linux)
ja: none: オペレーティングシステムに依存しない (Windows、Mac、Linuxで動作)

source: any: runs on any computer processor / architecture
es: any: se ejecuta en cualquier procesador / arquitectura de ordenador
ja: any: あらゆるコンピュータ・プロセッサ/アーキテクチャで動作

source: What a wheel file looks like when unpacked (unzipped):
es: ¿Cómo se ve un archivo de rueda cuando se desempaqueta (descomprime)?
ja: ホイールファイルを解凍 (unzipped) するとどのように見えるか:

source: [Read more about the wheel format here](https://pythonwheels.com/)
es: [Lea más sobre el formato de rueda aquí](https://pythonwheels.com/)
ja: [wheelフォーマットについての詳細はこちら](https://pythonwheels.com/)

source: Python Package Structure for Scientific Python Projects
es: Estuctura de paquete de Python para proyectos científicos en Python
ja: 科学的PythonプロジェクトのためのPythonパッケージ構造

source: pyOpenSci will never require a specific package structure for peer review
es: pyOpenSci nunca requerirá una estructura de paquete específica para la revisión por pares
ja: pyOpenSciは査読のために特定のパッケージ構造を要求することはありません

source: The overview on this page presents recommendations that we think are best for someone getting started with Python packaging or someone who's package has a simple build and might be open to moving to a more fail-proof approach.
es: La descripción general en esta página presenta recomendaciones que creemos que son las mejores para alguien que está comenzando con el empaquetado de Python o para alguien cuyo paquete tiene una construcción simple y podría estar abierto a moverse a un enfoque a prueba de fallos.
ja: このページの概要では、これから Python のパッケージングを始める人や、パッケージがシンプルなビルドで、より失敗のないアプローチに移行することに前向きな人に最適だと思われる推奨事項を紹介します。

source: Note the location of the following directories in the example above:
es: Nótese la ubicación de los siguientes directorios en el ejemplo anterior:
ja: 上の例では、以下のディレクトリの位置に注意してください:

source: **src/package/**: this is the directory that contains the code for your Python project. "Package" is normally your project's name.
es: **src/package/**: este es el directorio que contiene el código de su proyecto de Python. "Package" es normalmente el nombre de su proyecto.
ja: **src/package/**: これはPythonプロジェクトのコードを含むディレクトリです。 "Package" は通常プロジェクトの名前です。

source: Also in the above example, notice that all of the core documentation files that pyOpenSci requires live in the root of your project directory. These files include:
es: También en el ejemplo anterior, observe que todos los archivos de documentación básicos que pyOpenSci requiere se encuentran en la raíz del directorio de su proyecto. Estos archivos incluyen:
ja: また、上記の例では、pyOpenSciが必要とするすべてのコアドキュメントファイルがプロジェクトディレクトリのルートにあることに注意してください。 これらのファイルには以下が含まれています:

source: Click here to read about our packaging documentation requirements.
es: Haga clic aquí para leer sobre nuestros requisitos de documentación de empaquetado.
ja: パッケージングに関するドキュメント要件については、こちらをご覧ください。

source: Example scientific packages that use **src/package** layout
es: Ejemplos de paquetes científicos que utilizan el diseño **src/package**
ja: **src/package** レイアウトを使用する科学的パッケージの例

source: The src/ layout and testing
es: El diseño src/ y los tests o pruebas
ja: src/ のレイアウトとテスト

source: [Read more about reasons to use the **src/package** layout](https://hynek.me/articles/testing-packaging/)
es: [Lea más sobre las razones para usar el diseño **src/package**](https://hynek.me/articles/testing-packaging/)
ja: [**src/package** レイアウトを使用する理由についてもっと読む](https://hynek.me/articles/testing-packaging/)

source: How Python discovers and prioritizes importing modules
es: ¿Cómo descubre y prioriza Python la importación de módulos?
ja: Pythonはどのようにインポートモジュールを検出し、優先順位をつけるか

source: By default, Python adds a module in your current working directory to the front of the Python module search path.
es: De forma predeterminada, Python agrega un módulo en su directorio de trabajo actual al principio de la ruta de búsqueda de módulos de Python.
ja: デフォルトでは、Pythonは現在の作業ディレクトリにあるモジュールをPythonモジュール検索パスの先頭に追加します。

source: This means that if you run your tests in your package's working directory, using a flat layout, `/package/module.py`, Python will discover `package/module.py` file before it discovers the installed package.
es: Esto significa que si ejecuta sus pruebas en el directorio de trabajo de su paquete, utilizando un diseño plano, `/package/module.py`, Python descubrirá el archivo `package/module.py` antes de que descubra el paquete instalado.
ja: つまり、パッケージの作業ディレクトリでフラットレイアウトの `/package/module.py` を使ってテストを実行すると、Python はインストールされたパッケージを検出する前に `package/module.py` ファイルを検出します。

source: Be sure to read the [pytest documentation for more about including tests in your package distribution](https://docs.pytest.org/en/7.2.x/explanation/goodpractices.html#choosing-a-test-layout-import-rules).
es: Asegúrese de leer la [documentación de pytest para obtener más información sobre cómo incluir pruebas en su distribución de paquete](https://docs.pytest.org/en/7.2.x/explanation/goodpractices.html#choosing-a-test-layout-import-rules).
ja: パッケージ配布にテストを含める方法については、 [pytest documentation for more about including tests in your package distribution](https://docs.pytest.org/en/7.2.x/explanation/goodpractices.html#choosing-a-test-layout-import-rules) を必ず読んでください。

source: Challenges with including tests and data in a package wheel
es: Desafíos al incluir pruebas y datos en una rueda de paquete
ja: パッケージwheelにテストとデータを含める際の課題

source: **Don't include test suite datasets in your package**
es: **No incluya conjuntos de datos de pruebas en su paquete**
ja: **テストスイートのデータセットをパッケージに含めないでください**

source: The **src/package** layout is semantically more clear. Code is always found in the **src/package** directory, `tests/` and `docs/`are in the root directory.
es: El diseño **src/package** es semánticamente más claro. El código siempre se encuentra en el directorio **src/package**, `tests/` y `docs/` están en el directorio raíz.
ja: **src/package** レイアウトの方が意味的に明確である。 コードは常に **src/package** ディレクトリにあり、 `tests/` と `docs/` はルートディレクトリにあります。

source: Why most scientific Python packages do not use source
es: ¿Por qué la mayoría de los paquetes científicos de Python no usan el código fuente?
ja: ほとんどの科学的Pythonパッケージがソースを使わない理由

source: What does the flat layout structure look like?
es: ¿Cómo es la estructura del diseño plano?
ja: フラットレイアウトの構造はどのようなものですか？

source: The flat layout's primary characteristics are:
es: Las características principales del diseño plano son:
ja: フラットレイアウトの主な特徴は以下の通りです:

source: The source code for your package lives in a directory with your package's name in the root of your directory
es: El código fuente de su paquete se encuentra en un directorio con el nombre de su paquete en la raíz de su directorio
ja: パッケージのソースコードは、ディレクトリのルートにあるパッケージ名のディレクトリに格納されます

source: Often the `tests/` directory also lives within that same `package` directory.
es: A menudo, el directorio `tests/` también se encuentra dentro de ese mismo directorio `package`.
ja: 多くの場合、 `tests/` ディレクトリも同じ `package` ディレクトリの中にあります。

source: Below you can see the recommended structure of a scientific Python package using the flat layout.
es: A continuación, puede ver la estructura recomendada de un paquete científico de Python que utiliza el diseño plano.
ja: 以下に、フラットレイアウトを使った科学的Pythonパッケージの推奨構造を示します。

source: Benefits of using the flat layout in your Python package
es: Beneficios de usar el diseño plano en su paquete de Python
ja: Pythonパッケージでフラットレイアウトを使うメリット

source: There are some benefits to the scientific community in using the flat layout.
es: Existen algunos beneficios para la comunidad científica al utilizar el diseño plano.
ja: フラットレイアウトを採用することは、科学コミュニティにとってもメリットがあります。

source: This structure has historically been used across the ecosystem and packages using it are unlikely to change.
es: Esta estructura se ha utilizado históricamente en todo el ecosistema y es poco probable que los paquetes que la utilizan cambien.
ja: この構造は歴史的にエコシステム全体で使われてきたものであり、これを使うパッケージが変わることはないでしょう。

source: You can import the package directly from the root directory. For some this is engrained in their respective workflows. However, for a beginner the danger of doing this is that you are not developing and testing against the installed version of your package. Rather, you are working directly with the flat files.
es: Puede importar el paquete directamente desde el directorio raíz. Para algunos, esto está arraigado en sus respectivos flujos de trabajo. Sin embargo, para un principiante, el peligro de hacer esto es que no está desarrollando y probando contra la versión instalada de su paquete. En cambio, está trabajando directamente con los archivos planos.
ja: ルートディレクトリからパッケージを直接インポートすることができます。これがそれぞれのワークフローに組み込まれている人もいるでしょう。しかし、初心者がこの方法をとる危険性は、インストールされたバージョンのパッケージに対して開発やテストを行っていないことにあります。 むしろ、フラットファイルを直接扱うことになります。

source: Core scientific Python packages that use the flat layout
es: Paquetes científicos de Python que utilizan el diseño plano
ja: フラットレイアウトを使用する科学的Pythonのコアパッケージ

source: Creating New Versions of Your Python Package
es: Creación de nuevas versiones de su paquete de Python
ja: Pythonパッケージの新しいバージョンを作成する

source: Key Takeways
es: Principal conclusiones
ja: キーポイント

source: Follow [semantic versioning guidelines (SemVer) rules](https://semver.org/) when bumping (increasing) your Python's package version; for example a major version bump (version 1.0 --> 2.0) equates to breaking changes in your package's code for a user.
es: Siga las reglas de [directrices de versionado semántico (SemVer)](https://semver.org/) cuando aumente la versión de su paquete de Python; por ejemplo, un aumento de versión mayor (versión 1.0 --> 2.0) equivale a cambios que rompen el código de su paquete para un usuario.
ja: Pythonのパッケージのバージョンを(上げる)ときは [semantic versioning guidelines (SemVer)のルール](https://semver.org/) に従ってください。例えばメジャーバージョンアップ(バージョン1.0 --> 2.0)は、ユーザーにとってパッケージのコードを変更することに相当します。

source: You may want to consider using a plugin like hatch_vsc for managing versions of your package - if you want to have a GitHub only release workflow.
es: Es posible que desee considerar el uso de un plugin como hatch_vsc para gestionar las versiones de su paquete, si desea tener un flujo de trabajo de versionado solo en GitHub.
ja: パッケージのバージョン管理には、hatch_vsc のようなプラグインを使うことを検討するとよいでしょう - GitHub でのみリリースを行うワークフローを作りたいのであれば。

source: Otherwise most major package build tools such as Hatch, Flit and PDM have a version feature that will help you update your package's version
es: De lo contrario, la mayoría de las principales herramientas de construcción de paquetes, como Hatch, Flit y PDM, tienen una función de versión que le ayudará a actualizar la versión de su paquete.
ja: その他、Hatch、Flit、PDMなどの主要なパッケージビルドツールには、パッケージのバージョンを更新するためのバージョン機能があります。

source: Avoid updating your packages version number manually by hand in your code!
es: Evite actualizar manualmente el número de versión de sus paquetes en su código!
ja: パッケージのバージョン番号をコード内で手作業で更新するのは避けましょう！

source: pyOpenSci recommends that you follow the [Python PEP 440](https://peps.python.org/pep-0440) which recommends using [semantic versioning guidelines](https://www.python.org/dev/peps/pep-0440/#semantic-versioning) when assigning release values to new versions of your Python package.
es: pyOpenSci recomienda que siga el [PEP 440 de Python](https://peps.python.org/pep-0440) que recomienda el uso de [directrices de versionado semántico](https://www.python.org/dev/peps/pep-0440/#semantic-versioning) al crear nuevas versiones de su paquete de Python.
ja: pyOpenSciでは、Pythonパッケージの新しいバージョンにリリース値を割り当てる際に、 [semantic versioning guidelines](https://www.python.org/dev/peps/pep-0440/#semantic-versioning) を使用することを推奨している [Python PEP 440](https://peps.python.org/pep-0440) に従うことを推奨しています。

source: [Semantic versioning](https://semver.org/) is an approach to updating package versions that considers the type and extent of a change that you are making to the package code. Being consistent with how and when you update your package versions is important as:
es: [El versionado semántico](https://semver.org/) es un enfoque para actualizar las versiones de los paquetes que depende del tipo y la extensión del cambio que está realizando en el código del paquete. Ser coherente con cómo y cuándo actualiza las versiones de su paquete es importante ya que:
ja: [Semantic versioning](https://semver.org/) は、パッケージのバージョンを更新するためのアプローチで、パッケージのコードに加えようとしている変更の種類と程度を考慮します。パッケージのバージョンを更新する方法とタイミングを一貫させることは、次のように重要です:

source: It helps your users (which might include other developers that depend on your package) understand the extent of changes to a package.
es: Ayuda a sus usuarios (que pueden incluir a otros desarrolladores que dependen de su paquete) a comprender la extensión de los cambios en un paquete.
ja: これは、あなたのユーザ (あなたのパッケージに依存している他の開発者を含むかもしれません) がパッケージの変更範囲を理解するのに役立ちます。

source: It helps your development team make decisions about when to bump a package version based on standard rules.
es: Ayuda a su equipo de desarrollo a tomar decisiones sobre cuándo aumentar una versión de paquete basándose en reglas estándar.
ja: 標準的なルールに基づいて、開発チームがパッケージのバージョンを上げるタイミングを判断するのに役立ちます。

source: A note about versioning
es: Una nota sobre el versionado
ja: バージョン管理について

source: In some cases even small version changes can turn a package update into a breaking change for some users. What is also important is that you document how you version your code and if you can, also document your deprecation policy for code.
es: En algunos casos, incluso pequeños cambios de versión pueden convertir una actualización de paquete en un cambio que rompe para algunos usuarios. Por lo tanto es importante es que documente cómo versiona su código y, si puede, también la política de deprecación para el código.
ja: 場合によっては、小さなバージョン変更でさえも、パッケージのアップデートを一部のユーザーにとって破壊的な変更に変えてしまう可能性があります。 さらに重要なのは、コードのバージョンアップ方法を文書化することであり、可能であればコードの非推奨ポリシーも文書化することです。

source: SemVer rules
es: Reglas de SemVer
ja: SemVerルール

source: Following SemVer, your bump your package version to a:
es: Siguiendo SemVer, aumente la versión de su paquete a:
ja: SemVerに従って、パッケージのバージョンを上げます:

source: patch (1.1.1 --> 1.1.**2**)
ja: パッチ (1.1.1 --> 1.1.**2**)

source: minor (1.1.1 --> 1.**2**.1)
ja: マイナー (1.1.1 --> 1.**2**.1)

source: major (1.1.1 --> **2**.1.1)
ja: メジャー (1.1.1 --> **2**.1.1)

source: version number change based on the following rules:
es: El cambio de número de versión se basa en las siguientes reglas:
ja: バージョン番号は以下のルールに基づいて変更されます:

source: Given a version number MAJOR.MINOR.PATCH, increment the:
es: Dado un número de versión MAJOR.MINOR.PATCH, incremente:
ja: バージョン番号MAJOR.MINOR.PATCHが与えられたら、インクリメントする:

source: **MAJOR version** when you make incompatible API changes
es: Versión **MAJOR** cuando realice cambios incompatibles en la API
ja: **MAJOR version** 互換性のないAPIの変更を行った場合

source: **MINOR version** when you add functionality in a backwards compatible manner
es: Versión **MINOR** cuando agregue funcionalidad de manera compatible con versiones anteriores
ja: 後方互換性のある方法で機能を追加する場合の **MINOR version** 。

source: **PATCH version** when you make backwards compatible bug fixes Additional labels for pre-release and build metadata are available as extensions to the MAJOR.MINOR.PATCH format.
es: Versión **PATCH** cuando realice correcciones de errores compatibles con versiones anteriores. Se encuentran disponibles etiquetas adicionales para metadatos de prelanzamiento y compilación como extensiones del formato MAJOR.MINOR.PATCH.
ja: **PATCH version** 後方互換性のあるバグ修正を行う場合 プレリリースとビルドのメタデータ用の追加ラベルは、MAJOR.MINOR.PATCHフォーマットの拡張として利用できます。
