Repository: pyOpenSci/python-package-guide
Catalog: locales/*/LC_MESSAGES/package-structure-code.po
Languages: es, ja

source: You can also setup a `pre-commit hook` in your Python package repository.
es: También puede configurar un `pre-commit hook` en el repositorio de su paquete.
ja: Pythonのパッケージリポジトリに `pre-commit hook` をセットアップすることもできます。

source: A pre-commit hook is a tool that allows an action (or actions) to be triggered when you apply a commit to your git repository.
es: Un pre-commit hook es una herramienta que permite ejecutar una acción (o acciones) en el momento en que se aplica un commit a su repositorio de git.
ja: プレコミットフックとは、git リポジトリにコミットを適用するときに (複数の) アクションを実行するためのツールです。

source: Pre-commit hook example workflow
es: Ejemlo de flujo de trabajo de pre-commit hook
ja: pre-commit フックのワークフロー例

source: The precommit workflow looks like this: You type and run:
es: El flujo de trabajo de precommit se ve así: escriba y ejecute:
ja: precommit のワークフローは次のようになる: 次のように入力して実行します:

source: `git commit -m "message here"` at the command line
es: `git commit -m "mensaje aquí"` en la línea de comandos
ja: コマンドラインで `git commit -m "message here"` を実行

source: Once you hit return, pre-commit will run any tools that you have configured in a **.pre-commit-config.yaml** file.
es: Una vez que presione enter, pre-commit ejecutará cualquier herramienta que haya configurado en un archivo **.pre-commit-config.yaml**.
ja: returnを押すと、pre-commitは **.pre-commit-config.yaml** ファイルで設定したツールを実行します。

source: If the tools configured in the pre-commit hook run successfully without making changes or finding errors in your code, the commit will be applied to the repository.
es: Si las herramientas configuradas en el pre-commit hook se ejecutan con éxito sin realizar cambios o encontrar errores en su código, el commit se aplicará al repositorio.
ja: pre-commitフックで設定したツールが、コードに変更を加えたりエラーを発見したりすることなく正常に実行されると、コミットがリポジトリに適用されます。

source: If the tools configured in the hook find errors in your files, the commit will NOT be applied to the repository. Remember from the discussion above that a code formatter like Black will run and reformat your code. A linter like _flake8_ will provide you with some output that details where there are syntax issues in your code. You will then need to fix those issues, manually.
es: Si las herramientas configuradas en el hook encuentran errores en sus archivos, el commit NO se aplicará al repositorio. Recuerde de la discusión anterior que un formateador de código como Black se ejecutará y reformateará su código. Un linter como _flake8_ le proporcionará una salida que detalla dónde hay problemas de sintaxis en su código. Luego deberá corregir esos problemas, manualmente.
ja: フックで設定したツールがファイルにエラーを見つけた場合、コミットはリポジトリに適用されません。 上の説明で、Black のようなコードフォーマッタが実行され、コードを再フォーマットすることを思い出してください。 _flake8_ のようなリンターは、コードのどこにシンタックス上の問題があるかを詳細に出力してくれます。 そして、それらの問題を手動で修正する必要があります。

source: Once all of the fixes are applied you can re-add (stage) the files to be commit. And re-run your commit.
es: Una vez que se aplican todas las correcciones, puede volver a agregar (stage) los archivos para ser commiteados. Y vuelva a ejecutar su commit.
ja: すべての修正が適用されたら、コミットするファイルを再追加 (stage) することができます。 そしてコミットを再実行します。

source: Diagram showing the steps of a pre-commit workflow from left to right.
es: Diagrama que muestra los pasos de un flujo de trabajo de pre-commit de izquierda a derecha.
ja: 左から右へ、 pre-commit ワークフローのステップを示す図。

source: If have a Python code-base and multiple maintainers actively working on the code, and you intend to run a tool like Black, be sure to coordinate across your team. An initial commit that applies Black to your entire package will likely change a significant amount of your code. This could lead to merge conflicts on open and new PR's before the new changes are merged.
es: Si tiene una base de código de Python y varios mantenedores trabajando activamente en el código, y tiene la intención de ejecutar una herramienta como Black, asegúrese de coordinarse con su equipo. Un commit inicial que aplique Black a todo su paquete probablemente cambiará una cantidad significativa de su código. Esto podría llevar a conflictos de fusión en solicitudes de cambio abiertas y nuevas antes de que los nuevos cambios se fusionen.
ja: Python のコードベースがあり、複数のメンテナがそのコードに積極的に取り組んでいて、Black のようなツールを使うつもりなら、チーム全体で調整するようにしてください。 Blackをパッケージ全体に適用する最初のコミットは、おそらくコードのかなりの部分を変更するでしょう。 これは、新しい変更がマージされる前に、オープンなPRや新しいPRでマージ競合が発生する可能性があります。

source: General pre commit checks
es: Comprobaciones generales de pre commit
ja: 一般的なコミット前のチェック

source: An example pre-commit-config.yaml file is below with examples of how this is all setup.
es: A continuación se muestra un archivo pre-commit-config.yaml con ejemplos de cómo se configura.
ja: 以下に、 pre-commit-config.yaml ファイルの例を記載します。このファイルに記載されている内容のセットアップ方法の例も記載されています。

source: [Pre-commit.ci](https://pre-commit.ci) is a bot that may become your new best friend. This bot, when setup on a repo can be configured to do the following:
es: [Pre-commit.ci](https://pre-commit.ci) es un bot que puede convertirse en su nuevo mejor amigo. Este bot, cuando se configura en un repositorio, se puede configurar para hacer lo siguiente:
ja: [pre-commit.ci](https://pre-commit.ci) は、あなたの新しい親友になるかもしれないボットです。 このボットをリポジトリにセットアップすると、次のようなことができるようになります:

source: It will check every pull request using all of the pre-commit hook setting
es: Comprobará cada solicitud de cambio utilizando todas las configuraciones de pre-commit hook
ja: コミット前のフック設定をすべて使用して、すべてのプルリクエストをチェックします

source: If you wish, it will also submit a pull request to your repo with pre-commit fixes, saving you, and new contributors the time of reformatting a pr that has format issues.
es: Si lo desea, también enviará una solicitud de cambio a su repositorio con correcciones de pre-commit, ahorrándole a usted y a los nuevos colaboradores el tiempo de reformatear una solicitud de cambio que tenga problemas de formato.
ja: あなたが望むなら、事前にコミットした修正と一緒にあなたのリポジトリにプルリクエストを提出します、あなたや新しい貢献者は、フォーマットの問題がある pr を再フォーマットする時間を節約できます。

source: You can also call the bot on any pull request to run / and fix the code.
es: También puede llamar al bot en cualquier solicitud de cambio para ejecutar / y corregir el código.
ja: また、どのプルリクエストでもボットを呼び出して、実行し / コードを修正することができます。

source: The pre-commit.ci bot uses the same pre-commit-config.yaml file that you use to setup pre-commit locally.
es: El bot pre-commit.ci utiliza el mismo archivo pre-commit-config.yaml que utiliza para configurar pre-commit localmente.
ja: pre-commit.ci ボットは、ローカルで pre-commit をセットアップするのと同じ pre-commit-config.yaml ファイルを使用します。

source: Setting up a bot like this can be valuable because:
es: Configurar un bot como este puede ser valioso porque:
ja: このようなボットを設置することは価値があるなぜなら:

source: It can make is easier for maintainers as they no longer have to worry at allows about fixing code format. The bot will do the work for them.
es: Puede hacer que sea más fácil para los mantenedores, ya que ya no tienen que preocuparse por corregir el formato del código. El bot hará el trabajo por ellos.
ja: メンテナにとっては、コードフォーマットの修正に頭を悩ませる必要がなくなり、楽になります。 ボットが代わりにやってくれます。

source: It can make it easier for new comers as they never have to setup pre-commit locally or worry about linting their code. They can even make small fixes to the code directly on GitHub without worry.
es: Puede hacer que sea más fácil para los recién llegados, ya que nunca tienen que configurar pre-commit localmente o preocuparse por el linting de su código. Incluso pueden hacer pequeñas correcciones al código directamente en GitHub sin preocupaciones.
ja: ローカルでpre-commitをセットアップしたり、コードのlintを心配したりする必要がないので、新規参入者も楽になります。GitHub上で直接コードを修正することもできます。

source: Setting up a git pre-commit hook
es: Configuración de un pre-commit hook de git
ja: git pre-commit フックの設定

source: To setup pre-commit locally, you need to do 3 things:
es: Para configurar pre-commit localmente, necesita hacer 3 cosas:
ja: ローカルで pre-commit をセットアップするには、3つのことをする必要があります:

source: Install pre-commit (and include it as a development requirement in your repository)
es: Instalar pre-commit (e incluirlo como un requisito de desarrollo en su repositorio)
ja: pre-commitをインストールする（そしてリポジトリに開発要件として含める）

source: Create a .pre-commit-config.yaml file in the root of your package directory.
es: Cree un archivo .pre-commit-config.yaml en la raíz del directorio de su paquete.
ja: パッケージディレクトリのルートに .pre-commit-config.yaml ファイルを作成します。

source: Below is an example **.pre-commit-cofig.yaml** file that can be used to setup the pre-commit hook and the pre-commit.ci bot if you chose to implement that too.
es: A continuación se muestra un ejemplo de archivo **.pre-commit-cofig.yaml** que se puede utilizar para configurar el pre-commit hook y el bot pre-commit.ci si elige implementarlo también.
ja: 以下は、 pre-commit とpre-commit.ciボットのセットアップに使用できる **.pre-commit-cofig.yaml** ファイルの例です。

source: This file specifies a hook that will be triggered automatically before each `git commit`, in this case, it specifies a `flake8` using version `6.0.0`.
es: Este archivo especifica un hook que se activará automáticamente antes de cada `git commit`; en este caso, especifica `flake8` con la versión `6.0.0`.
ja: このファイルでは、各 `git commit` の前に自動的に起動するフックを指定します。この例では、バージョン `6.0.0` を使って `flake8` を指定しています。

source: Install your pre-commit hook(s) using `pre-commit install`. This will install all of the hooks specified in the pre-commit yaml file into your environment.
es: Instale su pre-commit hook(s) usando `pre-commit install`. Esto instalará todos los hooks especificados en el archivo yaml de pre-commit en su entorno.
ja: `pre-commit install` を使用して、(複数の)コミット前フックをインストールします。 これにより、pre-commit yaml ファイルで指定したすべてのフックがあなたの環境にインストールされます。

source: Once you have done the above, you are ready to start working on your code. Pre-commit will run every time you run `git commit`.
es: Una vez que haya hecho lo anterior, estará listo para comenzar a trabajar en su código. Pre-commit se ejecutará cada vez que ejecute `git commit`.
ja: 上記を実行したら、コードを書き始める準備ができました。 `git commit` を実行するたびに pre-commit が実行されます。

source: Summary
es: Resumen
ja: 概要

source: pyOpenSci suggests setting up a linter and a code styler for your package, regardless of whether you use pre-commit hooks, CI or other infrastructure to manage code format. Setting up these tools will give you automatic feedback about your code's structure as you (or a contributor) write it. And using a tool like black that format code for you, reduce effort that you need to make surrounding decisions around code format and style.
es: pyOpenSci sugiere configurar un linter y un formateador de código para su paquete, independientemente de si utiliza pre-commit hooks, CI u otra infraestructura para administrar el formato de código. Configurar estas herramientas le dará comentarios automáticos sobre la estructura de su código a medida que usted (o un colaborador) lo escribe. Y usar una herramienta como black que formatee el código por usted, reduce el esfuerzo que necesita hacer en torno a las decisiones sobre el formato y estilo del código.
ja: pyOpenSciは、プレコミットフック、CI、またはコードフォーマットを管理する他のインフラストラクチャを使用しているかどうかに関係なく、あなたのパッケージにリンターとコードスタイラーをセットアップすることを提案します。 これらのツールをセットアップすることで、あなた(または貢献者)がコードを書いたときに、コードの構造に関する自動的なフィードバックを得ることができます。 また、コードを整形してくれるblackのようなツールを使うことで、コードのフォーマットやスタイルにまつわる決断に必要な労力を減らすことができます。

source: Complex Python package builds
es: Compilaciones complejas de paquetes de Python
ja: 複雑なPythonパッケージのビルド

source: This guide is focused on packages that are either pure-python or that have a few simple extensions in another language such as C or C++.
es: Esta guía se centra en paquetes que solamente utilizan Python o que tienen unas pocas extensiones simples en otro lenguaje como C o C++.
ja: このガイドでは、純粋なPythonか、CやC++のような他の言語でいくつかの簡単な拡張を持つパッケージのどちらかに焦点を当てています。

source: In the future, we want to provide resources for packaging workflows that require more complex builds. If you have questions about these types of package, please [add a question to our discourse](https://pyopensci.discourse.group/) or open an [issue about this guide specifically in the GitHub repo for this guide](https://github.com/pyOpenSci/python-package-guide/issues). There are many nuances to building and distributing Python packages that have compiled extensions requiring non-Python dependencies at build time. For an overview and thorough discussion of these nuances, please see [this site.](https://pypackaging-native.github.io/)
es: En el futuro, queremos proporcionar recursos para flujos de trabajo de empaquetado que requieran compilaciones más complejas. Si tiene preguntas sobre estos tipos de paquetes, por favor [agregue una pregunta a nuestro foro](https://pyopensci.discourse.group/) o abra una [issue sobre esta guía específicamente en el repositorio](https://github.com/pyOpenSci/python-package-guide/issues). Hay muchos matices para construir y distribuir paquetes de Python que tienen extensiones compiladas que requieren dependencias en otros lenguajes en el momento de construcción del paquete. Para obtener una descripción general y una discusión exhaustiva de estos matices, consulte [este sitio.](https://pypackaging-native.github.io/)
ja: 将来的には、より複雑なビルドを必要とするパッケージングワークフローのためのリソースを提供したいと考えています。 このようなタイプのパッケージについて質問がある場合は、 [私たちのdiscourseに質問を追加する](https://pyopensci.discourse.group/) か、 [このガイドの GitHub リポジトリでこのガイドに関する issue を発行する](https://github.com/pyOpenSci/python-package-guide/issues) してください。 ビルド時に Python 以外の依存関係を必要とするコンパイルされた拡張機能を持つ Python パッケージをビルドして配布するには、多くの微妙な違いがあります。 これらの微妙な違いの概要と徹底的な議論については、 [このサイト](https://pypackaging-native.github.io/) を参照してください。

source: Pure Python Packages vs. packages with extensions in other languages
es: Paquetes de Python puros vs. paquetes con extensiones en otros lenguajes
ja: 純粋なPythonパッケージと他言語の拡張機能付きパッケージの比較

source: You can classify Python package complexity into three general categories. These categories can in turn help you select the correct package frontend and backend tools.
es: Se puede clasificar la complejidad de los paquetes de Python en tres categorías. Estas categorías, a su vez, pueden ayudarlo a seleccionar las mejores herramientas de frontend y backend.
ja: Pythonパッケージの複雑さを3つの一般的なカテゴリに分類することができます。 これらの分類は、正しいパッケージフロントエンドとバックエンドツールを選択するのに役立ちます。

source: **Pure-python packages:** these are packages that only rely on Python to function. Building a pure Python package is simpler. As such, you can chose a tool below that has the features that you want and be done with your decision!
es: **Paquetes de Python puros:** son paquetes que solo dependen de Python para funcionar. Construir un paquete de Python puro es más simple. Como tal, puede elegir una herramienta a continuación que tenga las características que desea sin tener que considerar muchos detalles.
ja: **純粋なPythonパッケージ:** Pythonだけに依存して機能するパッケージです。 純粋なPythonパッケージの構築はよりシンプルです。 そのため、以下のツールの中から自分の欲しい機能を持つものを選び、決定しましょう!

source: **Python packages with non-Python extensions:** These packages have additional components called extensions written in other languages (such as C or C++). If you have a package with non-Python extensions, then you need to select a build backend tool that allows additional build steps needed to compile your extension code. Further, if you wish to use a frontend tool to support your workflow, you will need to select a tool that supports additional build setups. We suggest that you chose build tool that supports custom build steps like Hatch.
es: **Paquetes de Python con extensiones en otros lenguajes:** Estos paquetes tienen componentes adicionales llamados extensiones escritas en otros lenguajes (como C o C++). Si tiene un paquete con extensiones no escritas en otros lenguajes, debe seleccionar una herramienta de backend de compilación que permita pasos de compilación adicionales necesarios para compilar su código en estos lenguajes. Además, si desea utilizar una herramienta de frontend para ayudar a su flujo de trabajo, deberá seleccionar una herramienta que admita configuraciones de compilación adicionales. Sugerimos que elija una herramienta de compilación que admita pasos de compilación personalizados como por ejemplo Hatch.
ja: **Python以外の拡張を持つPythonパッケージ:** これらのパッケージには、他の言語(CやC++など)で書かれた拡張と呼ばれる 追加コンポーネントがあります。 Python 以外の拡張を持つパッケージがある場合、拡張コードをコンパイルするために必要な、追加のビルドステップを可能にするビルドバックエンドツールを選択する必要があります。 さらに、ワークフローをサポートするフロントエンドツールを使いたい場合は、追加のビルド設定をサポートするツールを選択する必要があります。 Hatchのようなカスタムビルドステップをサポートするビルドツールを選択することをお勧めします。

source: Mixing frontend and backend projects
es: Mezclar proyectos de frontend y backend
ja: フロントエンドとバックエンドの混合プロジェクト

source: It is sometimes necessary or desirable to use a build frontend with an alternative build-backend. This is because some frontends do not have a default backend (`build`), and this choice is placed on the maintainer. Other backends (`hatch`) have a preferred backend (`hatchling`) but allow the maintainer to migrate to another, while some backends (`poetry`) only work with a single backend (`poetry-core`). Refer to (#python-package-build-tools) for more information about frontend and backend compatibility.
es: A veces es necesario o deseable usar un frontend de compilación con un backend de compilación alternativo. Esto se debe a que algunos frontends no tienen un backend predeterminado (`build`), y esta elección recae en el mantenedor. Otros backends (`hatch`) tienen un backend preferido (`hatchling`) pero permiten al mantenedor migrar a otro, mientras que algunos backends (`poetry`) solo funcionan con un solo backend (`poetry-core`). Consulte (#python-package-build-tools) para obtener más información sobre la compatibilidad de frontend y backend.
ja: ビルドフロントエンドと別のビルドバックエンドを併用することが必要な場合や望ましい場合があります。これは、フロントエンドの中にはデフォルトのバックエンド（`build`）を持たないものがあり、この選択はメンテナに委ねられているからです。他のバックエンド (`hatch`) には推奨されるバックエンド (`hatchling`) がありますが、メンテナは別のものに移行することができます。一方、一部のバックエンド (`poetry`) は単一のバックエンド (`poetry-core`) でのみ動作します。フロントエンドとバックエンドの互換性に関する詳細は、 (#python-package-build-tools) を参照してください。

source: In this packaging guide we recommend using `hatch` along with its preferred backend `hatchling`. While this will be suitable for most packages, an alternate backend may be used with Hatch if needed when creating an extension module. A Python extension module is one that is made up, either in part or entirely, of compiled code. In this case the backend chosen (such as `meson-python`) must know how to compile the extension language and bind it to Python. `hatchling` does not know how to do this all on its own and must either make use of [plugins](https://hatch.pypa.io/1.9/plugins/about/) or be replaced by a backend that is already capable of building extension modules.
es: En esta guía de empaquetado, recomendamos usar `hatch` junto con su backend preferido `hatchling`. Si bien esto será adecuado para la mayoría de los paquetes, se puede usar un backend alternativo con Hatch si es necesario al crear un módulo de extensión. Un módulo de extensión de Python es uno que está compuesto, ya sea en parte o en su totalidad, de código compilado en otro lenguaje. En este caso, el backend elegido (como `meson-python`) debe saber cómo compilar el lenguaje de extensión y vincularlo a Python. `hatchling` no sabe cómo hacer esto por sí solo y debe hacer uso de [plugins](https://hatch.pypa.io/1.9/plugins/about/) o cambiar un backend que sea capaz de construir módulos de extensión.
ja: このパッケージングガイドでは、 `hatch` とそのバックエンドである `hatchling` の使用を推奨します。これはほとんどのパッケージに適していますが、拡張モジュールを作成する際に必要であれば、Hatchで別のバックエンドを使用することもできます。Pythonの拡張モジュールは、一部または全部がコンパイルされたコードで構成されています。この場合、( `meson-python` のような)バックエンドは、拡張言語をコンパイルしてPythonにバインドする方法を知っていなければなりません。 [プラグイン](https://hatch.pypa.io/1.9/plugins/about/) を利用するか、すでに拡張モジュールを構築できるバックエンドに置き換えなければなりません。

source: In order to use a different backend you will need to edit your project's `pyproject.toml`. If you have a `pyproject.toml` generated by the `hatch` command, or from following the packaging tutorial, you may have to make a change like this
es: Para usar un backend diferente, deberá editar el `pyproject.toml` de su proyecto. Si tiene un `pyproject.toml` generado por el comando `hatch`, o siguiendo el tutorial de empaquetado, probablemente tendrá hacer un cambio como este
ja: 別のバックエンドを使用するには、プロジェクトの `pyproject.toml` を編集する必要があります。 `hatch` コマンドで生成された `pyproject.toml` や、パッケージングチュートリアルに従った `pyproject.toml` がある場合は、次のように変更する必要があるかもしれません。

source: Following this comment: https://github.com/pyOpenSci/python-package-guide/pull/106#pullrequestreview-1766663571
ja: このコメントによります: https://github.com/pyOpenSci/python-package-guide/pull/106#pullrequestreview-1766663571

source: Jonny will add a section that talks about:
ja: Jonny はそのセクションを追加する予定です:

source: Why you specify dependencies How to specify dependencies When you use different specifiers
ja: 依存関係を指定する理由 依存関係を指定する方法 異なる指定子を使用する場合

source: Python Package Dependencies
es: Dependencias de paquetes de Python
ja: Pythonパッケージの依存関係

source: What is a package dependency?
es: ¿Qué es una dependencia de paquete?
ja: パッケージ依存性とは何か？

source: A Python package dependency refers to an external package or software that your Python project:
es: Una dependencia de paquete de Python se refiere a un paquete externo o software que su proyecto de Python:
ja: Pythonパッケージ依存とは、Pythonプロジェクトが使用する外部パッケージやソフトウェアのことです:

source: A dependency is not part of your project's codebase. It is a package or software that is called within the code of your project or during development of your package.
es: Una dependencia no es parte del código de su proyecto. Es un paquete o software que se llama dentro del código de su proyecto o durante el desarrollo de su paquete.
ja: 依存関係は、プロジェクトのコードベースの一部ではありません。 プロジェクトのコード内やパッケージの開発中に呼び出されるパッケージやソフトウェアです。

source: Understanding optional vs. required dependencies
es: Entendiendo las dependencias opcionales vs. requeridas
ja: オプションと必須の依存関係を理解する

source: You will learn about both below.
es: Aprenderá sobre ambos tipos a continuación.
ja: 両者については後述します。

source: There are two broad groups of Python package dependencies: those that are optional and those that are required. Required packages are those that a user needs to use your package. Optional dependencies are packages a user can chose to install to add functionality to your package. Within those 2 groups, there are three use cases that you can think about. 1. Core dependencies are **required** for a user to use your package. 2. Development dependencies are optional and only needed if someone wants to work on your package locally. 3. Finally feature dependencies are optional and add additional functionality to your package. Not all packages will have feature dependencies.
es: Hay dos tipos de dependencias de paquetes de Python: las que son opcionales y las que son requeridas. Los paquetes requeridos son aquellos que un usuario necesita para usar su paquete. Las dependencias opcionales son paquetes que un usuario puede elegir instalar para agregar funcionalidad a su paquete. Dentro de esos 2 grupos, hay tres casos de uso en los que puede pensar. 1. Las dependencias principales son **requeridas** para que un usuario use su paquete. 2. Las dependencias de desarrollo son opcionales y solo son necesarias si alguien desea trabajar en su paquete localmente. 3. Finalmente, las dependencias de funcionalidades son opcionales y agregan funcionalidad adicional a su paquete. No todos los paquetes tendrán dependencias de funcionalidades.
ja: Pythonパッケージの依存関係には、オプションのものと必須のものの2つの大きなグループがあります。必須パッケージとは、ユーザがあなたのパッケージを使うために必要なパッケージのことです。オプションの依存関係とは、パッケージの機能を追加するために、ユーザーがインストールを選択できるパッケージのことです。この2つのグループの中で、3つのユースケースを考えることができます。1. コアの依存関係は、ユーザがあなたのパッケージを使うために **必須** です。2. 開発依存関係はオプションで、誰かがあなたのパッケージをローカルで作業したい場合にのみ必要です。3. 最後に、機能依存はオプションであり、パッケージに追加機能を追加します。 すべてのパッケージが機能依存を持つわけではありません。

source: Required (or core) dependencies
es: Dependencias requeridas (o principales)
ja: 必須（またはコア）の依存関係

source: Optional dependencies
es: Dependencias opcionales
ja: オプションの依存関係
