Repository: pyOpenSci/python-package-guide
Catalog: locales/*/LC_MESSAGES/package-structure-code.po
Languages: es, ja

source: Python Package Code Style, Format and Linters
es: Guía de estilo, formato y linters de código de paquetes de Python
ja: Pythonパッケージコードのスタイル、フォーマット、リンター

source: Take Aways
es: Resumen
ja: ポイント

source: pyOpenSci requires authors to follow PEP 8 code format guidelines
es: pyOpenSci requiere que los autores sigan las directrices de formato de código PEP 8
ja: pyOpenSciは、作者がPEP 8コードフォーマットガイドラインに従うことを要求します。

source: Setting up a code formatters like Black and isort will help you enforce PEP 8 style guidelines and also consistent, readable code format
es: Configurar formateadores de código como Black e isort le ayudará a cumplir con las directrices de estilo PEP 8 y también con un formato de código consistente y legible
ja: Blackやisortのようなコードフォーマッタを設定することで、PEP 8のスタイルガイドラインを実施し、一貫性のある読みやすいコードフォーマットにすることができます。

source: Some commonly used tools are: Black, Isort, flake8, Ruff
es: Algunas herramientas comúnmente utilizadas son: Black, Isort, flake8, Ruff
ja: よく使われるツールは以下の通り： Black、Isort、flake8、Ruff

source: You can also setup pre-commit hooks which will run code formatters locally each time you make a commit.
es: También puede configurar pre-commit hooks que ejecutará los formateadores de código localmente cada vez que realice un commit.
ja: また、コミット前にフックをセットアップして、コミットするたびにコードフォーマッタをローカルで実行することもできます。

source: [precommit.ci](https://pre-commit.ci/) is a bot that you can add to your GitHub repository. It will automagically apply code format to every PR using the tools specified in your pre-commit-config.yaml file. It can save significant time and make contributions easier for new contributors.
es: [precommit.ci](https://pre-commit.ci/) es un bot que puede agregar a su repositorio de GitHub. Aplicará automáticamente el formato de código a cada PR usando las herramientas especificadas en su archivo pre-commit-config.yaml. Puede ahorrar mucho tiempo y facilitar las contribuciones para los nuevos colaboradores.
ja: [precommit.ci](https://pre-commit.ci/) は、GitHub リポジトリに追加できるボットです。 pre-commit-config.yaml ファイルで指定したツールを使って、すべての PR にコードフォーマットを自動的に適用します。 時間を大幅に節約することができ、新しい貢献者にとっても貢献が簡単になります。

source: Automation is good! By making code quality tools care of your code, you can focus on structural and high values tasks.
es: ¡La automatización es buena! Al hacer que las herramientas de calidad de código se ocupen de su código, puede centrarse en tareas estructurales y de gran valor.
ja: 自動化は良いことです! コードクオリティツールにコードを管理させることで、あなたは構造的で価値の高いタスクに集中することができます。

source: Consistent code format and style is useful to both your package and across the scientific Python ecosystem because using similar formats makes code easier to read.
es: Un formato y estilo de código consistentes son útiles tanto para su paquete como para todo el ecosistema de Python científico, ya que el uso de formatos similares hace que el código sea más fácil de leer.
ja: 一貫したコードフォーマットとスタイルは、あなたのパッケージにとっても、科学的なPythonエコシステム全体にとっても有用です、なぜなら、同じようなフォーマットを使うことでコードが読みやすくなるからです。

source: For instance, if you saw a sentence like this one without any spaces, or punctuation, it would take your brain longer to process it.
es: Por ejemplo, si viera una frase como esta sin espacios ni puntuación, le llevaría más tiempo procesarla.
ja: 例えば、空白や句読点のないこのような文章を見た場合、脳がそれを処理するのに時間がかかるだろう。

source: pyOpenSci peer review process requires that you to follow standard [Python PEP 8 format rules](https://peps.python.org/pep-0008/) as closely as you can.
es: El proceso de revisión por pares de pyOpenSci requiere que siga las reglas de formato estándar establecidas por [Python PEP 8](https://peps.python.org/pep-0008/) lo máximo posible.
ja: pyOpenSciの査読プロセスでは、標準的な [Python PEP 8 format rules](https://peps.python.org/pep-0008/) にできるだけ忠実に従うことが求められます。

source: pyOpenSci doesn't require you to use a specific code format tool. However, we do look for consistency and readability in code style. Below you will find a discussion of:
es: pyOpenSci no requiere que utilice una herramienta de formato de código específica. Sin embargo, buscamos consistencia y legibilidad en el estilo de código. A continuación, encontrará una discusión sobre:
ja: pyOpenSciは特定のコードフォーマットツールを使うことを要求しません。 しかし、コードスタイルに一貫性と読みやすさを求めています。 以下は、その考察です:

source: The benefits of using linters and code format tools in your workflow
es: Los beneficios de linters y herramientas de formato de código en su flujo de trabajo
ja: ワークフローでリンターとコードフォーマットツールを使用するメリット

source: Some commonly used tools in the scientific Python space
es: Algunas herramientas comúnmente utilizadas en el espacio de Python científico
ja: 科学的なPythonでよく使われるツール

source: Setting up pre-commit hooks and the pre-commit.ci bot to make using code format tools in daily workflows and in pull requests on GitHub easier.
es: Configuración de pre-commit hooks y el bot pre-commit.ci para facilitar el uso de herramientas de formato de código en flujos de trabajo diarios y en pull requests en GitHub.
ja: pre-commitフックとpre-commit.ciボットを設定することで、日々のワークフローやGitHubのプルリクエストでコードフォーマットツールを簡単に使えるようになります。

source: Use a code format tool (or tools) to make your life easier
es: Use una herramienta de formato de código (o herramientas) para facilitar el desarrollo
ja: コードフォーマットツール (または複数のツール) を使って生活を楽にします

source: We suggest that you use a code format tool, or a set of format tools, because manually applying all of the PEP 8 format specifications is both time consuming for maintainers and can be a road block for potential new contributors. Code formatters will automagically reformat your code for you, adhering to PEP 8 standards and applying consistent style decisions throughout.
es: Sugerimos que utilice una o varias herramienta de formato de código porque aplicar manualmente todas las normas PEP 8 consume mucho tiempo para los mantenedores y puede ser un obstáculo para los nuevos colaboradores. Los formateadores de código reformatearán automáticamente su código, siguiendo las normas PEP 8 y aplicando decisiones de estilo consistentes en todo el código.
ja: コードフォーマットツール、あるいはフォーマットツールのセットを使うことをお勧めします。PEP 8 のフォーマット仕様をすべて手作業で適用するのは、メンテナにとって時間がかかるだけでなく、潜在的な新規貢献者にとっては障害になりかねないからです。 コードフォーマッタはあなたのコードを自動的に再フォーマットし、PEP 8の標準を遵守し、一貫したスタイル決定を適用します。

source: Setting up a code format suite of tools will:
es: Establecer un conjunto de herramientas de formato de código hará que:
ja: コードフォーマット一式のツールを設定します:

source: Save you and your maintainer team time in fixing PEP 8 inconsistencies.
es: Ahorre tiempo, a usted y a su equipo de mantenimiento, en corregir inconsistencias de PEP 8.
ja: PEP 8の不整合を修正する時間を、あなたとあなたのメンテナチームに節約させます。

source: Ensure that format and style is consistent across your entire code-base.
es: Asegurese de que el formato y el estilo sean consistentes en todo su código.
ja: フォーマットとスタイルがコードベース全体で一貫していることを確認します。

source: Avoid lengthy discussions with contributors and other maintainers about personalized code format preferences during reviews.
es: Evite discusiones largas con colaboradores y otros mantenedores sobre preferencias de formato de código personalizadas durante las revisiones.
ja: レビューの際に、貢献者や他のメンテナと、個人的なコード形式の好みについて長々と議論するのは避けましょう。

source: Avoid pure visual edits in the code base so that code reviews focus on added value
es: Evite ediciones puramente visuales en el código para que las revisiones de código se centren en el valor añadido
ja: コードレビューが付加価値に焦点を当てるように、コードベースにおける純粋な視覚的編集を避けます。

source: Many packages use a suite of tools to apply code format rules, taking the work out of manually implementing code format requirements.
es: Muchos paquetes utilizan un conjunto de herramientas para aplicar reglas de formato de código, eliminando la necesidad de implementar manualmente los requisitos de formato de código.
ja: 多くのパッケージは、コードフォーマット規則を適用するために一連のツールを使用しており、手作業でコードフォーマット要件を実装する手間を省いています。

source: Consistent code format across packages within the (scientific) Python ecosystem, will also broadly make code easier to scan, understand and contribute to.
es: Un formato de código consistente en los paquetes dentro del ecosistema de Python (científico) también hará que el código sea más fácil de entender y contribuir.
ja: （科学的な）Pythonエコシステム内のパッケージ間で統一されたコードフォーマットは、広くコードをスキャンし、理解し、貢献することを容易にします。

source: Linting vs format and style
es: Linting vs formato y estilo
ja: リンティング vs フォーマットとスタイル

source: Before we dive in let's get a few definitions out of the way.
es: Antes de profundizar, aclaremos algunas definiciones.
ja: その前に、いくつかの定義を整理しておきましょう。

source: Code Linting
es: Linting de código
ja: コードリンティング

source: A code linter is a tool that will review your code and identify errors or issues. A linter typically does not modify your code. It will tell you what the error is and on what line it was discovered. Flake8, discussed below, is an example of a commonly-used code linter.
es: Un linter de código es una herramienta que revisará su código e identificará errores o problemas. Un linter normalmente no modifica su código. Le dirá cuál es el error y en qué línea se descubrió. Flake8, discutido a continuación, es un ejemplo de un linter de código comúnmente utilizado.
ja: コードリンターは、コードをレビューしてエラーや問題を特定するツールです。 リンターは通常、あなたのコードを修正しません。 エラーが何であり、どの行で発見されたかを教えてくれます。 後述するFlake8は、よく使われるコードリンターの一例です。

source: Code Formatters (and stylers)
es: Formateadores (y estilizadores) de código
ja: コードフォーマッタ（およびスタイラーズ）

source: Code formatters will reformat your code for you. Python focused code formatters often follow PEP 8 standards. However, they also make stylistic decisions about code consistency.
es: Los formateadores de código reformatearán su código por usted. Aquellos formateadores de código enfocados en Python suelen seguir las normas PEP 8. Sin embargo, también toman decisiones estilísticas sobre la consistencia del código.
ja: コードフォーマッタはあなたのコードを再フォーマットしてくれます。 Python に特化したコードフォーマッタは PEP 8 標準に従うことが多いです。 しかし、コードの一貫性に関する文体的な決定も行います。

source: Black is an example of a commonly-used code formatter. Black both applies PEP 8 standards while also making decisions about things like consistent use of double quotes for strings, and spacing of items in lists.
es: Black es un ejemplo de un formateador de código comúnmente utilizado. Black aplica tanto las normas PEP 8 como otras decisiones sobre cosas como el uso consistente de comillas dobles para cadenas de caracteres y el espaciado de elementos en listas.
ja: Blackはよく使われるコードフォーマッターの一例です。 BlackはPEP 8の標準を適用すると同時に、文字列に対する二重引用符の一貫した使用や、リスト内の項目のスペーシングなどについても決定しています。

source: You will learn more about Black below.
es: Aprenderá más sobre Black a continuación.
ja: Black については後述します。

source: Code linting, formatting and styling tools
es: Linting, formateo y estilización de código
ja: コードリンティング、フォーマット、スタイリングツール

source: [Black](https://black.readthedocs.io/en/stable/) is a code formatter. Black will automagically (and _unapologetically_) fix spacing issues and ensure code format is consistent throughout your package. Black also generally adheres to PEP 8 style guidelines with some exceptions. A few examples of those exceptions are below:
es: [Black](https://black.readthedocs.io/es/stable/) es un formateador de código. Black corregirá automáticamente (y _sin disculpas_) problemas de espaciado y asegurará que el formato del código sea consistente en todo su paquete. Black también se adhiere de forma general a las directrices de estilo PEP 8 con algunas excepciones. A continuación, se muestran algunos ejemplos de esas excepciones:
ja: [Black](https://black.readthedocs.io/en/stable/) はコードフォーマッタです。 Blackは自動的に(そして _unapologetically_ に)スペーシングの問題を修正し、コードフォーマットがパッケージ全体で一貫していることを保証します。 Blackはまた、いくつかの例外を除き、一般的にPEP 8スタイルガイドラインを遵守します。 以下にその例外の例をいくつか示します:

source: Black defaults to a line length of 88 (79 + 10%) rather than the 79 character `PEP 8` specification. However, line length is a setting can be manually overwritten in your Black configuration.
es: Black se ajusta por defecto a una longitud de línea de 88 (79 + 10%) en lugar de la especificación de 79 caracteres de `PEP 8`. Sin embargo, la longitud de línea es una configuración que se puede sobrescribir manualmente en su configuración de Black.
ja: Blackのデフォルトの行の長さは、79文字の `PEP 8` 仕様ではなく、88 (79 + 10%) です。 しかし、行の長さは Black の設定で手動で上書きすることができます。

source: Black will not adjust line length in your comments or docstrings.
es: Black no ajustará la longitud de línea en sus comentarios o docstrings.
ja: Blackはコメントやdocstringの行の長さを調整しません。

source: This tool will not review and fix import order (you need `isort` or `ruff` to do that - see below).
es: Esta herramienta no revisará ni corregirá el orden de importación (necesita `isort` o `ruff` para hacerlo - ver más abajo).
ja: このツールはインポートの順番を見直したり修正したりはしません（そのためには `isort` や `ruff` が必要です - 下記を参照してください）。

source: If you are interested in seeing how Black will format your code, you can use the [Black playground](https://black.vercel.app/)
es: Si está interesado en ver cómo Black formateará su código, puede utilizar el [_playground_ de Black](https://black.vercel.app/).
ja: Black があなたのコードをどのようにフォーマットするか興味がある場合は、 [Black playground](https://black.vercel.app/) を使用することができます。

source: Using a code formatter like Black will leave you more time to work on code function rather than worry about format.
es: Usar un formateador de código como Black le dejará más tiempo para trabajar en la función del código en lugar de preocuparse por el formato.
ja: Blackのようなコードフォーマッターを使うことで、書式を気にするよりもコードの機能に時間を割くことができます。

source: To adhere to Python `pep8` format standards, you might want to add [flake8](https://flake8.pycqa.org/en/latest/) to your code format toolbox.
es: Para adherirse a las normas de formato `pep8` de Python, es posible que desee agregar [flake8](https://flake8.pycqa.org/en/latest/) a su caja de herramientas de formato de código.
ja: Python の `pep8` フォーマットの標準に準拠するために、[flake8](https://flake8.pycqa.org/en/latest/) をコードフォーマットツールボックスに追加するとよいでしょう。

source: flake8 will:
es: flake8 hará lo siguiente:
ja: flake8 は:

source: Flag every line in your code that extends beyond 79 characters (including those in docstrings and comments)
es: Marcará cada línea de su código que se extienda más allá de 79 caracteres (incluyendo las de docstrings y comentarios)
ja: コード中の79文字を超えるすべての行にフラグを付ける（docstringやコメント中の行も含む）

source: Flag spacing issues that conflict with PEP 8 guidelines such as missing spaces after commas
es: Marcará problemas de espaciado que entran en conflicto con las directrices PEP 8, como la falta de espacios después de las comas
ja: カンマの後にスペースがないなど、PEP 8ガイドラインに抵触するフラグスペースの問題

source: Flake8 also flags unused imports and unused declared variables in your modules.
es: Flake8 también marcará importaciones no utilizadas y variables declaradas no utilizadas en sus módulos.
ja: Flake8はまた、モジュール内の未使用のインポートや未使用の宣言変数にフラグを立てます。

source: Below you can see the output of running `flake8 filename.py` at the command line for a Python file within a package called `stravalib`.
es: A continuación, puede ver la salida de ejecutar `flake8 filename.py` en la línea de comandos para un archivo de Python dentro de un paquete llamado `stravalib`.
ja: 下記は `stravalib` というパッケージ内の Python ファイルに対してコマンドラインで `flake8 filename.py` を実行したときの出力です。

source: The line length standard for PEP 8 is 79 characters.
es: La longitud de línea estándar para PEP 8 es de 79 caracteres.
ja: PEP 8の行の長さの標準は79文字です。

source: Notice that flake8 returns a list of issues that it found in the model.py module on the command line. The Python file itself is not modified. Using this output, you can fix each issue line by line manually.
es: Observe que flake8 devuelve una lista de problemas que encontró en el módulo model.py a través de la línea de comandos. El archivo Python no se modifica. Utilizando esta salida de la terminal, puede arreglar cada problema manualmente, línea a línea.
ja: flake8はコマンドラインでmodel.pyモジュールで見つかった問題のリストを返すことに注意してください。 Pythonファイル自体は変更されません。 この出力を使って、問題を一行ずつ手作業で修正することができます。

source: Python imports refer to the Python packages that a module in your package requires. Imports should always be located at the top of each Python module in your package.
es: Llamamos importaciones de Python a los paquetes de Python que un módulo en su paquete requiere. Las importaciones siempre deben estar ubicadas en la parte superior de cada módulo de Python en su paquete.
ja: Python import は、あなたのパッケージのモジュールが必要とする Python パッケージを指します。 importsは常にパッケージ内の各Pythonモジュールの先頭に配置されるべきです。

source: [PEP 8 has specific standards for the order of these imports](https://peps.python.org/pep-0008/#imports). These standards are listed below:
es: [PEP 8 tiene estándares específicos para el orden de estas importaciones](https://peps.python.org/pep-0008/#imports). Estos estándares se enumeran a continuación:
ja: [PEP 8には、これらのimportの順序に関する具体的な基準があります](https://peps.python.org/pep-0008/#imports) 。これらの基準を以下に示します:

source: Imports should be grouped in the following order:
es: Las importaciones deben agruparse en el siguiente orden:
ja: import は以下の順序でグループ化します:

source: Standard library imports.
es: Importaciones de la librería estándar.
ja: 標準ライブラリの import 。

source: Related third party imports.
es: Importaciones de terceros.
ja: 関連するサードパーティの import 。

source: Local application/library specific imports.
es: Importaciones específicas de la aplicación/librería local.
ja: ローカルアプリケーション/ライブラリ固有のインポート。

source: While `flake8` will identify unused imports in your code, it won't fix or identify issues with the order of package imports.
es: Si bien `flake8` identificará importaciones no utilizadas en su código, no corregirá ni identificará problemas con el orden de las importaciones de paquetes.
ja: `flake8` はあなたのコードで使用されていないインポートを特定しますが、パッケージのインポートの順序に関する問題を修正したり特定したりすることはできません。

source: `isort` will identify where imports in your code are out of order. It will then modify your code, automatically reordering all imports. This leaves you with one less thing to think about when cleaning up your code.
es: `isort` identificará dónde están desordenadas las importaciones en su código. Luego modificará su código, reordenando automáticamente todas las importaciones. Esto le deja con una cosa menos en la que pensar al limpiar su código.
ja: `isort` は、コードの中でインポートの順番が狂っている箇所を特定します。 そして、あなたのコードを修正し、すべてのインポートの順番を自動的に並べ替えます。 これで、コードを整理するときに考えることが1つ減ります。

source: Example application of isort
es: Ejemple de uso de isort
ja: isort の使用例

source: Code imports before `isort` is run:
es: Importaciones de código antes de ejecutar `isort`:
ja: `isort` が実行される前にコードがインポートされます:

source: Below, the `pandas` is a third party package, `typing` is a core `Python` package distributed with `Python`, and `examplePy.temperature` is a first-party module which means it belongs to the same package as the file doing the import. Also notice that there are no spaces in the imports listed below.
es: A continuación, `pandas` es un paquete de terceros, `typing` es un paquete de la librería estándar distribuido con `Python`, y `examplePy.temperature` es un módulo propio, lo que significa que pertenece al mismo paquete que el archivo que realiza la importación. También observe que no hay espacios en las importaciones listadas a continuación.
ja: 以下では、`pandas`はサードパーティのパッケージであり、`typing`は `Python` とともに配布されている `Python` のコアパッケージであり、 `examplePy.temperature`はファーストパーティモジュールで、インポートを行うファイルと同じパッケージに属していることを意味します。 また、以下のインポートにスペースがないことに注意してください。

source: From the project root, run:
es: Desde la raíz del proyecto, ejecute:
ja: プロジェクトルートから以下を実行してください:

source: Python file `temporal.py` imports after `isort` has been run
es: Importaciones del archivo de Python `temporal.py` después de ejecutar `isort`
ja: Python ファイル `temporal.py` は `isort` が実行された後にインポートされます。

source: [Ruff](https://docs.astral.sh/ruff/) is a new addition to the code quality ecosystem, gaining some traction since its release. `ruff` is both a linter and a code formatter for Python, aiming to replace several tools behind a single interface. As such, `ruff` can be used at a replacement of all other tools mentioned here, or in complement to some of them.
es: [Ruff](https://docs.astral.sh/ruff/) es una nueva incorporación al ecosistema de calidad de código, que ha ganado cierta tracción desde su lanzamiento. `ruff` es tanto un linter como un formateador de código para Python, con el objetivo de reemplazar varias herramientas detrás de una única interfaz. Como tal, `ruff` puede ser utilizado como reemplazo de todas las demás herramientas mencionadas aquí, o en complemento a algunas de ellas.
ja: [Ruff](https://docs.astral.sh/ruff/) は、コードクオリティのエコシステムに新しく追加されたもので、リリース以来人気を集めています。 `ruff` はPythonのリンターであり、コード整形ツールでもあります。 そのため、 `ruff` はここで紹介する他のすべてのツールの置き換えとして、あるいはいくつかのツールの補完として使用することができます。

source: `ruff` has some interesting features that distinguish it from other linters:
es: `ruff` tiene algunas características interesantes que lo distinguen de otros linters:
ja: `ruff` には他のリンターと異なる興味深い特徴があります:

source: Linter configuration in `pyproject.toml`
es: Configuración del linter en `pyproject.toml`
ja: `pyproject.toml` のリンター設定

source: Several hundred rules included, many of which are automatically fixable
es: Cientos de reglas incluidas, muchas de las cuales son automáticamente corregibles
ja: 数百のルールが含まれ、その多くは自動的に修正可能です

source: Rules explanation, see [F403](https://docs.astral.sh/ruff/rules/undefined-local-with-import-star/) for an example
es: Explicación de las reglas, consulte [F403](https://docs.astral.sh/ruff/rules/undefined-local-with-import-star/) para un ejemplo
ja: ルールの説明、例については [F403](https://docs.astral.sh/ruff/rules/undefined-local-with-import-star/) を参照してください。

source: Fast execution time, makes a quick feedback loop possible even on large projects.
es: Tiempo de ejecución rápido, permite un ciclo de retroalimentación rápido incluso en proyectos grandes.
ja: 実行時間が速いので、大規模プロジェクトでも素早いフィードバックループが可能。

source: Here is a simple configuration to get started with `ruff`. It would go into your `pyproject.toml`:
es: Aquí hay una configuración simple para comenzar con `ruff`. Se colocaría en su `pyproject.toml`.
ja: 以下は `ruff` を使い始めるための簡単な設定です。 これは `pyproject.toml` に記述します:

source: Depending on your project, you might want to add the following to sort imports correctly:
es: Dependiendo de su proyecto, es posible que desee agregar lo siguiente para ordenar las importaciones correctamente:
ja: プロジェクトによっては、インポートを正しく並べ替えるために以下を追加するとよいです:

source: How to use code formatter in your local workflow
es: Como usar un formateador de código en su flujo de trabajo local
ja: ローカルワークフローでコードフォーマッタを使用する方法

source: Linters, code formatters and your favorite coding tools
es: Linters, formateadores de código y sus herramientas de codificación favoritas
ja: リンター、コードフォーマッター、お気に入りのコーディングツール

source: Linters can be run as a command-line tool as shown above. They also can be run within your favorite coding tool (e.g. VScode, pycharm, etc). For example, you might prefer to have tools like Black and isort run when you save a file. In some editors you can also setup shortcuts that run your favorite code format tools on demand.
es: Los linters se pueden ejecutar como una herramienta de línea de comandos como se muestra arriba. También se pueden ejecutar dentro de su editor de código favorito (por ejemplo, VScode, pycharm, etc). Por ejemplo, es posible que prefiera que herramientas como Black e isort se ejecuten cuando guarda un archivo. En algunos editores también puede configurar accesos directos que ejecuten sus herramientas de formato de código favoritas bajo demanda.
ja: リンターは上記のようにコマンドラインツールとして実行できます。 また、お気に入りのコーディングツール（VScodeやpycharmなど）の中で実行することもできます。 例えば、ファイルを保存するときにBlackやisortのようなツールを実行させたいかもしれません。 エディタによっては、お気に入りのコード整形ツールをオンデマンドで実行するショートカットを設定することもできる。

source: Use pre-commit hooks to run code formatters and linters on commits
es: Use pre-commit hooks para ejecutar formateadores de código y linters en los commits
ja: プレコミットフックを使って、コミット時にコードフォーマッタやリンタを実行
