Repository: pyOpenSci/python-package-guide
Catalog: locales/*/LC_MESSAGES/package-structure-code.po
Languages: es, ja

source: There are a several different build tools that you can use to [create your Python package's _sdist_ and _wheel_ distributions](python-package-distribution-files-sdist-wheel). Below, we discuss the features, benefits and limitations of the most commonly used Python packaging tools. We focus on pure-python packages in this guide. However, we also highlight tools that currently support packages with C/C++ and other language extensions.
es: Hay varias herramientas de construcción diferentes que puede utilizar para [crear las distribuciones _sdist_ y _wheel_ de su paquete de Python](python-package-distribution-files-sdist-wheel). A continuación, discutimos las características, beneficios y limitaciones de las herramientas de empaquetado de Python más comúnmente utilizadas. Nos enfocamos en paquetes de Python puro en esta guía. Sin embargo, también destacamos herramientas que actualmente admiten paquetes con extensiones en C/C++ y otros lenguajes.
ja: [Python パッケージの _sdist_ ディストリビューションと _wheel_ ディストリビューションを作成する](python-package-distribution-files-sdist-wheel) ために使えるビルドツールはいくつかあります。 以下では、最もよく使われる Python パッケージングツールの機能、利点、制限について説明します。 このガイドでは純粋な Python パッケージに焦点を当てます。 しかし、現在C/C++やその他の言語拡張を含むパッケージをサポートしているツールも紹介します。

source: Decision tree diagram showing the various front and back end packaging tools. You can decide what packaging tool to use by thinking about what features you need. PDM and Hatch are currently the most flexible tools as they also using different build back-ends. As such currently PDM and Hatch are the tools we think beginners might appreciate most with Poetry being a close second. Poetry is nice for pure Python projects.
es: Diagrama de árbol de decisión que muestra las diversas herramientas de empaquetado frontend y backend. Puede decidir qué herramienta de empaquetado utilizar pensando en qué características necesita. PDM y Hatch son actualmente las herramientas más flexibles ya que también utilizan diferentes backends de construcción. Por lo tanto, actualmente PDM y Hatch son las herramientas que creemos que los principiantes podrían apreciar más, con Poetry siendo un segundo cercano. Poetry es agradable para proyectos de Python puro.
ja: さまざまなフロントエンドとバックエンドのパッケージングツールを示すデシジョンツリー図。 どのパッケージングツールを使うかは、どんな機能が必要かを考えることで決めることができます。 PDMとHatchは、異なるビルドバックエンドを使用しているため、現在のところ最も柔軟なツールです。 PDMとHatchは初心者に最も喜ばれるツールで、Poetryはその次です。 Poetryは純粋なPythonプロジェクトに適しています。

source: Diagram showing the different front end build tools available to use in the Python package ecosystem that you can select from. We selected tools to include in this diagram based upon the PyPI survey which helped us understand the most populate tools in the ecosystem. Each tool has different features as highlighted below.
es: Diagrama que muestra las diferentes herramientas de construcción de frontend disponibles para usar en el ecosistema de paquetes de Python que puede seleccionar. Seleccionamos herramientas para incluir en este diagrama basándonos en la encuesta de PyPI que nos ayudó a comprender las herramientas más populares en el ecosistema. Cada herramienta tiene características diferentes como se destaca a continuación.
ja: Pythonパッケージのエコシステムで利用可能な、さまざまなフロントエンドビルドツールを示す図です。この図に含めるツールは、エコシステムで最も利用されているツールを理解するのに役立ったPyPI調査に基づいて選択しました。各ツールには、以下のように異なる特徴があります。

source: If you want to know more about Python packages that have extensions written in other languages, [check out the page on complex package builds.](complex-python-package-builds)
es: Si desea saber más sobre paquetes de Python que tienen extensiones escritas en otros lenguajes, [consulte la página sobre construcciones de paquetes complejas.](complex-python-package-builds)
ja: 他の言語で書かれた拡張機能を持つPythonパッケージについてもっと知りたい場合は、 [複雑なパッケージのビルドのページをチェックしてください](complex-python-package-builds)

source: Tools that we review here
es: Herramientas que revisamos aquí
ja: ここでレビューするツール

source: In this section we have selected tools that were returned as the most popular packaging tools in the PyPA survey. You will learn more about the following tools on this page:
es: En esta sección hemos seleccionado las herramientas de empaquetado más populares en la encuesta de PyPA. Aprenderá más sobre las siguientes herramientas en esta página:
ja: このセクションでは、PyPAのアンケートで最も人気のあったパッケージングツールを紹介します。 このページでは以下のツールについて詳しく説明します:

source: Summary of tools Hatch vs. PDM vs. Poetry (and setuptools)
es: Resumen de herramientas Hatch vs. PDM vs. Poetry (y setuptools)
ja: ツールまとめ Hatch vs PDM vs Poetry (と setuptools)

source: If you are looking for a quick summary, read below.
es: Si está buscando un resumen rápido, lea a continuación.
ja: 簡単な要約をお探しの方は、以下をお読みください。

source: In general, any modern tool that you select from this page will be great to build your package. Selecting a tool comes down to the features that you are looking for in your workflow.
es: En general, cualquier herramienta moderna que seleccione de esta página será excelente para construir su paquete. La selección de que herramienta usar depende de las características de su flujo de trabajo.
ja: 一般的に、このページから選択した最新のツールは、パッケージを構築するのに適しています。 ツールの選択は、ワークフローに求める機能によって決まります。

source: We suggest that beginners start with a modern workflow tool like PDM as opposed to navigating the complexities of setuptools.
es: Sugerimos que los principiantes comiencen con una herramienta de flujo de trabajo moderna como PDM en lugar de navegar por las complejidades de setuptools.
ja: 初心者の方は、 setuptools の複雑な操作ではなく、PDMのような最新のワークフローツールから始めることをお勧めします。

source: If you are going to use Poetry (it is the most popular tool and does have the best documentation) beware of the upper bounds dependency additions and consider overriding dependencies when you add them. If you do that Poetry will work well for pure-python builds! Poetry also has an active discord where you can ask questions.
es: Si va a utilizar Poetry (es la herramienta más popular y tiene la mejor documentación), tenga en cuenta que la herramienta asume automáticamente una dependencia a la versión mayor actual y considere eliminar estas dependencias cuando la herramienta las agregue. ¡Si hace eso, Poetry funcionará bien para construcciones de Python puro! Poetry también tiene un discord activo donde puede hacer preguntas.
ja: Poetryを使うのであれば (最も人気のあるツールであり、最高のドキュメントを持っています) 、依存関係の追加上限値に注意し、依存関係を追加する際にオーバーライドすることを検討してください。 そうすれば、Poetryは純粋なPythonビルドでもうまく動くでしょう！ また、Poetryには活発な discord があり、質問をすることができます。

source: Below are some features that Hatch and PDM offer that Poetry does not.
es: Abajo hay algunas características que Hatch y PDM ofrecen que Poetry no.
ja: 以下は、ハッチとPDMが提供し、Poetryが提供しない機能です。

source: Supports other back-ends making it ideal for builds that are not pure Python. This means PDM is a great option for both pure python and more complex Python builds as it supports meson-python and other build backends.
es: Admite otros backends, lo que lo hace ideal para construcciones que no son de Python puro. Esto significa que PDM es una excelente opción tanto para Python puro como para construcciones de Python más complejas, ya que admite meson-python y otros backends de construcción.
ja: 他のバックエンドをサポートしているので、純粋な Python ではないビルドに最適です。 つまり、PDMはmeson-pythonや他のビルドバックエンドをサポートしているので、純粋なPythonにも、より複雑なPythonビルドにも最適なオプションです。

source: Offers flexibility in dependency management which we like
es: Ofrece flexibilidad en la gestión de dependencias que nos gusta
ja: 依存関係の管理に柔軟性があります

source: Offers lock files if you need them
es: Ofrece archivos de bloqueo si los necesita
ja: 必要に応じてファイルをロックすることも可能です

source: Offers matrix environment management that allows you to run tests across Python versions. If this feature is important to you, then Hatch is a clear winner.
es: Ofrece gestión de entornos que le permite ejecutar pruebas en versiones de Python. Si esta característica es importante, Hatch es el claro ganador.
ja: Pythonのバージョンにまたがってテストを実行できるマトリックス環境管理を提供します。 もしこの機能があなたにとって重要なら、Hatch が明らかに勝者です。

source: Offers a Nox / Make file like tool to streamline your build workflow. If you are looking to reduce the number of tools in your workflow, Hatch might be for you.
es: Ofrece una herramienta Nox / Make file para optimizar su flujo de trabajo de construcción. Si está buscando reducir el número de herramientas en su flujo de trabajo, Hatch podría ser una buena opción.
ja: ビルドワークフローを効率化するNox/Makeファイルのようなツールを提供します。 ワークフローにおけるツールの数を減らしたいのであれば、Hatchはうってつけかもしれません。

source: Build front-end vs. build back-end tools
es: Constructores frontend vs. constructores backend
ja: フロントエンド構築ツールとバックエンド構築ツール

source: To better understand your options, when it comes to building a Python package, it's important to first understand the difference between a build tool front-end and build back-end.
es: Para comprender mejor sus opciones, cuando se trata de construir un paquete de Python, es importante primero comprender la diferencia entre un constructor de frontend y un constructor de backend.
ja: Pythonパッケージのビルドに関して、あなたの選択肢をよりよく理解するためには、まずビルドツールのフロントエンドとビルドのバックエンドの違いを理解することが重要です。

source: Build back-ends
es: Constructores backend
ja: バックエンドのビルド

source: Most packaging tools have a back-end build tool that builds you package and creates associated [(sdist and wheel) distribution files](python-package-distribution-files-sdist-wheel). Some tools, such as **Flit**, only support pure-Python package builds. A pure-Python build refers to a package build that does not have extensions that are written in another programming language (such as `C` or `C++`).
es: La mayoría de las herramientas de empaquetado tienen una herramienta de construcción de backend que construye su paquete y crea archivos de distribución [(sdist y wheel)](python-package-distribution-files-sdist-wheel) asociados. Algunas herramientas, como **Flit**, solo admiten construcciones de paquetes de Python puro. Una construcción de Python puro se refiere a una construcción de paquete que no tiene extensiones escritas en otro lenguaje de programación (como `C` o `C++`).
ja: ほとんどのパッケージングツールには、パッケージをビルドし、関連する [(sdistとwheel)配布ファイル](python-package-distribution-files-sdist-wheel) を作成するバックエンドビルドツールがあります。 **Flit** のようないくつかのツールは、純粋なPythonパッケージのビルドのみをサポートしています。 純粋な Python のビルドとは、他のプログラミング言語 (`C` や `C++` など) で書かれた拡張機能を持たないパッケージのビルドを指します。

source: Other packages that have C and C++ extensions (or that wrap other languages such as fortran) require additional code compilation steps when built. Back-ends such as **setuptools.build**, **meson.build** and **scikit-build** support complex builds with custom steps. If your build is particularly complex (i.e. you have more than a few `C`/`C++` extensions), then we suggest you use **meson.build** or **scikit-build**.
es: Otros paquetes que tienen extensiones en C y C++ (o que envuelven otros lenguajes como Fortran) requieren pasos adicionales de compilación de código cuando se construyen. Backends como **setuptools.build**, **meson.build** y **scikit-build** admiten construcciones complejas con pasos personalizados. Si su construcción es particularmente compleja (es decir, tiene varias extensiones `C`/`C++`), entonces le sugerimos que use **meson.build** o **scikit-build**.
ja: C や C++の拡張を持つ他のパッケージ(あるいは fortran のような他の言語を包含するパッケージ)は、ビルド時に追加のコードコンパイルステップを必要とします。 **setuptools.build** 、 **meson.build** 、 **scikit-build** などのバックエンドは、カスタムステップによる複雑なビルドをサポートしています。ビルドが特に複雑な場合（つまり `C`/`C++` 拡張モジュールが数個以上ある場合）は、 **meson.build** または **scikit-build** を使用することをお勧めします。

source: Python package build front-ends
es: Constructores frontend de paquetes de Python
ja: Pythonパッケージビルドフロントエンド

source: A packaging front-end tool refers to a tool that makes it easier for you to perform common packaging tasks using similar commands. These tasks include:
es: Una herramienta de frontend de empaquetado se refiere a una herramienta que facilita la realización de tareas de empaquetado comunes utilizando comandos similares. Estas tareas incluyen:
ja: パッケージングフロントエンドツールとは、同様のコマンドを使用して一般的なパッケージングタスクを簡単に実行できるようにするツールのことです。 これらのタスクには以下のようなものがあります:

source: [Build your packages (create the sdist and wheel distributions)](python-package-distribution-files-sdist-wheel)
es: [Construir sus paquetes (crear las distribuciones sdist y wheel)](python-package-distribution-files-sdist-wheel)
ja: [パッケージのビルド (sdist と wheel ディストリビューションの作成)](python-package-distribution-files-sdist-wheel)

source: Installing your package in a development mode (so it updates when you update your code)
es: Instalar su paquete en un modo de desarrollo (para que se actualice cuando actualice su código)
ja: 開発モードでパッケージをインストールします (コードを更新したときに更新されるようにします)

source: Publishing to PyPI
es: Publicar en PyPI
ja: PyPIへの公開

source: Running tests
es: Ejecutar tests
ja: テストの実行

source: Building documentation
es: Construir documentación
ja: ドキュメントの作成

source: Managing an environment or multiple environments in which you need to run tests and develop your package
es: Gestionar uno o varios entornos de desarrollo en los que necesita ejecutar tests y desarrollar su paquete
ja: テストの実行やパッケージの開発が必要な環境、または複数の環境の管理

source: There are several Python packaging tools that you can use for pure Python builds. Each front-end tool discussed below supports a slightly different set of Python packaging tasks.
es: Hay varias herramientas de empaquetado de Python que puede utilizar para construcciones de Python puro. Cada herramienta de frontend discutida a continuación admite un conjunto ligeramente diferente de tareas de empaquetado de Python.
ja: 純粋な Python のビルドに使える Python パッケージングツールがいくつかあります。 以下で説明する各フロントエンドツールは、少しずつ異なる Python パッケージングタスクをサポートしています。

source: For instance, you can use the packaging tools **Flit**, **Hatch** or **PDM** to both build and publish your package to PyPI. However while **Hatch** and **PDM** support versioning and environment management, **Flit** does not. If you want a tool that supports dependency locking, you can use **PDM** or **Poetry** but not **Hatch**. If you only need to build your package's sdist and wheel distribution files, then you can stick with PyPA's Build. You'd then use Twine to publish to PyPI.
es: Por ejemplo, puede utilizar las herramientas de empaquetado **Flit**, **Hatch** o **PDM** tanto para construir como publicar su paquete en PyPI. Sin embargo, mientras **Hatch** y **PDM** admite el versionado y la gestión de entornos, **Flit** no lo hace. Si desea una herramienta que admita el bloqueo de dependencias, puede utilizar **PDM** o **Poetry** pero no **Hatch**. Si solo necesita construir los archivos de distribución sdist y wheel de su paquete, entonces puede quedarse con Build de PyPA. Luego usaría Twine para publicar en PyPI.
ja: 例えば、パッケージングツールの **Flit**、**Hatch**、**PDM** を使って、パッケージのビルドと PyPI への公開の両方を行うことができます。 しかし、**Hatch**と**PDM**はバージョン管理と環境管理をサポートしていますが、 **Flit** はサポートしていません。 依存性ロックをサポートするツールが欲しい場合は、**PDM**や**Poetry**を使うことができますが、 **Hatch** は使えません。 パッケージのsdistとwheelの配布ファイルをビルドするだけなら、PyPAのBuildで十分です。 その後、Twineを使ってPyPIに公開します。

source: If you are using **Setuptools**, there is no default user-friendly build front-end that performs multiple tasks. You will need to use **build** to build your package and **twine** to publish to PyPI.
es: Si está utilizando **Setuptools**, no hay un frontend de construcción predeterminado fácil de usar que realice múltiples tareas. Necesitará usar **build** para construir su paquete y **twine** para publicar en PyPI.
ja: **Setuptools** を使用している場合、複数のタスクを実行するデフォルトのユーザーフレンドリーなビルドフロントエンドはありません。 パッケージをビルドするには **build** を、PyPI に公開するには **twine** を使う必要があります。

source: Example build steps that can be simplified using a front-end tool
es: Ejemplo de pasos de construcción que se pueden simplificar utilizando una herramienta de frontend
ja: フロントエンドツールを使って簡略化できるビルド手順の例

source: Below, you can see how a build tool streamlines your packaging experience. Example to build your package with **Hatch**:
es: A continuación, puede ver cómo una herramienta de construcción simplifica su experiencia de empaquetado. Ejemplo para construir su paquete con **Hatch**:
ja: 以下に、ビルドツールがパッケージングをどのように効率化するかを示します。 **Hatch** でパッケージをビルドする例です:

source: Example build steps using the **setuptools** back-end and **build**:
es: Ejemplo de pasos de construcción utilizando el backend de **setuptools** y **build**:
ja: **setuptools** バックエンドと **build** を使用したビルド手順の例:

source: Choosing a build back-end
es: Eligiendo un backend de construcción
ja: ビルドバックエンドの選択

source: Most front-end packaging tools have their own back-end build tool. The build tool creates your package's (sdist and wheel) distribution files. For pure Python packages, the main difference between the different build back-ends discussed below is:
es: La mayoría de las herramientas de empaquetado de frontend tienen su propia herramienta de construcción de backend. La herramienta de construcción crea los archivos de distribución (sdist y wheel) de su paquete. Para paquetes de Python puro, la principal diferencia entre los diferentes backends de construcción discutidos a continuación es:
ja: ほとんどのフロントエンドパッケージングツールは、独自のバックエンドビルドツールを持っています。 ビルドツールはパッケージの (sdistやwheelの) 配布ファイルを作成します。 純粋なPythonパッケージの場合、以下で説明するビルドバックエンド間の主な違いは以下の通りです:

source: How configurable they are - for example, do they allow you to add build steps that support non python extensions?
es: Qué tan configurables son - por ejemplo, ¿le permiten agregar pasos de construcción que admitan extensiones no Python?
ja: 設定可能性 - 例えば、Python以外の拡張機能をサポートするビルドステップを追加することはできますか？

source: How much you need to configure them to ensure the correct files are included in your sdist and wheel distributions.
es: Cuánto necesita configurarlos para asegurarse de que los archivos correctos se incluyan en sus distribuciones sdist y wheel.
ja: 正しいファイルがsdistとwheelディストリビューションに含まれていることを確認するために、どの程度設定する必要があるか。

source: Build back-end support for non pure-python packages
es: Construcción de soporte de backend para paquetes no puros de Python
ja: 純粋なPythonパッケージ以外のバックエンドサポートの構築

source: It is important to note that some build back-ends, such as **Flit-core**, only support pure Python builds. Other back-ends support C and C++ extensions as follows:
es: Es importante tener en cuenta que algunos backends de construcción, como **Flit-core**, solo admiten construcciones de Python puro. Otros backends admiten extensiones en C y C++ de la siguiente manera:
ja: **Flit-core** のようないくつかのビルドバックエンドは、純粋なPythonビルドしかサポートしていないことに注意することが重要です。その他のバックエンドは、以下のようにCとC++の拡張をサポートしています:

source: setuptools supports builds using C / C++ extensions
es: setuptools admite construcciones utilizando extensiones en C / C++
ja: setuptools は、C / C++ 拡張モジュールを使用したビルドをサポートします。

source: Hatchling (hatch's back-end) supports C / C++ extensions via plugins that the developer creates to customize a build
es: Hatchling (backend de hatch) admite extensiones en C / C++ a través de complementos que el desarrollador crea para personalizar una construcción
ja: Hatchling (hatchのバックエンド) は、開発者がビルドをカスタマイズするために作成するプラグインによって、C/C++の拡張機能をサポートしています。

source: PDM's back-end supports C / C++ extensions by using setuptools
es: El backend de PDM admite extensiones en C / C++ utilizando setuptools
ja: PDMのバックエンドは、setuptoolsを使用してC / C++拡張をサポートしています。

source: Poetry's back-end supports C/C++ extensions however this functionality is currently undocumented. As such we don't recommend using Poetry for complex or non pure Python builds until it is documented.
es: El backend de Poetry admite extensiones en C/C++ sin embargo esta funcionalidad actualmente no está documentada. Por lo tanto, no recomendamos usar Poetry para construcciones complejas o no puras de Python hasta que esté documentada.
ja: PoetryのバックエンドはC/C++拡張をサポートしていますが、この機能は現在ドキュメント化されていません。 そのため、ドキュメント化されるまでは、複雑なビルドや純粋なPython以外のビルドにPoetryを使うことはお勧めしません。

source: While we won't discuss more complex builds below, we will identify which tools have documented support for C / C++ extensions.
es: Si bien no discutiremos construcciones más complejas a continuación, identificaremos qué herramientas tienen soporte documentado para extensiones en C / C++.
ja: 以下では、より複雑なビルドについては説明しませんが、どのツールがC / C++の拡張機能を文書でサポートしているかを確認します。

source: An ecosystem of Python build tools
es: Un ecosistema de herramientas de construcción de Python
ja: Pythonビルドツールのエコシステム

source: Below we introduce several of the most commonly used Python packaging build front-end tools. We highlight the features that each tool offers as a way to help you decide what tool might be best for your workflow.
es: A continuación, presentamos varias de las herramientas de frontend de construcción de paquetes de Python más comúnmente utilizadas. Destacamos las características que ofrece cada herramienta como una forma de ayudarlo a decidir qué herramienta podría ser la mejor para su flujo de trabajo.
ja: 以下では、最もよく使われる Python パッケージングビルドフロントエンドツールをいくつか紹介します。 どのツールがあなたのワークフローに最適かを決める手助けとして、各ツールが提供する機能を強調します。

source: We do not suggest using setuptools
es: No sugerimos usar setuptools
ja: setuptools の使用はお勧めしません

source: We suggest that you pick one of the modern tools listed above rather than setuptools because setuptools will require some additional knowledge to set up correctly.
es: Sugerimos que elija una de las herramientas modernas discutidas anteriormente en lugar de setuptools porque setuptools requerirá algunos conocimientos adicionales para configurarse correctamente.
ja: setuptoolsは、正しくセットアップするためにいくつかの追加知識を必要とするため、setuptoolsではなく、上記の近代的なツールのいずれかを選択することをお勧めします。

source: We review setuptools as a back-end because it is still popular. However it is not the most user friendly option.
es: Revisamos setuptools como backend porque todavía es popular. Sin embargo, no es la opción más amigable para el usuario.
ja: バックエンドとしてsetuptoolsをレビューするのは、今でも人気があるからです。 しかし、それは最もユーザーフレンドリーなオプションではありません。

source: The most commonly used tools in the ecosystem are setuptools back-end (with build) and Poetry (a front end tool with numerous features and excellent documentation).
es: Las herramientas más utilizadas en el ecosistema son el backend de setuptools (con build) y Poetry (una herramienta de frontend con numerosas características y excelente documentación).
ja: エコシステムで最もよく使われるツールは、setuptoolsのバックエンド（ビルド機能付き）とPoetry（多数の機能と優れたドキュメントを備えたフロントエンドツール）です。

source: Graph showing the results of the 2022 PyPA survey of Python packaging tools. On the x axis is percent response and on the y axis are the tools.
es: Gráfico que muestra los resultados de la encuesta de PyPA 2022 de herramientas de empaquetado de Python. En el eje x está la respuesta porcentual y en el eje y están las herramientas.
ja: 2022年のPyPAによるPythonパッケージングツールの調査結果を示すグラフです。 X軸は回答率、Y軸はツールです。
