Repository: pyOpenSci/python-package-guide
Catalog: locales/*/LC_MESSAGES/package-structure-code.po
Languages: es, ja

source: Some people prefer to use [calver](https://calver.org/index.html) for versioning. It may be a simpler-to-use system given it relies upon date values associated with released versions. However, calver does not provide a user with a sense of when a new version might break an existing build. As such we still suggest semver.
es: Algunas personas prefieren usar [calver](https://calver.org/index.html) para el versionado. Puede ser un sistema más fácil de usar dado que se basa en valores de fecha asociados con las versiones lanzadas. Sin embargo, calver no proporciona al usuario una idea de cuándo una nueva versión podría romper una compilación existente. Por lo tanto, seguimos sugiriendo semver.
ja: バージョン管理には[calver](https://calver.org/index.html)を好んで使う人もいます。リリースされたバージョンに関連する日付の値に依存することを考えれば、より使いやすいシステムかもしれません。 しかし、calverは、新しいバージョンがいつ既存のビルドを壊すかもしれないという感覚をユーザーに提供しません。 そのため、semverをお勧めします。

source: pyOpenSci will never require semver in a peer review as long as a package has a reasonable approach to versioning!
es: ¡pyOpenSci nunca requerirá semver en una revisión por pares siempre que un paquete tenga un enfoque razonable para el versionado!
ja: pyOpenSciは、パッケージがバージョニングに対して合理的なアプローチを持っている限り、査読でsemverを要求することはありません！

source: Avoid manually updating Python package version numbers if you can
es: Evite actualizar manualmente los números de versión de los paquetes de Python si puede
ja: Python パッケージのバージョン番号を手動で更新するのは、できる限り避けてください。

source: Often times you may want to have your package version value in multiple locations. One example of this is that it might be both an attribute in your package **version** and also called in your documentation.
es: A menudo, es posible que desee tener el valor de la versión de su paquete en múltiples ubicaciones. Un ejemplo de esto es que podría ser tanto un atributo en su paquete **version** como también llamado en su documentación.
ja: パッケージのバージョンの値を複数の場所で持ちたい場合がよくあります。 その一例として、パッケージの **version** の属性であると同時に、ドキュメントの中で呼び出されることがあります。

source: We recommend that you avoid manual updates of your package version number to avoid human-error. It is better practice to keep your version number in one location.
es: Recomendamos que evite las actualizaciones manuales del número de versión de su paquete para evitar errores humanos. Es mejor mantener su número de versión en una sola ubicación.
ja: ヒューマンエラーを避けるため、パッケージのバージョン番号の手動更新は 避けることをお勧めします。 バージョン番号は一箇所にまとめておく方がよいでしょう。

source: If you can't implement a single location version, then consider using a tool like hatch, PDM or bump2version that will update the version values for you - throughout your package.
es: Si no puede implementar una versión de una sola ubicación, considere usar una herramienta como hatch, PDM o bump2version que actualizará los valores de versión por usted, en todo su paquete.
ja: もし1カ所のバージョンを実装できないのであれば、hatchやPDM、bump2versionのような、パッケージ全体でバージョン値を更新してくれるツールの使用を検討しましょう。

source: Below we discuss some tools that you can use to manage updating Python package versions.
es: A continuación, discutimos algunas herramientas que puede utilizar para actualizar las versiones de los paquetes de Python.
ja: 以下では、Pythonパッケージのバージョン更新を管理するために使用できるいくつかのツールについて説明します。

source: Tools to manage versions for your Python package
es: Herramientas para gestionar versiones de su paquete de Python
ja: Pythonパッケージのバージョンを管理するツール

source: There are a handful of tools that are widely used in the scientific ecosystem that you can use to manage your package versions. Some of these tools are built into or work with your chosen [packaging build tools that discussed in this chapter.](python-package-build-tools)
es: Hay un puñado de herramientas que se utilizan ampliamente en el ecosistema científico que puede utilizar para gestionar las versiones de su paquete. Algunas de estas herramientas están integradas o funcionan con las [herramientas de construcción de paquetes que elija que se discuten en este capítulo.](python-package-build-tools)
ja: パッケージのバージョンを管理するために使用できる、科学的なエコシステムで広く使われているツールがいくつかあります。 これらのツールのいくつかは、あなたが選択した [この章で議論するパッケージングビルドツール](python-package-build-tools) に組み込まれているか、それらと連携しています。

source: Below, we provide an overview of these tools.
es: A continuación, proporcionamos una descripción general de estas herramientas.
ja: 以下に、これらのツールの概要を示します。

source: There are three general groups of tools that you can use to manage package versions:
es: Hay tres grupos generales de herramientas que puede utilizar para gestionar las versiones de los paquetes:
ja: パッケージのバージョンを管理するために使用できるツールには、一般的に3つのグループがあります:

source: **semantic release tools:** These tools will automagically determine what type of version bump to use using the text in your commit messages. Below we discuss [Python Semantic Release](https://python-semantic-release.readthedocs.io/en/latest/) as a Python tool that implements a semantic versioning approach.
es: **herramientas de versionado semántico:** Estas herramientas determinarán automáticamente qué tipo de aumento de versión usar utilizando el texto en los mensajes de confirmación o commits. A continuación, discutimos [Python Semantic Release](https://python-semantic-release.readthedocs.io/en/latest/) como una herramienta de Python que implementa un enfoque de versionado semántico.
ja: **セマンティックリリースツール:** これらのツールは、コミットメッセージのテキストから、使用するバージョンバンプのタイプを自動的に判断します。 以下では、セマンティックバージョニングアプローチを実装したPythonツールとして、 [Python Semantic Release](https://python-semantic-release.readthedocs.io/en/latest/) を取り上げます。

source: **Manual incremental bump tools:** Tools like [Hatch](https://hatch.pypa.io/latest/version/) offer version bumping within your package. Normally this is implemented at the command link for instance `hatch version major` would bump your project from 0.x to 1.0.
es: **Herramientas de aumento incremental manual:** Herramientas como [Hatch](https://hatch.pypa.io/latest/version/) ofrecen el aumento de versión dentro de su paquete. Normalmente, esto se ejecuta en la línea de comandos, por ejemplo, `hatch version major` aumentaría su proyecto de 0.x a 1.0.
ja: **手動インクリメンタルバンプツール:** [Hatch](https://hatch.pypa.io/latest/version/)のようなツールは、パッケージ内でのバージョンバンプを提供します。通常、これはコマンドリンクで実装されます。例えば、 `hatch version major` はプロジェクトを0.xから1.0にします。

source: **Version Control System tools:** Finally there are tools that rely on your version control system to track versions. These tools often are plugins to your package build tool (ex: setuptools build or hatchling). We discuss this option below assuming that you are using **.git tags** and **GitHub** to manage your package repository.
es: **Herramientas del sistema de control de versiones:** Por último, hay herramientas que dependen de su sistema de control de versiones para seguir las versiones. Estas herramientas a menudo son complementos de su herramienta de construcción de paquetes (por ejemplo, construcción de setuptools o hatchling). Discutimos esta opción a continuación asumiendo que está utilizando **etiquetas .git** y **GitHub** para gestionar el repositorio de su paquete.
ja: **バージョン管理システムツール:** 最後に、バージョンを追跡するためにバージョン管理システムに依存するツールがある。 これらのツールは、パッケージビルドツールのプラグインであることが多いです (例：setuptools build または hatchling)。 以下では、パッケージリポジトリの管理に **.git tags** と **GitHub** を使用していることを前提に、このオプションについて説明します。

source: Semantic release, vs version control based vs manual version bumping
es: Publicación semántica, vs. basada en control de versiones vs. aumento manual de versiones
ja: セマンティックリリース、バージョン管理ベースと手動バージョンバンプの比較

source: Builds your package and updates the version following the new tag
es: Construye su paquete y actualiza la versión siguiendo la nueva etiqueta
ja: パッケージをビルドし、新しいタグに従ってバージョンを更新します。

source: Tests the build and publishes to test PyPI
es: Prueba la compilación y publica en test PyPI
ja: ビルドをテストし、テスト用PyPIに公開します。

source: Publishes the package to PyPI
es: Publica el paquete en PyPI
ja: パッケージをPyPIに公開します

source: Using semantic versioning, there are three main "levels" of versions that you might consider:
es: Usando el versionado semántico, hay tres "niveles" principales de versiones que podría considerar:
ja: セマンティックバージョニングを使用する場合、3つの主な "レベル" が考えられます:

source: Major, minor and patch. These are described in more detail below.
es: Mayor, menor y parche (del inglés major, minor y patch). Estos se describen con más detalle a continuación.
ja: メジャー、マイナー、パッチ。 これらの詳細については後述します。

source: Tools for bumping Python package versions
es: Herramientas para aumentar las versiones de los paquetes de Python
ja: Pythonパッケージのバージョンを上げるツール

source: In this section we discuss the following tools for managing your Python package's version:
es: En esta sección discutimos las siguientes herramientas para gestionar la versión de su paquete de Python:
ja: このセクションでは、Pythonパッケージのバージョンを管理するための以下のツールについて説明します:

source: hatch_vcs plugin for hatchling
es: plugin hatch_vcs para hatchling
ja: hatchling 用 hatch_vcs プラグイン

source: Tool 1: Hatch and other build tools that offer incremental versioning
es: Heramienta 1: Hatch y otras herramientas de construcción que ofrecen versionado incremental
ja: ツール1: インクリメンタルバージョニングを提供するHatchやその他のビルドツール

source: Many of the modern build tool front end tools offer version support that follow semantic versioning rules. These tools are different from Python Semantic Version in that they do not require specific commit messages to implement version. Rather, they allow you to update the version at the command line using commands such as:
es: Muchas de las herramientas de construcción modernas ofrecen soporte de versión que siguen las reglas de versionado semántico. Estas herramientas son diferentes de Python Semantic Version en que no requieren mensajes de confirmación específicos para implementar la versión. Más bien, le permiten actualizar la versión en la línea de comandos usando comandos como:
ja: 最近のビルドツールのフロントエンドツールの多くは、セマンティックバージョン管理のルールに従ったバージョンサポートを提供しています。 これらのツールは Python Semantic Version とは異なり、バージョンを実装するために特定のコミットメッセージを必要としません。 そうではなく、コマンドラインで次のようなコマンドを使ってバージョンを更新することができます:

source: [Hatch](https://hatch.pypa.io/latest/version/), for instance offers `hatch version minor` which will modify the version of your package incrementally. With **Hatch** the version value will be found in your `pyproject.toml` file. <!-- TODO double check this -->
es: [Hatch](https://hatch.pypa.io/latest/version/), por ejemplo, ofrece `hatch version minor` que modificará la versión de su paquete de forma incremental. Con **Hatch**, el valor de la versión se encontrará en su archivo `pyproject.toml`. <!-- TODO double check this -->
ja: 例えば、[Hatch](https://hatch.pypa.io/latest/version/) は、パッケージのバージョンをインクリメンタルに変更する `hatch version minor` を提供しています。 **Hatch** の場合、バージョン値は`pyproject.toml`ファイルにあります。 <!-- TODO double check this -->

source: Hatch (or other tools like PDM) Pros
es: Beneficios de Hatch (u otras herramientas como PDM)
ja: Hatch（またはPDMのような他のツール）の長所

source: Easy to use version updates locally using a single tool!
es: Fácil de usar actualizaciones de versión localmente usando una sola herramienta!
ja: 1つのツールを使ってローカルで簡単にバージョン更新ができます！

source: Hatch (or other tools like PDM) Cons
es: Complicaciones con Hatch (u otras herramientas como PDM)
ja: Hatch（またはPDMのような他のツール）の短所

source: There will be some setup involved to ensure package version is updated throughout your package
es: Habrá alguna configuración involucrada para asegurarse de que la versión del paquete se actualice en todo su paquete
ja: パッケージのバージョンがパッケージ全体で更新されるようにするには、いくつかの設定が必要です。

source: Tool 2: Hatch_vcs & hatchling build back-end
es: Heramienta 2: Hatch_vcs & hatchling build backend
ja: ツール 2: Hatch_vcs & hatchling ビルドバックエンド

source: [hatch_vcs](https://github.com/ofek/hatch-vcs) is a versioning tool that allows you to manage package versions using **git tags**. Hatch_vcs creates a **\_version.py** file in your package ecosystem that keeps track of the package's current version.
es: [hatch_vcs](https://github.com/ofek/hatch-vcs) es una herramienta de versionado que le permite gestionar las versiones de los paquetes utilizando **etiquetas git**. Hatch_vcs crea un archivo **\_version.py** en su ecosistema de paquetes que realiza un seguimiento de la versión actual del paquete.
ja: [hatch_vcs](https://github.com/ofek/hatch-vcs)は、 **git tags** を使ってパッケージのバージョンを管理できるバージョン管理ツールです。Hatch_vcs はパッケージの現在のバージョンを追跡する **_version.py** ファイルをパッケージのエコシステムに作成します。

source: Hatch keeps track of your package's version in a `_version.py` file. Storing the version in a single file managed by Hatch provides your package with a "single source of truth" value for the version number. This in turn eliminates potential error associated with manually updating your package's version.
es: Hatch realiza un seguimiento de la versión de su paquete en un archivo `_version.py`. Almacenar la versión en un solo archivo gestionado por Hatch proporciona a su paquete un valor de "única fuente de verdad" para el número de versión. Esto, a su vez, elimina el error potencial asociado con la actualización manual de la versión de su paquete.
ja: Hatch はパッケージのバージョンを `_version.py` ファイルに記録しています。 Hatchが管理する単一のファイルにバージョンを保存することで、パッケージにバージョン番号の "単一の真のソース" 値を提供します。 これにより、パッケージのバージョンを手動で更新することに伴う潜在的なエラーを排除することができます。

source: Thus, when you create a new tag or a new release with a tag and build your package, Hatch will access the new tag value and use it to update your package version.
es: Así, cuando cree una nueva etiqueta o una nueva versión con una etiqueta y construya su paquete, Hatch accederá al nuevo valor de la etiqueta y lo utilizará para actualizar la versión de su paquete.
ja: このように、新しいタグを作成したり、タグ付きの新しいリリースを作成してパッケージをビルドすると、Hatchは新しいタグの値にアクセスし、それを使ってパッケージのバージョンを更新します。

source: To use **hatch_vcs** you will need to use the **hatchling** build back end.
es: Para usar **hatch_vcs** necesitará usar el backend de construcción **hatchling**.
ja: **hatch_vcs** を使用するには、 **hatchling** ビルドバックエンドを使用する必要があります。

source: Hatchling can also be used with any of the modern build tools including **Flit** and **PDM** if you prefer those for your day to day workflow.
es: Hatchling también se puede utilizar con cualquiera de las herramientas de construcción modernas, incluidas **Flit** y **PDM**, si prefiere esas para su flujo de trabajo diario.
ja: 日々のワークフローにそれらを好むなら、Hatchlingは **Flit** や **PDM** を含む最新のビルドツールでも使用できます。

source: Hatch example setup in your pyproject.toml
es: Ejecución de ejemplo de Hatch en su pyproject.toml
ja: pyproject.tomlでのHatchのセットアップ例

source: **Hatch_vcs** supports a fully automated package release and build, and push to PyPI workflow on GitHub.
es: **Hatch_vcs** admite un flujo de trabajo de publicación y construcción de paquetes totalmente automatizado, y envío a PyPI en GitHub.
ja: **Hatch_vcs** は完全に自動化されたパッケージのリリースとビルド、GitHub上のPyPIへのプッシュのワークフローをサポートしています。

source: If you use **setuptools_scm**, then you might find **hatch_vcs** and **hatchling** to be the modern equivalent to your current setuptools / build workflow.
es: Si utiliza **setuptools_scm**, entonces podría encontrar que **hatch_vcs** y **hatchling** son el equivalente moderno a su flujo de trabajo actual de setuptools / buils.
ja: もしあなたが **setuptools_scm** を使っているのであれば、 **hatch_vcs** と **hatchling** があなたの現在のsetuptools/ビルドワークフローと現代的に同等であることがわかるかもしれません。

source: Hatch supports modern Python packaging standards
es: Hatch admite estándares modernos de empaquetado de Python
ja: Hatchは最新のPythonパッケージング標準をサポート

source: It creates a single-source file that contains your package version.
es: Permite crear un archivo de única fuente de verdad que contiene la versión de su paquete.
ja: これは、あなたのパッケージバージョンを含む単一ソースファイルを作成します。

source: You never manually update the package version
es: Nunca actualizará manualmente la versión del paquete
ja: パッケージのバージョンを手動で更新することはありません

source: You can automate writing the version anywhere in your package including your documentation!
es: Puede automatizar la escritura de la versión en cualquier lugar de su paquete, incluida su documentación.
ja: ドキュメンテーションを含め、パッケージのどこにでもバージョンを書くことを自動化できます！

source: It supports a purely GitHub based release workflow. This simplifies maintenance workflows.
es: Admite un flujo de trabajo de publicación basado puramente en GitHub. Esto simplifica los flujos de trabajo de mantenimiento.
ja: 純粋にGitHubベースのリリースワークフローをサポートしています。 これにより、メンテナンスのワークフローが簡素化されます。

source: Version number is updated in your package via a hidden `_version.py` file. There is no manual configuration updates required.
es: El número de versión se actualiza en su paquete a través de un archivo oculto `_version.py`. No se requieren actualizaciones manuales de configuración.
ja: バージョン番号は隠された `_version.py` ファイルを通してパッケージ内で更新されます。 手動で設定を更新する必要はありません。

source: While we like detailed commit messages (See Python Semantic Version below), we know that sometimes when maintaining a package specific guidelines around commit messages can be hard to apply and manage.
es: Si bien nos gustan los mensajes de commit detallados (consulte Python Semantic Version a continuación), sabemos que a veces, al mantener un paquete, las pautas específicas sobre los mensajes de commit pueden ser difíciles de aplicar y gestionar.
ja: 私たちは詳細なコミットメッセージを好みますが(下記のPython Semantic Versionを参照してください)、パッケージを管理する際にコミットメッセージに関する特定のガイドラインを適用したり管理したりするのが難しい場合があることも知っています。

source: In a CI workflow you will end up manually entering or creating the version number via a tag on GitHub. But you could locally develop a build to "bump" tag versions
es: En un flujo de trabajo de CI, terminará ingresando o creando manualmente el número de versión a través de una etiqueta en GitHub. Pero podría desarrollar localmente una compilación para "aumentar" las versiones de las etiquetas
ja: CIワークフローでは、GitHubのタグを使ってバージョン番号を手動で入力したり作成したりすることになります。 しかし、タグのバージョンを "bump" するビルドをローカルで開発することもできます。

source: Tool 3: setuptools-scm versioning using git tags
es: Herramienta 3: versionado de setuptools-scm usando etiquetas git
ja: ツール3: gitタグを使ったsetuptools-scmのバージョン管理

source: [`Setuptools_scm`](https://github.com/pypa/setuptools_scm/) is an extension that you can use with setuptools to manage package versions. **Setuptools_scm** operates the same way that **hatch_vcs** (discussed above) does. It stores a version in a **\_version.py** file and relies on (**git**) tags to determine the package's current version.
es: [`Setuptools_scm`](https://github.com/pypa/setuptools_scm/) es una extensión que puede usar con setuptools para gestionar las versiones de los paquetes. **Setuptools_scm** opera de la misma manera que **hatch_vcs** (discutido anteriormente). Almacena una versión en un archivo **\_version.py** y se basa en las etiquetas (**git**) para determinar la versión actual del paquete.
ja: [`Setuptools_scm`](https://github.com/pypa/setuptools_scm/) は、パッケージのバージョンを管理するために setuptools と一緒に使うことができる拡張機能です。 **Setuptools_scm**は、**hatch_vcs**（前述）と同じように動作します。 バージョンを **_version.py** ファイルに保存し、パッケージの現在のバージョンを決定するために (**git**) タグに依存します。

source: If you are using **setuptools** as your primary build tool, then `*setuptools-scm` is a good choice as:
es: Si está utilizando **setuptools** como su herramienta de construcción principal, entonces `*setuptools-scm` es una buena elección ya que:
ja: **setuptools** を主なビルドツールとして使っているのであれば、 `*setuptools-scm` は良い選択です:

source: **setuptools** is still the most commonly used Python packaging build tool
es: **setuptools** sigue siendo la herramienta de construcción de paquetes de Python más comúnmente utilizada
ja: **setuptools** は今でも最もよく使われているPythonパッケージング構築ツールです。

source: In a CI workflow you will end up manually entering or creating the version number via a tag on GitHub.
es: En un flujo de trabajo de CI, terminará ingresando o creando manualmente el número de versión a través de una etiqueta en GitHub.
ja: CIワークフローでは、GitHubのタグを使って手動でバージョン番号を入力したり作成したりすることになります。

source: Not well documented
es: No está bien documentado
ja: 文書化されていません

source: Because setuptools will always have to support backwards compatibility it will always be slower in adopting modern Python packaging conventions.
es: Dado que setuptools siempre tendrá que admitir la compatibilidad con versiones anteriores, siempre será más lento en adoptar las convenciones modernas de empaquetado de Python.
ja: setuptools は常に後方互換性をサポートしなければならないので、最新の Python パッケージング規約を採用するのは常に遅くなります。

source: As such you might consider using a more modern tool such as **hatch_vcs** and **hatchling** to build your package and manage package versions.
es: Por lo tanto, podría considerar usar una herramienta más moderna como **hatch_vcs** y **hatchling** para construir su paquete y gestionar las versiones del paquete.
ja: そのため、パッケージのビルドやパッケージのバージョン管理には、 **hatch_vcs** や **hatchling** のような、より現代的なツールの使用を検討してください。

source: Tool 4: [Python semantic release](https://python-semantic-release.readthedocs.io/en/latest/)
es: Herramienta 4: [Python semantic release](https://python-semantic-release.readthedocs.io/en/latest/)
ja: ツール4: [Pythonセマンティックリリース](https://python-semantic-release.readthedocs.io/en/latest/)

source: Python semantic release uses a commit message workflow that updates the version of your package based on keywords found in your commit messages. As the name implies, Python Semantic Release follows semver release rules.
es: Python semantic release utiliza un flujo de trabajo de mensajes de commit que actualiza la versión de su paquete basándose en palabras clave encontradas en sus mensajes de commit. Como su nombre lo indica, Python Semantic Release sigue las reglas de lanzamiento de semver.
ja: Python semantic release はコミットメッセージのワークフローを使い、コミットメッセージに含まれるキーワードに基づいてパッケージのバージョンを更新します。 その名の通り、Python Semantic Release は semver release のルールに従います。

source: With Python Semantic Release, versions are triggered using specific language found in a git commit message.
es: Con Python Semantic Release, las versiones se activan utilizando un lenguaje específico que se encuentra en un mensaje de commit de git.
ja: Python Semantic Release では、git のコミットメッセージにある特定の言語を使ってバージョンをトリガーします。

source: For example, the words `fix(attribute_warning):` trigger Python Semantic Release to implement a **patch** version bump. For instance if your package was at version 1.1.0 and you made the commit below with the words fix(text-here), Python Semantic Release would bump your package to version 1.1.1.
es: Por ejemplo, las palabras `fix(attribute_warning):` activan Python Semantic Release para implementar un aumento de versión de **patch**. Por ejemplo, si su paquete estaba en la versión 1.1.0 y realizó el commit a continuación con las palabras fix(text-here), Python Semantic Release aumentaría su paquete a la versión 1.1.1.
ja: 例えば、 `fix(attribute_warning):` という言葉は、Python Semantic Releaseが **patch** バージョンバンプを実装する引き金になります。 例えば、あなたのパッケージのバージョンが1.1.0で、fix(text-here) と書かれた以下のコミットをした場合、Python Semantic Release はあなたのパッケージをバージョン1.1.1にします。

source: Similarly a feature (`feat()`) triggers a minor version bump. For example from version 1.1 to version 1.2
es: De manera similar, una característica (`feat()`) activa un aumento de versión menor. Por ejemplo, de la versión 1.1 a la versión 1.2
ja: 同様に、機能（`feat()`）はマイナーバージョンアップの引き金となります。 例えばバージョン1.1からバージョン1.2へ
