Repository: pyOpenSci/python-package-guide
Catalog: locales/*/LC_MESSAGES/package-structure-code.po
Languages: es, ja

source: Flit supports installing your package in editable mode.**
es: Flit admite instalar su paquete en modo editable.
ja: Flitは編集可能モードでのパッケージのインストールをサポートしています。**

source: Flit can be used to build your packages sdist and wheel distributions.
es: Flit se puede usar para construir las distribuciones sdist y wheel de sus paquetes.
ja: Flitはsdistとwheelのディストリビューションパッケージのビルドに使用できます。

source: NOTE: _If you are using the most current version of pip, it supports both a symlink approach `flit install -s` and `python -m pip install -e .`_
es: NOTA: _Si está utilizando la versión más actual de pip, admite tanto un enfoque de enlace simbólico `flit install -s`
ja: 注: _最新バージョンのpipを使用している場合、シンボリックリンクを使った `flit install -s` と `python -m pip install -e .`_ の両方をサポートしています。

source: Learn more about flit
es: Aprende más sobre flit
ja: flitについてもっと知る

source: [Why use flit?](https://flit.pypa.io/en/stable/rationale.html)
es: [¿Por qué usar flit?](https://flit.pypa.io/en/stable/rationale.html)
ja: [なぜflitを使うのか？](https://flit.pypa.io/en/stable/rationale.html)

source: Why you might not want to use Flit
es: ¿Por qué no querrías usar Flit
ja: Flitを使いたくない理由

source: Because Flit is no frills, it is best for basic, quick builds. If you are a beginner you may want to select Hatch or PDM which will offer you more support in common operations.
es: Debido a que Flit no tiene adornos, es mejor para construcciones básicas y rápidas. Si eres un principiante, puede que quieras seleccionar Hatch o PDM que te ofrecerán más soporte en operaciones comunes.
ja: Flitは飾り気がないので、基本的で素早いビルドに最適です。 初心者の方は、一般的な操作をよりサポートしてくれるHatchやPDMを選ぶとよいでしょう。

source: You may NOT want to use flit if:
es: Quizás NO quieras usar flit si:
ja: 次のような場合は、flitを使用しない方がよいです:

source: You want to setup more advanced version tracking and management (using version control for version bumping)
es: Quieres configurar un seguimiento y gestión de versiones más avanzado (usando control de versiones para incrementar versiones)
ja: より高度なバージョン追跡と管理をセットアップしたい場合 (バージョン管理を使ってバージョンバンプを行う)

source: You want a tool that handles dependency versions (use PDM or Poetry instead)
es: Quieres una herramienta que maneje las versiones de las dependencias (usa PDM o Poetry en su lugar)
ja: 依存性のあるバージョンを処理するツールが必要（代わりにPDMやPoetryを使用する）

source: You have a project that is not pure Python (Use Hatch, PDM or setuptools)
es: Tienes un proyecto que no es Python puro (Usa Hatch, PDM o setuptools)
ja: 純粋なPythonではないプロジェクトを持っている（Hatch、PDM、またはsetuptoolsを使用する）

source: You want environment management (use PDM, Hatch or Poetry)
es: Quieres gestión de entornos (usa PDM, Hatch o Poetry)
ja: 環境を管理したい（PDM、Hatch、またはPoetryを使用する）

source: [**Hatch**](https://hatch.pypa.io/latest/), similar to Poetry and PDM, provides a unified command line interface. To separate Hatch from Poetry and PDM, it also provides an environment manager for testing that will make it easier for you to run tests locally across different versions of Python. It also offers a nox / makefile like feature that allows you to create custom build workflows such as building your documentation locally. This means that you could potentially drop a tool like **Make** or **Nox** from your workflow and use Hatch instead.
es: [**Hatch**](https://hatch.pypa.io/latest/), similar a Poetry y PDM, proporciona una interfaz de línea de comandos unificada. Para contrastar Hatch con Poetry y PDM, este también proporciona un gestor de entornos para tests que le facilitará la ejecución de tests localmente en diferentes versiones de Python. También ofrece una característica similar a nox / makefile que le permite crear flujos de trabajo de construcción personalizados como construir su documentación localmente. Esto significa que potencialmente podría eliminar una herramienta como **Make** o **Nox** de su flujo de trabajo y usar Hatch en su lugar.
ja: [**Hatch**](https://hatch.pypa.io/latest/) は、ポエトリーやPDMと同様、統一されたコマンドラインインターフェイスを提供する。HatchをPoetryやPDMから切り離すために、Pythonの異なるバージョン間でローカルにテストを実行しやすくするテスト用の環境マネージャーも提供しています。 また、nox / makefileのような機能もあり、ドキュメントをローカルでビルドするようなカスタムビルドワークフローを作成することができる。 つまり、ワークフローから **Make** や **Nox** のようなツールを削除して、代わりにHatchを使うことができる可能性があるということだ。

source: Hatch features
es: Características de Hatch
ja: Hatchの特徴

source: Feature, Hatch, Notes
es: Característica, Hatch, Notas
ja: 特徴, Hatch, ノート

source: Hatch is used with the backend Hatchling by default, but allows you to use another backend by switching the declaration in pyproject.toml.
es: Hatch utiliza el backend Hatchling de forma predeterminada, pero le permite usar otro backend cambiando la declaración en pyproject.toml.
ja: HatchはデフォルトでHatchlingバックエンドと一緒に使われますが、pyproject.tomlの宣言を切り替えることで別のバックエンドを使うことができます。

source: Currently you have to add dependencies manually with Hatch. However a feature to support dependencies management may be added in a future release.
es: Actualmente, tiene que agregar dependencias manualmente con Hatch. Sin embargo, una característica para soportar la gestión de dependencias puede ser agregada en una versión futura.
ja: 現在のところ、Hatchを使って手動で依存関係を追加する必要があります。 しかし、依存関係の管理をサポートする機能が将来のリリースで追加されるかもしれません。

source: Hatch supports Python virtual environments. If you wish to use other types of environments such as Conda, you will need to [install a plugin such as hatch-conda for conda support](https://github.com/OldGrumpyViking/hatch-conda).
es: Hatch admite entornos virtuales de Python. Si desea usar otros tipos de entornos como Conda, necesitará [instalar un plugin como hatch-conda para soporte de conda](https://github.com/OldGrumpyViking/hatch-conda).
ja: HatchはPython仮想環境をサポートしています。 Condaのような他の環境を使いたい場合は、 [condaをサポートするhatch-condaのようなプラグインをインストールする](https://github.com/OldGrumpyViking/hatch-conda) 必要があります。

source: Hatch supports publishing to both test PyPI and PyPI
es: Hatch admite la publicación tanto en test PyPI como en PyPI
ja: Hatch は test PyPI と PyPI の両方への公開をサポートしています

source: Hatch offers `hatch_vcs` which is a plugin that uses setuptools_scm to support versioning using git tags. The workflow with `hatch_vcs` is the same as that with `setuptools_scm`.
es: Hatch ofrece `hatch_vcs` que es un plugin que utiliza setuptools_scm para soportar el versionado utilizando etiquetas de git. El flujo de trabajo con `hatch_vcs` es el mismo que con `setuptools_scm`.
ja: Hatch が提供する `hatch_vcs` は setuptools_scm を使って git タグを使ったバージョン管理をサポートするプラグインです。 hatch_vcs` を使ったワークフローは `setuptools_scm` を使ったワークフローと同じです。

source: Hatch supports you bumping the version of your package using standard semantic version terms patch; minor; major
es: Hatch le permite incrementar la versión de su paquete utilizando términos de versión semántica estándar patch; minor; major
ja: Hatchは、標準的なセマンティックバージョニングである patch; minor; major を使って、パッケージのバージョンをバンプすることをサポートしています。

source: Hatch supports current packaging standards for adding metadata to the **pyproject.toml** file.
es: Hatch admite los estándares de empaquetado actuales para agregar metadatos al archivo **pyproject.toml**.
ja: Hatchは、 **pyproject.toml** ファイルにメタデータを追加する現在のパッケージング標準をサポートしています。

source: Hatch will install your package into any of its environments by default in editable mode. You can install your package in editable mode manually using `python -m pip install -e .` Hatch mentions [editable installs](https://hatch.pypa.io/latest/config/build/#dev-mode) but refers to pip in its documentation.
es: Hatch instalará su paquete en cualquiera de sus entornos de forma predeterminada en modo editable. Puede instalar su paquete en modo editable manualmente utilizando `python -m pip install -e .` Hatch menciona [instalaciones en modo editable](https://hatch.pypa.io/latest/config/build/#dev-mode) pero se refiere a pip en su documentación.
ja: Hatchはデフォルトで編集可能なモードで、あなたのパッケージをどの環境にもインストールします。 `python -m pip install -e .` を使って、編集可能モードでパッケージを手動でインストールできます。Hatchは [editable installs](https://hatch.pypa.io/latest/config/build/#dev-mode) に言及していますが、ドキュメントではpipを参照しています。

source: Hatch will build the sdist and wheel distributions
es: Hatch construirá las distribuciones sdist y wheel
ja: Hatchはsdistとホイールのディストリビューションを構築します

source: ✨Matrix environment creation to support testing across Python versions✨
es: ✨Creación de entorno de matriz para soportar testing en diferentes versiones de Python✨
ja: ✨Pythonのバージョンをまたいだテストをサポートするためのマトリックス環境の構築✨

source: The matrix environment creation is a feature that is unique to Hatch in the packaging ecosystem. This feature is useful if you wish to test your package locally across Python versions (instead of using a tool such as tox).
es: La creación de entorno de matriz es una característica única de Hatch en el ecosistema de empaquetado. Esta característica es útil si desea probar su paquete localmente en diferentes versiones de Python (en lugar de usar una herramienta como tox).
ja: マトリックス環境の作成は、パッケージングエコシステムにおける Hatch 独自の機能です。 この機能は、（tox のようなツールを使う代わりに）Python のバージョンにまたがってパッケージをローカルでテストしたい場合に便利です。

source: ✨[Nox / MAKEFILE like functionality](https://hatch.pypa.io/latest/environment/#selection)✨
es: ✨[Funcionalidad similar a Nox / MAKEFILE](https://hatch.pypa.io/latest/environment/#selection)✨
ja: ✨[Nox / MAKEFILEのような機能性](https://hatch.pypa.io/latest/environment/#selection)✨

source: This feature is also unique to Hatch. This functionality allows you to create workflows in the **pyproject.toml** configuration to do things like serve docs locally and clean your package build directory. This means you may have one less tool in your build workflow.
es: Esta característica también es única de Hatch. Esta funcionalidad le permite crear flujos de trabajo en la configuración **pyproject.toml** para hacer cosas como servir documentos localmente y limpiar el directorio de construcción de su paquete. Esto significa que puede tener una herramienta menos en su flujo de trabajo de construcción.
ja: これもHatchならではの特徴だ。この機能により、**pyproject.toml** 設定にワークフローを作成し、ドキュメントをローカルに提供したり、パッケージのビルドディレクトリをクリーニングしたりすることができます。これは、ビルドワークフローのツールが1つ減ることを意味します。

source: ✨A flexible build backend: **hatchling**✨
es: ✨Un backend de construcción flexible: **hatchling**✨
ja: ✨柔軟なビルドバックエンド: **hatchling**✨

source: **The hatchling build backend offered by the maintainer of Hatch allows developers to easily build plugins to support custom build steps when packaging.
es: **El backend de construcción hatchling ofrecido por el mantenedor de Hatch permite a los desarrolladores construir fácilmente plugins para soportar pasos de construcción personalizados al empaquetar.
ja: **Hatchのメンテナが提供するhatchlingビルドバックエンドは、開発者がパッケージング時にカスタムビルドステップをサポートするプラグインを簡単にビルドすることを可能にします。

source: _There is some argument about this approach placing a burden on maintainers to create a custom build system. But others appreciate the flexibility. The Hatch build hook approach is also comparable with the features offered by PDM._
es: _Hay algunos argumentos sobre este enfoque que coloca una carga en los mantenedores para crear un sistema de construcción personalizado. Pero otros aprecian la flexibilidad. El enfoque de hooks de construcción de Hatch también es comparable con las características ofrecidas por PDM._
ja: _このアプローチは、メンテナにカスタムビルドシステムを作る負担を強いるという議論があリマス。 しかし、柔軟性を高く評価する人もいます。 ハッチのビルドフックアプローチは、PDMが提供する機能にも匹敵します。_

source: Why you might not want to use Hatch
es: ¿Por qué no querría usar Hatch?
ja: ハッチを使いたくない理由

source: There are a few features that hatch is missing that may be important for some. These include:
es: Hay algunas características que Hatch no tiene y que pueden ser importantes para algunos. Estas incluyen:
ja: hatchには、一部の人にとって重要かもしれないいくつかの機能が欠けています。 それは以下のようなものです:

source: Hatch doesn't support adding dependencies. You will have to add them manually.
es: Hatch no admite agregar dependencias. Tendrá que agregarlas manualmente.
ja: Hatchは依存関係の追加をサポートしていません。 手動で追加する必要があります。

source: Hatch won't by default recognize Conda environments without a plugin.
es: Hatch no reconocerá por defecto los entornos de Conda sin un plugin.
ja: HatchはプラグインなしではデフォルトでConda環境を認識しません。

source: Similar to PDM, Hatch's documentation can difficult to work through, particularly if you are just getting started with creating a package.
es: Al igual que PDM, la documentación de Hatch puede ser difícil de utilizar, especialmente si eres nuevo en la construcción de paquete.
ja: PDMと同様、Hatchのドキュメントを読みこなすのは難しいです。 特にパッケージの作成を始めたばかりであればなおさらです。

source: Hatch, similar to PDM and Flit currently only has one maintainer.
es: Hatch, al igual que PDM y Flit, actualmente solo tiene un mantenedor.
ja: Hatchは、PDMやFlitと同様、現在1人のメンテナしかいません。

source: [Poetry is a full-featured build tool.](https://python-poetry.org/) It is also the second most popular front-end packaging tool (based upon the PyPA survey). Poetry is user-friendly and has clean and easy-to-read documentation.
es: [Poetry es una herramienta de construcción completa.](https://python-poetry.org/) También es la segunda herramienta de empaquetado de frontend más popular (según la encuesta de PyPA). Poetry es fácil de usar y tiene documentación limpia y fácil de leer.
ja: [Poetry はフル機能のビルドツールです。](https://python-poetry.org/) また、（PyPAの調査に基づく）2番目に人気のあるフロントエンドパッケージングツールでもあります。 Poetry はユーザーフレンドリーで、きれいで読みやすいドキュメントを持っています。

source: While some have used Poetry for Python builds with C/C++ extensions, this support is currently undocumented. Thus, we don't recommend using Poetry for more complex builds.
es: Aunque algunos han usado Poetry para construcciones de Python con extensiones C/C++, este soporte no está documentado actualmente. Por lo tanto, no recomendamos usar Poetry para construcciones más complejas.
ja: C/C++ 拡張を含む Python のビルドに Poetry を使っている人もいますが、このサポートは現在のところ文書化されていません。 したがって、より複雑なビルドに Poetry を使うことはお勧めしません。

source: Poetry features
es: Características de Poetry
ja: Poetryの特徴

source: Feature, Poetry, Notes
es: Característica, Poetry, Notas
ja: 特徴, Poetry, ノート

source: Poetry helps you add dependencies to your `pyproject.toml` metadata. _NOTE: currently Poetry adds dependencies using an approach that is slightly out of alignment with current Python peps - however there is a plan to fix this in an upcoming release._ Poetry also allows you to organize dependencies in groups such as documentation, packaging and tests.
es: Poetry le ayuda a agregar dependencias a sus metadatos `pyproject.toml`. _NOTA: actualmente Poetry agrega dependencias utilizando un enfoque que está ligeramente desalineado con los PEPs de Python actuales - sin embargo, hay un plan para solucionar esto en una próxima versión._ Poetry también le permite organizar dependencias en grupos como documentación, empaquetado y tests.
ja: Poetry は `pyproject.toml` メタデータに依存関係を追加するのに役立ちます。 _NOTE: 現在のところ、Poetry は現在の Python peps とは少しずれたアプローチで依存関係を追加しています - しかし、今後のリリースでこれを修正する予定です。 _ Poetryでは、ドキュメント、パッケージング、テストなどのグループに依存関係を整理することもできます。

source: Dependency specification
es: Especificación de dependencias
ja: 依存仕様

source: Poetry allows you to be specific about version of dependencies that you add to your package's pyproject.toml file. However, it's default upper bound approach can be problematic for some packages (We suggest you override the default setting when adding dependencies). Read below for more.
es: Poetry le permite ser específico sobre la versión de las dependencias que agrega al archivo pyproject.toml de su paquete. Sin embargo, su enfoque de límite superior predeterminado puede ser problemático para algunos paquetes (le sugerimos que anule la configuración predeterminada al agregar dependencias). Lea a continuación para más información.
ja: Poetryはパッケージのpyproject.tomlファイルに追加する依存関係のバージョンを指定することができます。 しかし、デフォルトの上限アプローチはパッケージによっては問題があります(依存関係を追加するときはデフォルトの設定を上書きすることをお勧めします)。 詳しくは以下をお読みください。

source: Poetry allows you to either use its built in environment or you can select the environment type that you want to use for managing your package. [Read more about its built in environment management options](https://python-poetry.org/docs/basic-usage/#using-your-virtual-environment).
es: Poetry le permite usar su entorno integrado o puede seleccionar el tipo de entorno que desea usar para administrar su paquete. [Lea más sobre sus opciones de gestión de entornos integrados](https://python-poetry.org/docs/basic-usage/#using-your-virtual-environment).
ja: Poetryでは、ビルトイン環境を使用するか、パッケージ管理に使用する環境タイプを選択することができます。 [内蔵された環境管理オプションについての詳細はこちら](https://python-poetry.org/docs/basic-usage/#using-your-virtual-environment) 。

source: Lock files
es: Archivos de bloqueo
ja: ファイルのロック

source: Poetry creates a **poetry.lock** file that you can use if you need a lock file for your build.
es: Poetry crea un archivo **poetry.lock** que puede usar si necesita un archivo de bloqueo para su construcción.
ja: Poetryは **poetry.lock** ファイルを作成するので、ビルドにロックファイルが必要な場合に使用します。

source: Poetry supports publishing to both test PyPI and PyPI
es: Poetry admite la publicación tanto en PyPI Test como en PyPI
ja: Poetry は test PyPI と PyPI の両方への公開をサポートしています

source: The plugin [Poetry dynamic versioning](https://github.com/mtkennerly/poetry-dynamic-versioning) supports versioning using git tags with Poetry.
es: El plugin [Poetry dynamic versioning](https://github.com/mtkennerly/poetry-dynamic-versioning) admite versionado utilizando etiquetas de git con Poetry.
ja: [Poetry dynamic versioning](https://github.com/mtkennerly/poetry-dynamic-versioning) プラグインは、Poetryでgitタグを使ったバージョン管理をサポートします。

source: Poetry supports you bumping the version of your package using standard semantic version terms patch; minor; major
es: Poetry le permite incrementar la versión de su paquete utilizando términos de versión semántica estándar patch; minor; major
ja: Poetryでは、標準的なセマンティックバージョン用語である patch; minor; major を使ってパッケージのバージョンを上げることができます。

source: Poetry does not quite support current packaging standards for adding metadata to the **pyproject.toml** file but plans to fix this in an upcoming release.
es: Poetry no admite completamente los estándares de empaquetado actuales para agregar metadatos al archivo **pyproject.toml** pero planea solucionar esto en una próxima versión.
ja: Poetryは **pyproject.toml** ファイルにメタデータを追加する現在のパッケージング標準を完全にサポートしているわけではありませんが、今後のリリースでこれを修正する予定です。

source: Poetry supports installing your package in editable mode using `--editable`
es: Poetry admite instalar su paquete en modo editable usando `--editable`
ja: Poetry は `--editable` を使った編集可能モードでのパッケージのインストールをサポートしています。

source: Poetry will build your sdist and wheel distributions using `poetry build`
es: Poetry construirá sus distribuciones sdist y wheel usando `poetry build`
ja: Poetry は `poetry build` を使って sdist と wheel ディストリビューションをビルドします。

source: Challenges with Poetry
es: Desafíos con Poetry
ja: Poetryの課題

source: Some challenges of Poetry include:
es: Algunos desafíos de Poetry incluyen:
ja: Poetryの課題には次のようなものがある:

source: Poetry, by default, pins dependencies using an "upper bound" limit specified with the `^` symbol by default. However, this behavior can be over-written by specifying the dependency when you use `Poetry add` as follows: `poetry add "requests>=2.1"` See breakout below for more discussion on issues surrounding upper-bounds pinning.
es: Poetry, por defecto, fija las dependencias utilizando un valor de "límite superior" de versión especificado con el símbolo `^` por defecto. Sin embargo, este comportamiento puede ser eliminado especificando la dependencia cuando use `Poetry add` de la siguiente manera: `poetry add "requests>=2.1"` Vea el desglose a continuación para más discusión sobre los problemas que rodean el fijado de límites superiores.
ja: Poetryは、デフォルトでは、`^`シンボルで指定された "上限" 制限を使用して依存関係をピンします。 しかし、この動作は `Poetry add` を使うときに依存関係を以下のように指定することで上書きすることができます: `poetry add "requests>=2.1"` アッパーバウンドピニングをめぐる問題については、以下のブレイクアウトを参照のしてください。

source: _Minor Challenge:_ The way Poetry currently adds metadata to your pyproject.toml file does not follow current Python standards. However, this is going to be addressed with Poetry release version 2.0.
es: _Desafío menor:_ La forma en que Poetry actualmente agrega metadatos a su archivo pyproject.toml no sigue los estándares actuales de Python. Sin embargo, esto se abordará con la versión 2.0 de Poetry.
ja: _マイナーチェンジ:_ Poetryが現在pyproject.tomlファイルにメタデータを追加する方法は、現在のPythonの標準に従っていません。 しかし、これは Poetry リリースバージョン 2.0 で対処される予定です。

source: Poetry is an excellent tool. Use caution when using it to pin dependencies as Poetry's approach to pinning can be problematic for many builds. If you use Poetry, we strongly suggest that you override the default upper bound dependency option.
es: Poetry es una excelente herramienta. Tome precaución al usarla para fijar dependencias ya que el enfoque de Poetry para fijar puede ser problemático para muchas construcciones. Si usa Poetry, le sugerimos encarecidamente que anule la opción de dependencia de límite superior predeterminada.
ja: Poetryは優れたツールです。 依存関係を固定するために Poetry を使う場合は注意してください。Poetry の固定方法は、多くのビルドで問題になる可能性があります。 Poetry を使用する場合は、デフォルトの上限依存性オプションをオーバーライドすることを強く推奨します。

source: Challenges with Poetry dependency pinning
es: Desafíos con el fijado de dependencias de Poetry
ja: Poetry依存のピン留めの課題

source: By default, Poetry pins dependencies using `^` by default. This `^` symbol means that there is an "upper bound" to the dependency. Thus poetry won't bump a dependency version to a new major version. Thus, if your package uses a dependency that is at version 1.2.3, Poetry will never bump the dependency to 2.0 even if there is a new major version of the package. Poetry will instead bump up to 1.9.x.
es: Por defecto, Poetry fija las dependencias utilizando `^` por defecto. Este símbolo `^` significa que hay un "límite superior" en la dependencia. Por lo tanto, Poetry no incrementará la versión de una dependencia a una nueva versión mayor. Por lo tanto, si su paquete usa una dependencia que está en la versión 1.2.3, Poetry nunca incrementará la dependencia a 2.0 incluso si hay una nueva versión mayor del paquete. En su lugar, Poetry incrementará hasta 1.9.x.
ja: デフォルトでは、Poetry は `^` を使って依存関係をピン留めします。 このシンボル `^` は依存関係に "上限" があることを意味します。 従って、poetryは依存バージョンを新しいメジャーバージョンにバンプすることはありません。 したがって、あなたのパッケージがバージョン1.2.3の依存関係を使用している場合、Poetryは、パッケージの新しいメジャーバージョンがあっても、依存関係を2.0にバンプすることはありません。 Poetryは代わりに1.9.xにアップグレードします。

source: Poetry does this because it adheres to strict semantic versioning which states that a major version bump (from 1.0 to 2.0 for example) means there are breaking changes in the tool. However, not all tools follow strict semantic versioning. [This approach has been found to be problematic by many of our core scientific packages.](https://iscinumpy.dev/post/bound-version-constraints/)
es: Poetry hace esto porque se adhiere a la versión semántica estricta que establece que un incremento de versión mayor (de 1.0 a 2.0 por ejemplo) significa que hay cambios de ruptura en la herramienta. Sin embargo, no todas las herramientas siguen la versión semántica estricta. [Este enfoque se ha encontrado problemático por muchos de nuestros paquetes científicos principales.](https://iscinumpy.dev/post/bound-version-constraints/)
ja: Poetryは、メジャーバージョンアップ（例えば1.0から2.0へ）は、ツールに破壊的な変更があることを意味するという、厳密なセマンティックバージョニングを遵守しているからです。 しかし、すべてのツールが厳密なセマンティックバージョニングに従っているわけではありません。 [このアプローチは、私たちのコアとなる科学パッケージの多くによって問題があることが判明しています](https://iscinumpy.dev/post/bound-version-constraints/)

source: This approach also won't support others ways of versioning tools, for instance, some tools use [calver](https://calver.org/) which creates new versions based on the date.
es: Este enfoque tampoco soportará otras formas de versionar herramientas, por ejemplo, algunas herramientas usan [calver](https://calver.org/) que crea nuevas versiones basadas en la fecha.
ja: 例えば、 [calver](https://calver.org/) を使って、日付に基づいて新しいバージョンを作成するツールもある。
