Repository: pyOpenSci/python-package-guide
Catalog: locales/*/LC_MESSAGES/package-structure-code.po
Languages: es, ja

source: The Python developers survey results (n=>8,000 PyPI users) show setuptools and poetry as the most commonly used Python packaging tools. The core tools that we've seen being used in the scientific community are included here. [You can view the full survey results by clicking here.](https://drive.google.com/file/d/1U5d5SiXLVkzDpS0i1dJIA4Hu5Qg704T9/view) NOTE: this data represent maintainers across domains and is likely heavily represented by those in web development. So this represents a snapshot across the broader Python ecosystem.
es: Los resultados de la encuesta de desarrolladores de Python (n => 8,000 usuarios de PyPI) muestran setuptools y poetry como las herramientas de empaquetado de Python más utilizadas. Las herramientas centrales que hemos visto que se utilizan en la comunidad científica están incluidas aquí. [Puede ver los resultados completos de la encuesta haciendo clic aquí.](https://drive.google.com/file/d/1U5d5SiXLVkzDpS0i1dJIA4Hu5Qg704T9/view) NOTA: estos datos representan a los mantenedores en todos los dominios y es probable que estén fuertemente representados por aquellos en desarrollo web. Por lo tanto, esto representa una instantánea de todo el ecosistema de Python.
ja: Python developers survey results (n=>8,000 PyPI users)では、最もよく使われているPythonパッケージングツールとしてsetuptoolsとpoetryが挙げられています。 科学コミュニティで使用されているコアツールはここに含まれています。 [ここをクリックすると、調査結果の全文を見ることができます。](https://drive.google.com/file/d/1U5d5SiXLVkzDpS0i1dJIA4Hu5Qg704T9/view) 注意: このデータはドメイン全体のメンテナを表しており、ウェブ開発関係者が多く含まれているようです。 これはより広い Python エコシステム全体のスナップショットを表しています。

source: Chose a build workflow tool
es: Elige una herramienta de flujo de trabajo de construcción
ja: ビルドワークフローツールの選択

source: The tools that we review below include:
es: Las herramientas que revisamos a continuación incluyen:
ja: 以下にレビューするツールは以下の通り:

source: When you are selecting a tool, you might consider this general workflow of questions:
es: Cuando esté seleccionando una herramienta, puede considerar este flujo de preguntas:
ja: ツールを選ぶ際には、このような一般的な質問の流れを考慮するとよいでしょう:

source: **Is your tool pure python? Yes?** You can use any tool that you wish! Pick the tool that has the features that you want to use in your build workflow. We suggest:
es: **¿Es su herramienta de Python puro? ¿Sí?** ¡Puede usar la herramienta que desee! Elija la herramienta que tenga las características que desea utilizar en su flujo de trabajo de construcción. Sugerimos:
ja: **あなたのツールは純粋なパイソンですか？はい？** お好きなツールをお使いください！ あなたのビルドワークフローで使いたい機能を持つツールを選んでください。 お勧めは:

source: Flit, Hatch, PDM or Poetry (read below for more)
ja: Flit、Hatch、PDM、またはPoetry (詳しくは以下をお読みください)

source: **Does your tool have a few C or C++ extensions?** Great, we suggest using **PDM** for the time being. It is the only tool in the list below that has both documented workflow to support such extensions and support for other back-ends in the case that build hooks are not enough for your workflow. PDM supports other back-ends such as scikit-build and meson-python that will allow you to fully customize your package's build.
es: **¿Tiene su herramienta unas pocas extensiones en C o C++?** Genial, sugerimos usar **PDM** por el momento. Es la única herramienta en la lista a continuación que tiene tanto un flujo de trabajo documentado para apoyar tales extensiones como soporte para otros backends en el caso de que los hooks de construcción no sean suficientes para su flujo de trabajo. PDM admite otros backends como scikit-build y meson-python que le permitirán personalizar completamente la construcción de su paquete.
ja: **あなたのツールはCやC++の拡張機能をいくつか持っていますか？** 当面は **PDM** を使うことをお勧めします。 以下のリストの中で、このような拡張をサポートするワークフローが文書化されており、ビルドフックだけではワークフローが不十分な場合に他のバックエンドをサポートする唯一のツールです。 PDMは、scikit-buildやmeson-pythonなどの他のバックエンドをサポートしており、パッケージのビルドを完全にカスタマイズすることができます。

source: NOTE: You can also use Hatch for non pure python builds. Hatch, similar to PDM, allows you to write your own build hooks or plugins to support custom build steps. But currently, hatch does not support other build back ends. Many of the core scientific packages are moving to meson-python to build their packages. Thus, we appreciate that PDM can work with meson-python specifically.
es: NOTA: También puede usar Hatch para construcciones no puras de Python. Hatch, similar a PDM, le permite escribir sus propios hooks de construcción o complementos para admitir pasos de construcción personalizados. Pero actualmente, hatch no admite otros backends de construcción. Muchos de los paquetes científicos principales se están cambiando a meson-python para construir sus paquetes. Por lo tanto, apreciamos que PDM pueda trabajar con meson-python específicamente.
ja: 注: 純粋なpython以外のビルドにもHatchを使うことができます。 Hatch は PDM と同様に、独自のビルドフックやプラグインを書くことができます。 しかし現在、hatchは他のビルドバックエンドをサポートしていない。コアな科学パッケージの多くは、パッケージをビルドするために meson-pythonに移行しています。したがって、PDMが特にmeson-pythonと連携できることはありがたいです。

source: Python packaging tools summary
es: Resumen de herramientas de empaquetado de Python
ja: Pythonパッケージングツールまとめ

source: Below, we summarize features offered by the most popular build front end tools. It is important to keep in mind that these front-end tools remove the need to use other core tools in your workflow. For example if you use setuptools, you will need to also use Build and Twine to build your package and publish to PyPI. But if you use Poetry, Hatch or PDM you can do all of those things using the same tool (e.g. `hatch build`, `hatch publish` or `pdm build`, `pdm publish`).
es: A continuación, resumimos las características ofrecidas por las herramientas de frontend de construcción más populares. Es importante tener en cuenta que estas herramientas de frontend eliminan la necesidad de usar otras herramientas centrales en su flujo de trabajo. Por ejemplo, si usa setuptools, también necesitará usar Build y Twine para construir su paquete y publicar en PyPI. Pero si usa Poetry, Hatch o PDM, puede hacer todas esas cosas con la misma herramienta (por ejemplo, `hatch build`, `hatch publish` o `pdm build`, `pdm publish`).
ja: 以下に、最も人気のあるビルドフロントエンドツールが提供する機能を要約します。これらのフロントエンドツールは、あなたのワークフローにおいて他のコアツールを使う必要性をなくすということを覚えておくことが重要です。 例えばsetuptoolsを使う場合、パッケージをビルドしてPyPIに公開するためにBuildとTwineも使う必要があります。 しかし、PoetryやHatch、PDMを使う場合は、同じツールを使ってこれらすべてを行うことができます (例：`hatch build`、`hatch publish`、`pdm build`、`pdm publish`) 。

source: Note that because setuptools does not offer a front-end interface, it is not included in the table.
es: Note que debido a que setuptools no ofrece una interfaz de frontend, no se incluye en la tabla.
ja: setuptoolsはフロントエンドインターフェースを提供していないので、この表には含まれていないことに注意してください。

source: Package tool features table
es: Tabla de características de las herramientas de empaquetado
ja: パッケージツール機能一覧表

source: Feature, Flit, Hatch, PDM, Poetry
ja: Flit, Hatch, PDM, Poetry の特徴

source: Default Build Back-end
es: Backend de construcción predeterminado
ja: デフォルトのビルドバックエンド

source: Use Other Build Backends
es: Usar otros backends de construcción
ja: 他のビルドバックエンドを使う

source: Dependency management
es: Gestión de dependencias
ja: 依存関係の管理

source: Publish to PyPI
es: Publicar en PyPI
ja: PyPIに公開する

source: Version Control based versioning (using `git tags`)
es: Versionado basado en control de versiones (usando `git tags`)
ja: バージョン管理ベースのバージョニング ( `git tags` を使用)

source: Version bumping
es: Incremento de versión
ja: バージョンバンプ

source: Environment Management
es: Gestión de entornos
ja: 環境マネジメント

source: More than one maintainer? (bus factor)
es: ¿Más de un mantenedor? (factor bus)
ja: メンテナンス担当者が複数いるか？ (バスファクター)

source: Notes:
es: Notas:
ja: 注釈:

source: _Hatch plans to support dependency management in the future_
es: _Hatch planea admitir la gestión de dependencias en el futuro_
ja: _Hatch は将来的に従属性管理をサポートする予定です_

source: Poetry supports semantic versioning. Thus, it will support version bumping following commit messages if you use a tool such as Python Semantic Release
es: Poetry admite versionado semántico. Por lo tanto, admitirá el incremento de versión siguiendo los mensajes de confirmación si utiliza una herramienta como Python Semantic Release
ja: Poetry はセマンティックバージョニングをサポートしています。 したがって、Python Semantic Releaseのようなツールを使えば、コミットメッセージに続くバージョンバンプをサポートします。

source: [PDM is a Python packaging and dependency management tool](https://pdm.fming.dev/latest/). PDM supports builds for pure Python projects. It also provides multiple layers of support for projects that have C and C++ extensions.
es: [PDM es una herramienta de empaquetado y gestión de dependencias de Python](https://pdm.fming.dev/latest/). PDM admite construcciones para proyectos de Python puro. También proporciona múltiples capas de soporte para proyectos que tienen extensiones en C y C++.
ja: [PDMはPythonのパッケージングと依存関係の管理ツールです](https://pdm.fming.dev/latest/) 。 PDMは純粋なPythonプロジェクトのビルドをサポートします。また、CやC++の拡張を持つプロジェクトに対しても、多層的なサポートを提供します。

source: PDM support for C and C++ extensions
es: PDM admite extensiones en C y C++
ja: CおよびC++拡張のPDMサポート

source: PDM supports using the PDM-back-end and setuptools at the same time. This means that you can run setuptools to compile and build C extensions. PDM's build back-end receives the compiled extension files (.so, .pyd) and packages them with the pure Python files.
es: PDM admite el uso del backend de PDM y setuptools al mismo tiempo. Esto significa que puede ejecutar setuptools para compilar y construir extensiones en C. El backend de construcción de PDM recibe los archivos de extensión compilados (.so, .pyd) y los empaqueta con los archivos de Python puro.
ja: PDMはPDM-back-endとsetuptoolsの同時使用をサポートしています。 つまり、setuptools を実行して C 拡張モジュールをコンパイルビルドすることができます。 PDMのビルドバックエンドはコンパイルされた拡張ファイル(.so, .pyd)を受け取り、純粋なPythonファイルと一緒にパッケージ化します。

source: PDM Features
es: Características de PDM
ja: PDMの特徴

source: Feature, PDM, Notes
es: Característica, PDM, Notas
ja: 特徴, PDM, ノート

source: When you setup PDM it allows you to select one of several build back ends including: PDM-core, flit-core and hatchling. PDM also can work with Meson-Python which supports move complex python builds.
es: Cuando configura PDM, le permite seleccionar uno de varios backends de construcción, incluidos: PDM-core, flit-core y hatchling. PDM también puede trabajar con Meson-Python que admite construcciones de Python más complejas.
ja: PDMをセットアップする際、いくつかのビルドバックエンドから1つを選択することができます: PDM-core、flit-core、hatchlingなどです。 PDMはまた、複雑なPythonビルドをサポートするMeson-Pythonとも連携できます。

source: Dependency specifications
es: Especificaciones de dependencias
ja: 依存仕様

source: PDM has flexible support for managing dependencies. PDM defaults to using an open bound (e.g. `requests >=1.2`) approach to dependencies. However you can [customize how you want to add dependencies in case you prefer another approach such as that of Poetry which uses an upper bound limit](https://pdm.fming.dev/latest/usage/dependency/#about-update-strategy).**
es: PDM tiene un soporte flexible para la gestión de dependencias. PDM por defecto utiliza un enfoque de límite abierto (por ejemplo, `requests >=1.2`) para las dependencias. Sin embargo, puede [personalizar cómo desea agregar dependencias en caso de que prefiera otro enfoque como el de Poetry que utiliza un límite superior](https://pdm.fming.dev/latest/usage/dependency/#about-update-strategy).
ja: PDMは依存関係の管理を柔軟にサポートしています。 PDMはデフォルトで依存関係に対してオープンバウンド(例えば `requests >=1.2` )アプローチを使用します。 しかし、 [Poetryのような上限を使用する別のアプローチを好む場合、依存関係を追加する方法をカスタマイズする](https://pdm.fming.dev/latest/usage/dependency/#about-update-strategy) ことができます。

source: Environment lock files
es: Archivos de bloqueo de entorno
ja: 環境ロックファイル

source: PDM and Poetry are currently the only tools that create environment lock files. Lock files are often most useful to developers creating web apps where locking the environment is critical for consistent user experience. For community-used packages, you will likely never want to use a lock file.
es: PDM y Poetry son actualmente las únicas herramientas que crean archivos de bloqueo de entorno. Los archivos de bloqueo son más útiles para los desarrolladores que crean aplicaciones web donde bloquear el entorno es crítico para una experiencia de usuario consistente. Para paquetes utilizados por la comunidad, es probable que nunca desee usar un archivo de bloqueo.
ja: PDMとPoetryは現在、環境ロックファイルを作成する唯一のツールです。 ロックファイルは、一貫したユーザーエクスペリエンスのために環境をロックすることが重要なウェブアプリを作成する開発者にとって、しばしば最も有用です。 コミュニティで使われるパッケージでは、ロックファイルを使うことはないでしょう。

source: Environment management
es: Gestión de entornos
ja: 環境マネジメント

source: PDM provides environment management support. It supports Python virtual environments, conda and a local `__pypackages__` environment which is a newer option in the Python ecosystem. No extensions are needed for this support.
es: PDM proporciona soporte de gestión de entornos. Admite entornos virtuales de Python, conda y un entorno local `__pypackages__` que es una opción más nueva en el ecosistema de Python. No se necesitan extensiones para este soporte.
ja: PDMは環境管理のサポートを提供します。 Python仮想環境、conda、そしてPythonエコシステムの新しいオプションであるローカルの `__pypackages__` 環境をサポートしています。 このサポートに拡張は必要ありません。

source: Select your environment type on install
es: Seleccione su tipo de entorno en la instalación
ja: インストール時に環境タイプを選択

source: When you run `PDM init`, PDM will discover environments that are already on your system and allow you to select one to use for your project.
es: Cuando ejecuta `PDM init`, PDM descubrirá los entornos que ya están en su sistema y le permitirá seleccionar uno para usar en su proyecto.
ja: `PDM init` を実行すると、PDMがあなたのシステム上にある環境を検出し、プロジェクトに使用する環境を選択できるようになります。

source: PDM supports publishing to both test PyPI and PyPI
es: PDM admite la publicación tanto en test PyPI como en PyPI
ja: PDM は test PyPI と PyPI の両方への公開をサポートしています

source: Version Control based versioning
es: Versionado basado en control de versiones
ja: バージョン管理ベースのバージョニング

source: PDM has a setuptools_scm like tool built into it which allows you to use dynamic versioning that rely on git tags.
es: PDM tiene una herramienta similar a setuptools_scm integrada en ella que le permite usar versiones dinámicas
ja: PDMには setuptools_scm のようなツールが組み込まれており、gitタグに依存したダイナミックバージョニングを使うことができます。

source: PDM supports you bumping the version of your package using standard semantic version terms patch; minor; major
es: PDM le permite incrementar la versión de su paquete utilizando términos de versión semántica estándar patch; minor; major
ja: PDMは、標準的なセマンティックバージョニングである patch; minor; major を使って、パッケージのバージョンをバンプすることをサポートしています。

source: Follows current packaging standards
es: Sigue los estándares de empaquetado actuales
ja: 現行のパッケージング基準に従う

source: PDM supports current packaging standards for adding metadata to the **pyproject.toml** file.
es: PDM admite los estándares de empaquetado actuales para agregar metadatos al archivo **pyproject.toml**.
ja: PDMは **pyproject.toml** ファイルにメタデータを追加するための現在のパッケージング標準をサポートしています。

source: Install your package in editable mode
es: Instalar su paquete en modo editable
ja: 編集可能モードでパッケージをインストールする

source: PDM supports installing your package in editable mode.
es: PDM admite instalar su paquete en modo editable.
ja: PDMは編集可能モードでのパッケージのインストールをサポートしています。

source: Build your sdist and wheel distributions
es: Construir sus distribuciones sdist y wheel
ja: sdistとwheelディストリビューションの構築

source: Similar to all of the other tools PDM builds your packages sdist and wheel files for you.
es: Al igual que todas las demás herramientas, PDM también construye los archivos sdist y wheel de sus paquetes.
ja: 他のツール同様、PDMはパッケージのsdistとwheelファイルをビルドしてくれます。

source: The functionality of PDM is similar to Poetry. However, PDM also offers additional, documented support for C extensions and version control based versioning. As such, PDM is preferred for those working on non pure-Python packages.
es: La funcionalidad de PDM es similar a la de Poetry. Sin embargo, PDM también ofrece soporte adicional y documentado para extensiones en C y versionado basado en control de versiones. Por lo tanto, PDM es preferido para aquellos que trabajan en paquetes no puros de Python.
ja: PDMの機能はPoetryに似ています。 しかし、PDMはC拡張やバージョン管理ベースのバージョニングを文書でサポートしています。 そのため、純粋なPython以外のパッケージで作業する場合は、PDMを使うことをお勧めします。

source: If you are deciding between the Poetry and PDM, a smaller difference is the default way that dependencies are added to your pyproject.toml file.
es: Sí está decidiendo entre Poetry y PDM, una diferencia más pequeña es la forma predeterminada en que se agregan las dependencias a su archivo pyproject.toml.
ja: もしあなたがPoetryとPDMのどちらを選ぶか決めているのであれば、より小さな違いは依存関係をpyproject.tomlファイルに追加するデフォルトの方法です。

source: Poetry by default follows strict semantic versioning adding dependencies to your pyproject.toml file [using an upper bounds constraint (`^`)](https://python-poetry.org/docs/dependency-specification/#version-constraints). Upper bounds lock means that Poetry will never bump a dependency to the next major version (i.e. from 1.2 to 2.0). However, you can tell Poetry to use an open bound approach by explicitly adding the package like this: `poetry add requests >= 1.2` rather than just using `poetry add requests` which will result in a upper bound locked (ie Upper bound locks means that requests 2.0 could never be installed even if it came out and your package could benefit from it).
es: Poetry por defecto sigue un versionado semántico estricto agregando dependencias a su archivo pyproject.toml [usando una restricción de límite superior (`^`)](https://python-poetry.org/docs/dependency-specification/#version-constraints). El bloqueo de límite superior significa que Poetry nunca incrementará una dependencia a la siguiente versión principal (es decir, de 1.2 a 2.0). Sin embargo, puede indicarle a Poetry que use un enfoque de límite abierto agregando explícitamente el paquete de esta manera: `poetry add requests >= 1.2` en lugar de simplemente usar `poetry add requests` que resultará en un bloqueo de límite superior (es decir, los bloqueos de límite superior significan que requests 2.0 nunca se podría instalar incluso si saliera y su paquete pudiera beneficiarse de ello).
ja: Poetryはデフォルトで、pyproject.tomlファイルに [上界制約(`^`)を使って](https://python-poetry.org/docs/dependency-specification/#version-constraints) 依存関係を追加する、厳密なセマンティックバージョニングに従っています。 アッパーバウンズロックとは、ポエトリーが依存関係を次のメジャーバージョン（1.2から2.0など）にバンプさせないことを意味します。 しかし、次のように明示的にパッケージを追加することで、Poetryにオープンバウンドのアプローチを使うように指示することができる： poetry add requests >= 1.2` のように明示的にパッケージを追加することで、Poetry にオープンバウンドのアプローチを使うように指示することができます (すなわち、アッパーバウンドロックとは、リクエスト2.0が出たとしてもインストールされることはなく、あなたのパッケージはその恩恵を受けることができるということです) 。

source: PDM defaults to open-bounds (`>=`) dependency additions which is the preferred approach in the scientific python ecosystem. However, PDM also allows you to specify the way dependencies are added by default. As such, you can also specify upper-bounds (`^`) using PDM if require that approach.
es: PDM por defecto utiliza la adición de dependencias de límites abiertos (`>=`) que es el enfoque preferido en el ecosistema de Python científico. Sin embargo, PDM también le permite especificar la forma en que se agregan las dependencias de forma predeterminada. Por lo tanto, también puede especificar límites superiores (`^`) utilizando PDM si requiere ese enfoque.
ja: PDMのデフォルトはオープンバウンド(`>=`)依存性の追加で、これは科学的なpythonのエコシステムでは好ましいアプローチです。 しかし、PDMではデフォルトで依存関係を追加する方法を指定することもできます。 そのため、その方法が必要であれば、PDMを使用して上限 (`^`) を指定することもできます。

source: Finally there are some nuanced differences in how both tools create lock files which we will not go into detail about here.
es: Finalmente, hay algunas diferencias matizadas en cómo ambas herramientas crean archivos de bloqueo de los que no entraremos en detalles aquí.
ja: 最後に、両ツールのロックファイルの作成方法には微妙な違いがありますが、ここでは詳しく説明しません。

source: Challenges with PDM
es: Dificultades con PDM
ja: PDMの課題

source: PDM is a full-featured packaging tool. However it is not without challenges:
es: PDM es una herramienta de empaquetado completa. Sin embargo, no está exenta de dificultades:
ja: PDMはフル機能のパッケージングツールです。しかし、課題がないわけではありません:

source: Its documentation can be confusing, especially if you are new to packaging. For example, PDM doesn't provide an end to end beginning workflow in its documentation.
es: Su documentación puede ser confusa, especialmente si eres nuevo en el empaquetado. Por ejemplo, PDM no proporciona un flujo de trabajo de principio a fin en su documentación.
ja: PDMのドキュメントは、特に初めてパッケージングを行う場合、混乱する可能性があります。 例えば、PDMのドキュメントには、最初から最後までのワークフローが記載されていません。

source: PDM also only has one maintainer currently. We consider individual maintainer teams to be a potential risk. If the maintainer finds they no longer have time to work on the project, it leaves users with a gap in support. Hatch and Flit also have single maintainer teams.
es: PDM solo tiene un mantenedor actualmente. Consideramos que los equipos de mantenedores con una sola persona son un riesgo potencial. Si el mantenedor decide que ya no tiene tiempo para trabajar en el proyecto, deja a los usuarios sin soporte. Hatch y Flit también tienen equipos de un solo mantenedor.
ja: また、PDMには現在1人のメンテナしかいません。 私たちは、個々のメンテナチームは潜在的なリスクであると考えています。 もしメンテナがプロジェクトに取り組む時間がなくなったら、ユーザーにはサポートのギャップが残ります。 HatchとFlitにも、一人のメンテナチームがあります。

source: [You can view an example of a package that uses PDM here](https://github.com/pyOpenSci/examplePy/tree/main/example4_pdm). The README file for this directly provides you with an overview of what the PDM command line interface looks like when you use it.
es: [Puede ver un ejemplo de un paquete que usa PDM aquí](https://github.com/pyOpenSci/examplePy/tree/main/example4_pdm). El archivo README de este le proporciona directamente una descripción general de cómo se ve la interfaz de línea de comandos de PDM cuando la usa.
ja: [PDMを使用したパッケージの例はこちらからご覧いただけます](https://github.com/pyOpenSci/examplePy/tree/main/example4_pdm) 。 このREADMEファイルでは、PDMコマンドラインインターフェイスを使用する際にどのように見えるかの概要を直接説明しています。

source: [Flit is a no-frills, streamlined packaging tool](https://flit.pypa.io/en/stable/) that supports modern Python packaging standards. Flit is a great choice if you are building a basic package to use in a local workflow that doesn't require any advanced features. And if your package structure is already created. More on that below.
es: [Flit es una herramienta de empaquetado sin adornos y simplificada](https://flit.pypa.io/en/stable/) que admite los estándares de empaquetado de Python modernos. Flit es una excelente opción si está construyendo un paquete básico para usar en un flujo de trabajo local que no requiere ninguna característica avanzada. Y si su estructura de paquete ya está creada. Más sobre eso a continuación.
ja: [Flitは、最新のPythonパッケージング標準をサポートする、飾り気のない、合理的なパッケージングツール](https://flit.pypa.io/en/stable/) です。 Flitは、ローカル・ワークフローで使用する基本的なパッケージを構築し、高度な機能を必要としない場合に最適な選択です。 また、パッケージ構造がすでに作成されている場合。 詳しくは後述します。

source: Flit Features
es: Características de Flit
ja: Flitの特徴

source: Feature, Flit, Notes
ja: 特徴, Flit, ノート

source: Publish to PyPI and test PyPI
es: Publicar en PyPI y test PyPI
ja: PyPIとtest PyPIに公開する

source: Flit supports publishing to both test PyPI and PyPI
es: Flit admite la publicación tanto en test PyPI como en PyPI
ja: Flit は test PyPI と PyPI の両方への公開をサポートしています

source: Helps you add metadata to your **pyproject.toml** file
es: Ayuda a agregar metadatos a su archivo **pyproject.toml**
ja: **pyproject.toml** ファイルにメタデータを追加するのに役立ちます。

source: Flit does support adding metadata to your **pyproject.toml** file following modern packaging standards.
es: Flit admite agregar metadatos a su archivo **pyproject.toml** siguiendo los estándares de empaquetado modernos.
ja: Flitは **pyproject.toml** ファイルにメタデータを追加することをサポートしています。

source: Flit supports current packaging standards for adding metadata to the **pyproject.toml** file.
es: Flit admite los estándares de empaquetado actuales para agregar metadatos al archivo **pyproject.toml**.
ja: Flitは、 **pyproject.toml** ファイルにメタデータを追加する現在のパッケージング標準をサポートしています。
