Repository: pyOpenSci/python-package-guide
Catalog: locales/*/LC_MESSAGES/tests.po
Languages: es, ja

source: We will focus on [Nox](https://nox.thea.codes/) in this guide. `nox` is a Python-based automation tool that builds upon the features of both `make` and `tox`. `nox` is designed to simplify and streamline testing and development workflows. Everything that you do with `nox` can be implemented using a Python-based interface.
es: Nos centraremos en [Nox](https://nox.thea.codes/) en esta guía. `nox` es una herramienta de automatización en Python que se basa en las características de `make` y `tox`. `nox` está diseñado para simplificar y optimizar los flujos de trabajo de pruebas y desarrollo. Todo lo que haces con `nox` se puede implementar utilizando una interfaz basada en Python.
ja: このガイドでは、 [Nox](https://nox.thea.codes/) に焦点を当てます。 `nox` は Python ベースの自動化ツールで、 `make` と `tox` の機能をベースにしています。 `nox` はテストと開発のワークフローを簡素化し、効率化するように設計されています。 `nox` で行うことはすべて、Pythonベースのインターフェースを使って実装することができます。

source: Other automation tools you'll see in the wild
es: Otras herramientas de automatización que encontrarás
ja: その他の自動化ツール

source: **[Tox](https://tox.wiki/en/latest/index.html#useful-links)** is an automation tool that supports common steps such as building documentation, running tests across various versions of Python, and more.
ja: **[Tox](https://tox.wiki/en/latest/index.html#useful-links)** は自動化ツールで、ドキュメントのビルドや、Pythonの様々なバージョン間でのテストの実行など、一般的なステップをサポートしています。

source: **[Hatch](https://github.com/ofek/hatch)** is a modern end-to-end packaging tool that works with the popular build backend called hatchling. `hatch` offers a `tox`-like setup where you can run tests locally using different Python versions. If you are using `hatch` to support your packaging workflow, you may want to also use its testing capabilities rather than using `nox`.
es: **[Hatch](https://github.com/ofek/hatch)** es una herramienta de empaquetado moderna de extremo a extremo que funciona con el popular backend de construcción llamado hatchling. `hatch` ofrece una configuración similar a `tox` donde puedes ejecutar pruebas localmente utilizando diferentes versiones de Python. Si estás utilizando `hatch` para implementar tu flujo de trabajo de empaquetado, puedes considerar utilizar sus capacidades de pruebas en lugar de usar `nox`.
ja: **[Hatch](https://github.com/ofek/hatch)** は、hatchlingと呼ばれる人気のあるビルドバックエンドで動作する最新のエンドツーエンドパッケージングツールです。 `hatch` は `tox` のようなセットアップを提供し、異なる Python バージョンを使ってローカルでテストを実行することができます。 パッケージングのワークフローをサポートするために `hatch` を使っているのであれば、 `nox` を使うよりも `hatch` のテスト機能を使った方が良いかもしれない。

source: [**make:**](https://www.gnu.org/software/make/manual/make.html) Some developers use Make, which is a build automation tool, for running tests due to its versatility; it's not tied to a specific language and can be used to run various build processes. However, Make's unique syntax and approach can make it more challenging to learn, particularly if you're not already familiar with it. Make also won't manage environments for you like **nox** will do.
es: [**make:**](https://www.gnu.org/software/make/manual/make.html) Algunos desarrolladores utilizan Make, que es una herramienta de automatización de construcción, para ejecutar pruebas debido a su versatilidad; no está vinculado a un lenguaje específico y se puede utilizar para ejecutar varios procesos de construcción. Sin embargo, la sintaxis y el enfoque únicos de Make pueden hacer que sea más difícil de aprender, especialmente si no estás familiarizado con él. Make tampoco administrará entornos para ti como lo hará **nox**.
ja: [**make:**](https://www.gnu.org/software/make/manual/make.html) ビルド自動化ツールであるMakeは汎用性が高いため、テストの実行に使う開発者もいます; 特定の言語に縛られることなく、さまざまなビルドプロセスを実行するために使うことができます。しかし、Makeのユニークな構文とアプローチは、特にあなたがまだMakeに慣れていない場合、習得を難しくする可能性があります。Makeはまた、 **nox** がやってくれるような環境管理もしてくれません。

source: Run tests across Python versions with nox
es: Ejecuta pruebas en diferentes versiones de Python con nox
ja: noxでPythonのバージョンにまたがってテストを実行する

source: **Nox** is a great automation tool to learn because it:
es: **Nox** es una herramienta de automatización muy buena para aprender porque:
ja: **Nox** は素晴らしい自動化ツールです:

source: Is Python-based making it accessible if you already know Python and
es: Esta basada en Python, lo que la hace accesible si ya conoces Python y
ja: Pythonベースですので、Pythonをすでに知っていれば利用しやすいです。

source: Will create isolated environments to run workflows.
es: Creará entornos aislados para ejecutar flujos de trabajo.
ja: ワークフローを実行するための隔離された環境を構築します。

source: `nox` simplifies creating and managing testing environments. With `nox`, you can set up virtual environments, and run tests across Python versions using the environment manager of your choice with a single command.
es: `nox` simplifica la creación y gestión de entornos de pruebas. Con `nox`, puedes configurar entornos virtuales y ejecutar pruebas en diferentes versiones de Python utilizando el administrador de entornos de tu elección con un solo comando.
ja: `nox` はテスト環境の作成と管理を簡単にします。 `nox` を使うと、仮想環境をセットアップし、好きな環境マネージャを使って Python のバージョンをまたいだテストをコマンド一つで実行することができます。

source: Nox Installations
es: Instalación de Nox
ja: Noxのインストール

source: When you install and use nox to run tests across different Python versions, nox will create and manage individual `venv` environments for each Python version that you specify in the nox function.
es: Cuando instalas y usas nox para ejecutar pruebas en diferentes versiones de Python, nox creará y administrará entornos `venv` individuales para cada versión de Python que especifiques en la función nox.
ja: 異なる Python バージョン間でテストを実行するために nox をインストールして使用する場合、nox は nox 関数で指定した Python バージョンごとに個別の `venv` 環境を作成して管理します。

source: Nox will manage each environment on its own.
es: Nox administrará cada entorno por separado.
ja: Noxはそれぞれの環境を独自に管理します。

source: Nox can also be used for other development tasks such as building documentation, creating your package distribution, and testing installations across both PyPI related environments (e.g. venv, virtualenv) and `conda` (e.g. `conda-forge`).
es: Nox también se puede utilizar para otras tareas de desarrollo como construir documentación, crear la distribución de tu paquete y probar instalaciones en entornos relacionados con PyPI (por ejemplo, venv, virtualenv) y `conda` (por ejemplo, `conda-forge`).
ja: nox は、ドキュメントのビルド、パッケージ配布の作成、PyPI 関連の環境 (venv や virtualenv など) と `conda` (conda-forge` など) の両方にわたるインストールのテストなど、その他の開発作業にも使用できます。

source: To get started with nox, you create a `noxfile.py` file at the root of your project directory. You then define commands using Python functions. Some examples of that are below.
es: Para empezar, creas un archivo `noxfile.py` en la raíz del directorio de tu proyecto. Luego, defines comandos utilizando funciones de Python. Algunos ejemplos están disponibles a continuación.
ja: noxを使い始めるには、プロジェクトディレクトリのルートに `noxfile.py` ファイルを作成します。 そして、Pythonの関数を使ってコマンドを定義します。 以下にその例をいくつか挙ます。

source: Test Environments
es: Entornos de Prueba
ja: テスト環境

source: By default, `nox` uses the Python built in `venv` environment manager. A virtual environment (`venv`) is a self-contained Python environment that allows you to isolate and manage dependencies for different Python projects. It helps ensure that project-specific libraries and packages do not interfere with each other, promoting a clean and organized development environment.
es: Por defecto, `nox` utiliza el administrador de entornos `venv` integrado en Python. Un entorno virtual (`venv`) es un entorno de Python autocontenido que te permite aislar y gestionar dependencias para diferentes proyectos de Python. Estos entornos ayudan a garantizar que las bibliotecas y paquetes específicos del proyecto no interfieran entre sí, promoviendo un entorno de desarrollo limpio y organizado.
ja: デフォルトでは、 `nox` は Python 組み込みの `venv` 環境マネージャを使用します。 仮想環境 (`venv`) は自己完結型の Python 環境で、異なる Python プロジェクトの依存関係を分離して管理することができます。 プロジェクト固有のライブラリやパッケージが互いに干渉しないようにし、クリーンで整理された開発環境を促進します。

source: An example of using nox to run tests in `venv` environments for Python versions 3.9, 3.10, 3.11 and 3.12 is below.
es: Un ejemplo de cómo usar nox para ejecutar pruebas en entornos `venv` para las versiones de Python 3.9, 3.10, 3.11 y 3.12 está a continuación.
ja: noxを使ってPythonバージョン3.9、3.10、3.11、3.12の `venv` 環境でテストを実行する例を以下に示します。

source: Note that for the code below to work, you need to have all 4 versions of Python installed on your computer for `nox` to find.
es: Ten en cuenta que para que el código a continuación funcione, necesitas tener las 4 versiones de Python instaladas en tu ordenador para que `nox` las encuentre.
ja: 以下のコードが動作するためには、 `nox` が見つけることができる4つのバージョンのPythonがコンピュータにインストールされている必要があることに注意してください。

source: Nox with venv environments
es: Nox con entornos venv
ja: venv環境のnox

source: TODO: add some tests above and show what the output would look like in the examples below...
es: TODO: añadir algunas pruebas arriba y mostrar cómo sería la salida en los ejemplos a continuación...
ja: TODO: 上記のテストをいくつか追加し、以下の例で出力がどのようになるかを示す...

source: Below is an example of setting up nox to run tests using `venv` which is the built in environment manager that comes with base Python.
es: A continuación se muestra un ejemplo de cómo configurar nox para ejecutar pruebas utilizando `venv`, que es el administrador de entornos integrado que viene con Python.
ja: 以下は、Pythonに組み込まれている環境マネージャーである `venv` を使ってテストを実行するようにnoxをセットアップする例です。

source: Note that the example below assumes that you have [setup your `pyproject.toml` to declare test dependencies in a way that pip can understand](../package-structure-code/declare-dependencies.md). An example of that setup is below.
es: Ten en cuenta que el ejemplo a continuación asume que has [configurado tu `pyproject.toml` para declarar las dependencias de prueba de una manera que pip pueda entender](../package-structure-code/declare-dependencies.md). Un ejemplo de esa configuración está a continuación.
ja: 以下の例では、 [pipが理解できる方法でテストの依存関係を宣言するように`pyproject.toml`をセットアップする](../package-structure-code/declare-dependencies.md) ことを前提としていることに注意してください。 そのセットアップの例を以下に示します。

source: If you have the above setup, then you can use `session.install(".[tests]")` to install your test dependencies. Notice that below one single nox session allows you to run your tests on 4 different Python environments (Python 3.9, 3.10, 3.11, and 3.12).
es: Si tienes la configuración anterior, puedes usar `session.install(".[tests]")` para instalar tus dependencias de prueba. Observa que a continuación una sola sesión de nox te permite ejecutar tus pruebas en 4 entornos de Python diferentes (Python 3.9, 3.10, 3.11 y 3.12).
ja: 上記の設定ができていれば、 `session.install(".[tests]")` を使ってテストの依存関係をインストールすることができます。 以下のように、1つのnoxセッションで4つの異なるPython環境（Python 3.9、3.10、3.11、3.12）でテストを実行できることに注意してください。

source: Above you create a nox session in the form of a function with a `@nox.session` decorator. Notice that within the decorator you declare the versions of python that you wish to run.
es: Arriba creas una sesión de nox en forma de función con el decorador `@nox.session`. Observa que dentro del decorador declaras las versiones de Python que deseas ejecutar.
ja: 上の例では、 `@nox.session` デコレーターを使って関数の形で nox セッションを作成しています。 デコレータの中で、実行したい python のバージョンを宣言していることに注意してください。

source: To run the above you'd execute the following command, specifying which session with `--session` (sometimes shortened to `-s`). Your function above is called test, therefore the session name is test.
es: Para ejecutar lo anterior, utlizarías el siguiente comando, especificando qué sesión con `--session` (a veces abreviado a `-s`). Tu función se llama test, por lo tanto, el nombre de la sesión es test.
ja: 上記を実行するには、 `--session` （ `-s` と短縮されることもある）でセッションを指定し、以下のコマンドを実行します。上記の関数はtestという名前なので、セッション名はtestです。

source: Nox with conda / mamba
es: Nox con conda / mamba
ja: conda / mamba による nox

source: Below is an example for setting up nox to use mamba (or conda) for your environment manager. Note that unlike venv, conda can automatically install the various versions of Python that you need. You won't need to install all four Python versions if you use conda/mamba, like you do with `venv`.
es: A continuación se muestra un ejemplo de como configurar nox para usar mamba (o conda) como administrador de entornos. Ten en cuenta que, a diferencia de venv, conda puede instalar automáticamente las diferentes versiones de Python que necesitas. No necesitarás instalar las cuatro versiones de Python si usas conda/mamba, como lo tienes que hacer con `venv`.
ja: 以下は、noxが環境マネージャーにmamba（またはconda）を使うように設定する例です。venvと違って、condaは必要なPythonの様々なバージョンを自動的にインストールできることに注意してください。conda/mambaを使う場合は、 `venv` のように4つのPythonバージョンをインストールする必要はありません。

source: For `conda` to work with `nox`, you will need to ensure that either `conda` or `mamba` is installed on your computer.
es: Para que `conda` funcione con `nox`, deberás asegurarte de que `conda` o `mamba` estén instalados en tu ordenador.
ja: `nox` で `conda` を動作させるには、コンピュータに `conda` か `mamba` のどちらかがインストールされていることを確認する必要があります。

source: To run the above session you'd use:
es: Para ejecutar la sesión anterior, usarías:
ja: 上記のセッションを実行するには、次のようにします:

source: Test Types for Python packages
es: Pruebas para paquetes de Python
ja: Pythonパッケージのテストタイプ

source: Three types of tests: Unit, Integration & Functional Tests
es: Tres tipos de pruebas: Pruebas Unitarias, de Integración y Funcionales
ja: 3種類のテスト: 単体テスト、統合テスト、機能テスト

source: There are different types of tests that you want to consider when creating your test suite:
es: Existen diferentes tipos de pruebas que debes considerar al crear tu conjunto de pruebas:
ja: テストスイートを作成する際に考慮したいテストには、さまざまなタイプがあります:

source: Unit tests
es: Pruebas Unitarias
ja: 単体テスト

source: Integration
es: Integración
ja: 統合

source: End-to-end (also known as Functional) tests
es: Pruebas de extremo a extremo (o Funcionales)
ja: エンドツーエンド(機能テストとも呼ばれる)テスト

source: Each type of test has a different purpose. Here, you will learn about all three types of tests.
es: Cada tipo de prueba tiene un propósito diferente. Aquí aprenderás sobre los tres tipos de pruebas.
ja: それぞれのテストには異なる目的があります。 ここでは、3種類のテストすべてについて学びます。

source: I think this page would be stronger if we did have some examples from our package here: https://github.com/pyOpenSci/pyosPackage
es: Creo que esta página sería más sólida si tuviéramos algunos ejemplos de nuestro paquete aquí: https://github.com/pyOpenSci/pyosPackage
ja: 私たちのパッケージからの例があれば、このページはもっと強くなると思います: https://github.com/pyOpenSci/pyosPackage

source: Unit Tests
es: Pruebas Unitarias
ja: 単体テスト

source: A unit test involves testing individual components or units of code in isolation to ensure that they work correctly. The goal of unit testing is to verify that each part of the software, typically at the function or method level, performs its intended task correctly.
es: Una prueba unitaria implica probar componentes individuales o unidades de código de forma aislada para asegurarse de que funcionen correctamente. El objetivo de las pruebas unitarias es verificar que cada parte del software, típicamente a nivel de función o método, realiza correctamente su función prevista.
ja: 単体テストは、個々のコンポーネントやコードの単位を分離してテストし、それらが正しく動作することを確認するものです。単体テストの目的は、ソフトウェアの各部分、通常は関数やメソッドのレベルが、意図したタスクを正しく実行することを検証することです。

source: Unit tests can be compared to examining each piece of your puzzle to ensure parts of it are not broken. If all of the pieces of your puzzle don’t fit together, you will never complete it. Similarly, when working with code, tests ensure that each function, attribute, class, method works properly when isolated.
es: Las pruebas unitarias se pueden comparar con examinar cada pieza de un rompecabezas para asegurarte de que ninguna parte esté rota. Si todas las piezas de tu rompecabezas no encajan, nunca lo completarás. De manera similar, al trabajar con código, las pruebas aseguran que cada función, atributo, clase, método funciona correctamente cuando está aislado.
ja: 単体テストは、パズルの各パーツが壊れていないかどうかを調べることに例えることができます。パズルのピースがすべて合わなければ、完成することはありません。同様に、コードを扱う場合、テストは各関数、プロパティ、クラス、メソッドが分離されたときに正しく機能することを保証します。

source: **Unit test example:** Pretend that you have a function that converts a temperature value from Celsius to Fahrenheit. A test for that function might ensure that when provided with a value in Celsius, the function returns the correct value in degrees Fahrenheit. That function is a unit test. It checks a single unit (function) in your code.
es: **Ejemplo de prueba unitaria:** Imagina que tienes una función que convierte un valor de temperatura de Celsius a Fahrenheit. Una prueba para esa función podría asegurarse de que, al proporcionar un valor en Celsius, la función devuelva el valor correcto en grados Fahrenheit. Esa función es una prueba unitaria. Comprueba una sola unidad (función) en tu código.
ja: **ユニットテスト例:** 温度値を摂氏から華氏に変換する関数があるとします。その関数のテストは、摂氏の値が提供されたとき、その関数が正しい華氏の値を返すことを保証するかもしれません。この関数はユニットテストです。これは、コード内の1つのユニット(関数)をチェックします。

source: Example unit test for the above function. You'd run this test using the `pytest` command in your **tests/** directory.
es: Ejemplo de prueba unitaria para la función anterior. Ejecutarías esta prueba utilizando el comando `pytest` en tu directorio **tests/**.
ja: 上記の関数のユニットテスト例。このテストは、 **tests/** ディレクトリの `pytest` コマンドを使って実行します。

source: image of puzzle pieces that all fit together nicely. The puzzle pieces are colorful - purple, green and teal.
es: imagen de las piezas de un rompecabezas que encajan perfectamente. Las piezas del rompecabezas tiene colores - púrpura, verde y turquesa.
ja: パズルのピースがうまく組み合わさったような画像です。パズルのピースは紫色、緑色、鴨の羽色とカラフルです。

source: Your unit tests should ensure each part of your code works as expected on its own.
es: Tus pruebas unitarias deben asegurarse de que cada parte de tu código funciona como se espera por sí sola.
ja: ユニットテストでは、コードの各部分がそれ自体で期待通りに動作することを確認する必要があります。

source: Integration tests
es: Pruebas de Integración
ja: 統合テスト

source: Integration tests involve testing how parts of your package work together or integrate. Integration tests can be compared to connecting a bunch of puzzle pieces together to form a whole picture. Integration tests focus on how different pieces of your code fit and work together.
es: Las pruebas de integración implican probar cómo funcionan juntas o se integran las partes de tu paquete. Las pruebas de integración se pueden comparar con conectar muchas de piezas de rompecabezas para formar una imagen completa. Las pruebas de integración se centran en cómo encajan y funcionan juntas las diferentes partes de tu código.
ja: 統合テストでは、パッケージの各パーツがどのように連動するか、あるいは統合されるかをテストします。統合テストは、パズルのピースをつなげて全体像を作るようなものです。統合テストは、コードのさまざまな部分がどのように適合し、連携して動作するかに焦点を当てます。

source: For example, if you had a series of steps that collected temperature data in a spreadsheet, converted it from degrees celsius to Fahrenheit and then provided an average temperature for a particular time period. An integration test would ensure that all parts of that workflow behaved as expected.
es: Por ejemplo, si tuvieras una serie de pasos que recopilaran datos de temperatura en una hoja de cálculo, los convirtieran de grados Celsius a Fahrenheit y luego proporcionaran una temperatura promedio para un período de tiempo determinado. Una prueba de integración aseguraría que todas las partes de ese flujo de trabajo se comportaran como se espera.
ja: 例えば、スプレッドシートに温度データを収集し、摂氏から華氏に変換し、特定の期間の平均温度を提供する一連のステップがあったとします。統合テストは、そのワークフローのすべての部分が期待通りに動作することを保証します。

source: image of two puzzle pieces with some missing parts. The puzzle pieces are purple teal yellow and blue. The shapes of each piece don’t fit together.
es: imagen de dos piezas de rompecabezas con algunas partes faltantes. Las piezas del rompecabezas son de color púrpura, turquesa, amarillo y azul. Las formas de cada pieza no encajan juntas.
ja: パズルのピースが2つあり、一部欠けている画像です。パズルのピースは紫・鴨の羽色・黄色・青色。 それぞれのピースの形が合いません。

source: If puzzle pieces have missing ends, they can’t work together with other elements in the puzzle. The same is true with individual functions, methods and classes in your software. The code needs to work both individually and together to perform certain sets of tasks.
es: Si las piezas de un rompecabezas tienen extremos faltantes, no pueden funcionar juntas con otros elementos del rompecabezas. Lo mismo ocurre con las funciones, métodos y clases individuales en tu software. El código necesita funcionar tanto individualmente como en conjunto para realizar ciertas tareas.
ja: パズルのピースの両端が欠けていると、パズルの他の要素と連動することができません。ソフトウェアの個々の関数、メソッド、クラスについても同様です。コードは、ある一連のタスクを実行するために、個々に、そして一緒に働く必要があります。

source: Your integration tests should ensure that parts of your code that are expected to work together, do so as expected.
es: Tus pruebas de integración deben asegurarse de que las partes de tu código que se espera que funcionen juntas, lo hagan como se espera.
ja: 統合テストは、コードの一部が連携して動作することが期待されており、期待通りに動作することを保証するものでなければなりません。

source: End-to-end (functional) tests
es: Pruebas de extremo a extremo (funcionales)
ja: エンドツーエンド(機能)テスト

source: End-to-end tests (also referred to as functional tests) in Python are like comprehensive checklists for your software. They simulate real user end-to-end workflows to make sure the code base supports real life applications and use-cases from start to finish. These tests help catch issues that might not show up in smaller tests and ensure your entire application or program behaves correctly. Think of them as a way to give your software a final check before it's put into action, making sure it's ready to deliver a smooth experience to its users.
es: Las pruebas de extremo a extremo (también conocidas como pruebas funcionales) en Python son como listas de verificación completas para tu software. Simulan flujos de trabajo de extremo a extremo de usuarios reales para asegurarse de que el código soporta aplicaciones y casos de uso reales de principio a fin. Estas pruebas ayudan a detectar problemas que podrían no aparecer en pruebas más pequeñas y aseguran que toda tu aplicación o programa se comporta correctamente. Son como una forma de darle a tu software una revisión final antes de ponerlo en acción, asegurándote de que esté listo para proporcionar una experiencia fluida a tus usuarios.
ja: Python におけるエンドツーエンドのテスト（機能テストとも呼ばれる）は、ソフトウェアの包括的なチェックリストのようなものです。実際のユーザーのエンドツーエンドのワークフローをシミュレートし、コードベースが実際のアプリケーションやユースケースを最初から最後までサポートすることを確認します。これらのテストは、小規模なテストでは表示されないかもしれない問題をキャッチし、アプリケーションやプログラム全体が正しく動作することを確認するのに役立ちます。ソフトウェアを実用化する前に最終チェックを行い、ユーザーにスムーズなエクスペリエンスを提供する準備ができていることを確認する方法だと考えてください。

source: Image of a completed puzzle showing a daisy
es: Imagen de un rompecabezas completado que muestra una margarita
ja: デイジーを描いたパズルの完成イメージ

source: End-to-end or functional tests represent an entire workflow that you expect your package to support.
es: Las pruebas de extremo a extremo o funcionales representan un flujo de trabajo completo que esperas que tu paquete soporte.
ja: エンドツーエンドテストまたは機能テストは、パッケージがサポートすることを期待するワークフロー全体を表します。

source: End-to-end test also test how a program runs from start to finish. A tutorial that you add to your documentation that runs in CI in an isolated environment is another example of an end-to-end test.
es: Las pruebas de extremo a extremo también prueban cómo se ejecuta un programa de principio a fin. Un tutorial que añades a tu documentación que se ejecuta en CI en un entorno aislado es otro ejemplo de una prueba de extremo a extremo.
ja: エンドツーエンドのテストも、プログラムが最初から最後までどのように実行されるかをテストします。ドキュメントに追加するチュートリアルは、分離された環境のCIで実行され、エンドツーエンドのテストのもう一つの例です。
