Repository: pyOpenSci/python-package-guide
Catalog: locales/*/LC_MESSAGES/tests.po
Languages: es, ja

source: Code coverage for your Python package test suite
ja: Pythonパッケージのテストスイートのコードカバレッジ

source: Code coverage measures how much of your package's code runs during testing. Achieving high coverage can help ensure the reliability of your codebase, but it’s not a guarantee of quality. Below, we outline key considerations for using code coverage effectively.
ja: コードカバレッジは、テスト中にパッケージのコードがどれだけ実行されるかを測定します。 高いカバレッジを達成することは、コードベースの信頼性を確保するのに役立ちますが、品質を保証するものではありません。 以下に、コードカバレッジを効果的に使用するための主な検討事項を概説します。

source: Why aim for high code coverage?
ja: なぜ高いコードカバレッジを目指すのか？

source: A good practice is to ensure that every line of your code runs at least once during your test suite. This helps you:
ja: 良い習慣は、テストスイートの間に、コードのすべての行が少なくとも一度は実行されるようにすることです。これはあなたを助けます:

source: Identify untested parts of your codebase.
ja: コードベースのテストされていない部分を特定します。

source: Catch bugs that might otherwise go unnoticed.
ja: 他の方法では気づかれないかもしれないバグをキャッチします。

source: Build confidence in your software's stability.
ja: ソフトウェアの安定性に自信を持てます。

source: Limitations of code coverage
ja: コードカバレッジの限界

source: While high code coverage is valuable, it has its limits:
ja: 高いコードカバレッジは価値がありますが、それには限界があります:

source: **Difficult-to-test code:** Some parts of your code might be challenging to test, either due to complexity or limited resources.
ja: **テストしにくいコード:** コードの中には、複雑さや限られたリソースのために、テストが難しい部分があるかもしれません。

source: **Missed edge cases:** Running all lines of code doesn’t guarantee that edge cases are handled correctly.
ja: **見逃されたエッジケース:** すべてのコードを実行しても、エッジケースが正しく処理される保証はありません。

source: Ultimately, you should focus on how your package will be used and ensure your tests cover those scenarios adequately.
ja: 最終的には、パッケージがどのように使用されるかに焦点を当て、テストがそのシナリオを十分にカバーするようにしなければなりません。

source: Tools for analyzing Python package code coverage
ja: Pythonパッケージのコードカバレッジを分析するツール

source: Some common services for analyzing code coverage are [codecov.io](https://codecov.io/) and [coveralls.io](https://coveralls.io/). These projects are free for open source tools and will provide dashboards that tell you how much of your codebase is covered during your tests. We recommend setting up an account (on either CodeCov or Coveralls) and using it to keep track of your code coverage.
ja: コードカバレッジを分析するための一般的なサービスには、 [codecov.io](https://codecov.io/) と [coveralls.io](https://coveralls.io/) があります。 これらのプロジェクトはオープンソースのツールで無料であり、テスト中にコードベースがどの程度カバーされているかを示すダッシュボードを提供してくれます。 (CodeCovまたはCoverallsで) アカウントを設定し、コード・カバレッジを追跡するために使用することをお勧めします。

source: Screenshot of the code cov service - showing test coverage for the stravalib package. This image shows a list of package modules and the associated number of lines and % lines covered by tests. At the top of the image, you can see what branch is being evaluated and the path to the repository.
ja: code covサービスのスクリーンショット - stravalibパッケージのテストカバレッジを示します。 この画像は、パッケージモジュールのリストと、関連する行数およびテスト対象行の割合を示しています。 画像の上部には、評価対象のブランチとリポジトリへのパスが表示されています。

source: The CodeCov platform is a useful tool if you wish to track code coverage visually. Using it, you can not only get the same summary information that you can get with the **pytest-cov** extension. You can also see what lines are covered by your tests and which are not. Code coverage is useful for evaluating unit tests and/or how much of your package code is "covered". It, however, will not evaluate things like integration tests and end-to-end workflows.
ja: CodeCovプラットフォームは、コードカバレッジを視覚的に追跡したい場合に便利なツールです。これを使えば、 **pytest-cov** 拡張機能で得られるのと同じサマリー情報を得られるだけではありません。また、テストの対象になっているラインとそうでないラインを確認することもできます。コードカバレッジは、単体テストの評価や、パッケージのコードがどれだけ "カバー" されているかを評価するのに役立ちます。しかし、統合テストやエンドツーエンドのワークフローなどは評価されません。

source: Typing & MyPy coverage
ja: 型 & MyPyのカバレッジ

source: You can also create and upload typing reports to CodeCov.
ja: また、型レポートを作成し、CodeCovにアップロードすることもできます。

source: Exporting Local Coverage Reports
ja: ローカルカバレッジレポートのエクスポート

source: In addition to using services like CodeCov or Coveralls, you can generate local coverage reports directly using the **coverage.py** tool. This can be especially useful if you want to create reports in Markdown or HTML format for offline use or documentation.
ja: CodeCovやCoverallsのようなサービスを利用するだけでなく、 **coverage.py** ツールを使って直接ローカルカバレッジレポートを作成することもできます。 これは、オフラインでの使用や文書化のためにMarkdownやHTML形式でレポートを作成したい場合に特に便利です。

source: To generate a coverage report in **Markdown** format, run:
ja: カバレッジレポートを **Markdown** 形式で作成するには、以下を実行します:

source: This command will produce a Markdown-formatted coverage summary that you can easily include in project documentation or share with your team.
ja: このコマンドはMarkdown形式のカバレッジサマリーを作成し、プロジェクトのドキュメントに簡単に記載したり、チームと共有したりすることができます。

source: To generate an HTML report that provides a detailed, interactive view of which lines are covered, use:
ja: どの行がカバーされているか、詳細でインタラクティブなビューを提供するHTMLレポートを生成するには、以下を使用します:

source: The generated HTML report will be saved in a directory named htmlcov by default. Open the index.html file in your browser to explore your coverage results.
ja: 生成されたHTMLレポートは、デフォルトでhtmlcovというディレクトリに保存されます。index.htmlファイルをブラウザで開き、カバレッジ結果をご覧ください。

source: These local reports are an excellent way to quickly review coverage without setting up an external service.
ja: このようなローカルレポートは、外部サービスを立ち上げることなくカバレッジを素早く確認する優れた方法です。

source: Intro
es: Introducción
ja: イントロ

source: Write tests
es: Crea pruebas
ja: テストを書く

source: Test types
es: Tipos de pruebas
ja: テストの種類

source: Run tests locally
es: Ejecuta pruebas localmente
ja: ローカルでテストを実行する

source: Run tests online (using CI)
es: Ejecuta pruebas en línea (usando CI)
ja: オンラインでテストを実行する(CIを使用する)

source: Code coverage
ja: コードカバレッジ

source: Create & Run Tests
es: Crea y Ejecuta Pruebas
ja: テストの作成と実行

source: Tests and data for your Python package
es: Pruebas y datos para tu paquete de Python
ja: Pythonパッケージのテストとデータ

source: Tests are an important part of your Python package because they provide a set of checks that ensure that your package is functioning how you expect it to.
es: Las pruebas son una parte importante de tu paquete de Python porque proporcionan un conjunto de comprobaciones que aseguran que tu paquete funciona como se espera.
ja: テストは Python パッケージの重要な一部です。なぜなら、テストはパッケージが期待通りに動作しているかどうかを確認するための一連のチェック機能を提供するからです。

source: In this section, you will learn more about the importance of writing tests for your Python package and how you can set up infrastructure to run your tests both locally and on GitHub.
ja: このセクションでは、Python パッケージのテストを書くことの重要性と、ローカルと GitHub の両方でテストを実行するためのインフラストラクチャの設定方法について学びます。

source: ✨ Why write tests ✨
es: ✨ Por qué escribir pruebas ✨
ja: ✨テストを書く理由✨

source: Learn more about the art of writing tests for your Python package. Learn about why you should write tests and how they can help you and potential contributors to your project.
es: Aprende más sobre el arte de escribir pruebas para tu paquete de Python. Aprende por qué deberías escribir pruebas y cómo pueden ayudarte a ti y a los posibles contribuyentes a tu proyecto.
ja: Python パッケージのテストを書く技術についてもっと学びましょう。 なぜテストを書く必要があるのか、そしてテストがどのようにあなたやあなたのプロジェクトへの将来の貢献者の助けになるのかを学びましょう。

source: ✨ Types of tests ✨
es: ✨ Tipos de pruebas ✨
ja: ✨テストの種類✨

source: There are three general types of tests that you can write for your Python package: unit tests, integration tests and end-to-end (or functional) tests. Learn about all three.
es: Hay tres tipos generales de pruebas que puedes escribir para tu paquete de Python: pruebas unitarias, pruebas de integración y pruebas de extremo a extremo (o funcionales). Aprende sobre las tres.
ja: Python パッケージで書くことのできるテストには、ユニットテスト、統合テスト、エンドツーエンドテスト (あるいは機能テスト) の 3 種類があります。 この 3 つについて学びましょう。

source: ✨ Run tests locally ✨
es: ✨ Ejecuta pruebas localmente ✨
ja: ✨ローカルでテストを実行する✨

source: If you expect your users to use your package across different versions of Python, then using an automation tool such as nox to run your tests is useful. Learn about the various tools that you can use to run your tests across python versions here.
es: Si esperas que tus usuarios utilicen tu paquete en diferentes versiones de Python, es importante usar una herramienta de automatización como nox para ejecutar tus pruebas. Aprende sobre las diversas herramientas que puedes usar para ejecutar tus pruebas en diferentes versiones de Python aquí.
ja: もしユーザがあなたのパッケージを異なるバージョンの Python で使うことを想定しているなら、テストを実行するために nox のような自動化ツールを使うと便利です。 Python のバージョンにまたがってテストを実行するために使える様々なツールについては、こちらを参照してください。

source: ✨ Run tests online (using CI) ✨
es: ✨ Ejecuta pruebas en línea (usando CI) ✨
ja: ✨オンラインでテストを実行する(CIを使用する)✨

source: Continuous integration platforms such as GitHub Actions can be useful for running your tests across both different Python versions and different operating systems. Learn about setting up tests to run in Continuous Integration here.
ja: GitHub Actionsのような継続的インテグレーションプラットフォームは、Python のバージョンやオペレーティングシステムの違いを問わずテストを実行するのに便利です。 継続的インテグレーションで実行するテストの設定については、こちらを参照してください。

source: Graphic showing the elements of the packaging process.
es: Ilustración que muestra los elementos del proceso de empaquetado.
ja: パッケージング工程の要素を示すグラフィック。

source: Run Python package tests
es: Ejecuta pruebas de paquetes de Python
ja: Pythonパッケージテストの実行

source: Running your tests is important to ensure that your package is working as expected. It's good practice to consider that tests will run on your computer and your users' computers that may be running a different Python version and operating systems. Think about the following when running your tests:
es: Ejecutar tus pruebas es importante para asegurarte de que tu paquete funciona como se espera. Es una buena práctica considerar que las pruebas se ejecutarán en tu computadora y en las computadoras de tus usuarios que pueden estar ejecutando una versión diferente de Python y sistemas operativos. Piensa en lo siguiente al ejecutar tus pruebas:
ja: テストを実行することは、パッケージが期待通りに動作していることを確認するために重要です。 テストは、あなたのコンピュータと、Python のバージョンやオペレーティングシステムが異なるユーザのコンピュータで実行されることを考慮するのがよい習慣です。 テストを実行する際には、以下のことを考慮してください:

source: Run your test suite in a matrix of environments that represent the Python versions and operating systems your users are likely to have.
es: Ejecuta tu conjunto de pruebas en una matriz de entornos que representen las versiones de Python y los sistemas operativos que es probable que tus usuarios tengan.
ja: テストスイートは、Python のバージョンとユーザーが使用する可能性のあるオペレーティングシステムを表す環境のマトリックスで実行します。

source: Running your tests in an isolated environment provides confidence in the tests and their reproducibility. This ensures that tests do not pass randomly due to your computer's specific setup. For instance, you might have unexpectedly installed dependencies on your local system that are not declared in your package's dependency list. This oversight could lead to issues when others try to install or run your package on their computers.
es: Ejecutar tus pruebas en un entorno aislado proporciona confianza en las pruebas y su reproducibilidad. Esto asegura que las pruebas no pasen aleatoriamente debido a la configuración específica de tu ordenador. Por ejemplo, podrías haber instalado dependencias inesperadamente en tu sistema local que no están declaradas en la lista de dependencias de tu paquete. Esta omisión podría provocar problemas cuando otros intenten instalar o ejecutar tu paquete en sus ordenadores.
ja: 隔離された環境でテストを実行することで、テストとその再現性に自信を持つことができます。 これにより、あなたのコンピュータの設定によってテストがランダムにパスすることがなくなります。 たとえば、あなたのパッケージの依存関係リストで宣言されていない依存関係を、予期せずローカルシステムにインストールしてしまったかもしれません。 このような見落としは、他の人があなたのパッケージを自分のコン ピュータにインストールしたり実行しようとしたときに、問題につながる可能性 があります。

source: On this page, you will learn about the tools that you can use to both run tests in isolated environments and across Python versions.
es: En esta página, aprenderás sobre las herramientas que puedes usar para ejecutar pruebas en entornos aislados y en diferentes versiones de Python.
ja: このページでは、隔離された環境でテストを実行したり、Python のバージョンを越えてテストを実行したりするために使えるツールについて学びます。

source: There are three categories of tools that will make is easier to setup and run your tests in various environments:
es: Hay tres categorías de herramientas que facilitarán la configuración y ejecución de tus pruebas en varios entornos:
ja: さまざまな環境でのテストのセットアップと実行を容易にするツールには、3つのカテゴリーがあります:

source: A **test framework**, is a package that provides a particular syntax and set of tools for _both writing and running your tests_. Some test frameworks also have plugins that add additional features such as evaluating how much of your code the tests cover. Below you will learn about the **pytest** framework which is one of the most commonly used Python testing frameworks in the scientific ecosystem. Testing frameworks are essential but they only serve to run your tests. These frameworks don't provide a way to easily run tests across Python versions without the aid of additional automation tools.
es: Un **marco de pruebas** (test framework) es un paquete que proporciona una sintaxis particular y un conjunto de herramientas para _tanto escribir como ejecutar tus pruebas_. Algunos marcos de pruebas también tienen complementos que agregan funciones adicionales como evaluar cuánto de tu código cubren las pruebas. A continuación, aprenderás sobre el marco de pruebas **pytest**, que es uno de los marcos de pruebas de Python más utilizados en el ecosistema científico. Los marcos de pruebas son esenciales, pero solo sirven para ejecutar tus pruebas. Estos marcos no proporcionan una forma de ejecutar fácilmente pruebas en diferentes versiones de Python sin la ayuda de herramientas de automatización adicionales.
ja: **テストフレームワーク** とは、テストを書いたり実行したりするための特定の構文やツールのセットを提供するパッケージのことです。 いくつかのテストフレームワークにはプラグインがあり、テストがカバーするコードの範囲を評価するなどの機能を追加することができます。 以下では、科学的なエコシステムで最もよく使われている Python テストフレームワークの一つである **pytest** フレームワークについて学びます。 テストフレームワークは必要不可欠ですが、テストを実行するためだけのものです。 これらのフレームワークは、追加の自動化ツールの助けを借りずに Python のバージョンをまたいだテストを簡単に実行する方法は提供しません。

source: **Automation tools** allow you to automate running workflows such as tests in specific ways using user-defined commands. For instance it's useful to be able to run tests across different Python versions with a single command. Tools such as [**nox**](https://nox.thea.codes/en/stable/index.html) and [**tox**](https://tox.wiki/en/latest/index.html) also allow you to run tests across Python versions. However, it will be difficult to test your build on different operating systems using only nox and tox - this is where continuous integration (CI) comes into play.
es: Las **herramientas de automatización** te permiten automatizar la ejecución de flujos de trabajo como pruebas de formas específicas utilizando comandos definidos por el usuario. Por ejemplo, es útil poder ejecutar pruebas en diferentes versiones de Python con un solo comando. Herramientas como [**nox**](https://nox.thea.codes/en/stable/index.html) y [**tox**](https://tox.wiki/en/latest/index.html) te permiten ejecutar pruebas en diferentes versiones de Python. Sin embargo, será difícil realizar pruebas en diferentes sistemas operativos utilizando solo nox y tox; aquí es donde entra en juego la integración continua (CI).
ja: **自動化ツール** を使うと、ユーザー定義のコマンドを使って、テストのようなワークフローを特定の方法で実行することを自動化できます。 例えば、1つのコマンドで異なるPythonのバージョンにまたがってテストを実行できると便利です。 [**nox**](https://nox.thea.codes/en/stable/index.html) や [**tox**](https://tox.wiki/en/latest/index.html) のようなツールも、Pythonのバージョンをまたいでテストを実行できます。 しかし、noxとtoxだけを使って異なるオペレーティングシステムでビルドをテストするのは難しいでしょう - ここで継続的インテグレーション(CI)の出番です。

source: **Continuous Integration (CI):** is the last tool that you'll need to run your tests. CI will not only allow you to replicate any automated builds you create using nox or tox to run your package in different Python environments. It will also allow you to run your tests on different operating systems (Windows, Mac and Linux). [We discuss using CI to run tests here](tests-ci).
es: **Integración continua (CI):** es la última herramienta que necesitarás para ejecutar tus pruebas. CI no solo te permitirá replicar cualquier compilación automatizada que crees utilizando nox o tox para ejecutar tu paquete en diferentes entornos de Python. También te permitirá ejecutar tus pruebas en diferentes sistemas operativos (Windows, Mac y Linux). [Discutimos el uso de CI para ejecutar pruebas aquí](tests-ci).
ja: **継続的インテグレーション (CI):** は、テストを実行するために必要な最後のツールです。 CI は、nox や tox を使って作成した自動ビルドを複製して、異なる Python 環境でパッケージを実行できるようにするだけではありません。 また、異なるオペレーティングシステム（Windows、Mac、Linux）でテストを実行することもできます。 [テストを実行するためにCIを使うことについては、ここで説明します](tests-ci) 。

source: Table: Testing & Automation Tool
es: Tabla: Herramientas de pruebas y automatización
ja: テーブル: テスト＆自動化ツール

source: Features
es: Prestaciones
ja: 機能

source: Testing Framework (pytest)
es: Marcos de Pruebas (pytest)
ja: テストフレームワーク (pytest)

source: Test Runner (Tox)
es: Gestor de Pruebas (Tox)
ja: テストランナー (Tox)

source: Automation Tools (Nox)
es: Herramientas de Automatización (Nox)
ja: 自動化ツール（Nox）

source: Continuous Integration (GitHub Actions)
es: Integración Continua (GitHub Actions)
ja: 継続的インテグレーション（GitHub Actions）

source: Run Tests Locally
es: Ejecuta Pruebas Localmente
ja: ローカルでテストを実行する

source: Run Tests Online
es: Ejecuta Pruebas en Línea
ja: オンラインテストを実行する

source: Run Tests Across Python Versions
es: Ejecuta Pruebas en Diferentes Versiones de Python
ja: Pythonのバージョンにまたがってテストを実行する

source: Run Tests In Isolated Environments
es: Ejecuta Pruebas en Entornos Aislados
ja: 隔離された環境でのテストの実行

source: Run Tests Across Operating Systems (Windows, MacOS, Linux)
es: Ejecuta Pruebas en Diferentes Sistemas Operativos (Windows, MacOS, Linux)
ja: オペレーティングシステム（Windows、MacOS、Linux）にまたがるテストの実行

source: Use for other automation tasks (e.g. building docs)
es: Utilización para otras tareas de automatización (por ejemplo, construcción de documentación)
ja: その他の自動化タスクに使用する（ドキュメントの作成など）

source: What testing framework / package should I use to run tests?
es: Qué marco de pruebas / paquete debería usar para ejecutar pruebas?
ja: テストを実行するには、どのテストフレームワーク/パッケージを使用すればよいですか？

source: We recommend using `Pytest` to build and run your package tests. Pytest is the most common testing tool used in the Python ecosystem.
es: Recomendamos usar `Pytest` para construir y ejecutar las pruebas de tu paquete. Pytest es la herramienta de pruebas más comúnmente utilizada en el ecosistema de Python.
ja: パッケージテストのビルドと実行には `Pytest` を使うことを推奨します。 Pytest は Python のエコシステムで最もよく使われているテストツールです。

source: [The Pytest package](https://docs.pytest.org/en/latest/) also has a number of extensions that can be used to add functionality such as:
es: [El paquete Pytest](https://docs.pytest.org/en/latest/) también tiene una serie de extensiones que se pueden utilizar para agregar funcionalidades como:
ja: [Pytestパッケージ](https://docs.pytest.org/en/latest/) には、以下のような機能を追加するために使用できる多くの拡張機能もあります：

source: [pytest-cov](https://pytest-cov.readthedocs.io/en/latest/) allows you to analyze the code coverage of your package during your tests, and generates a report that you can [upload to codecov](https://codecov.io/).
es: [pytest-cov](https://pytest-cov.readthedocs.io/en/latest/) te permite analizar la cobertura de código de tu paquete durante tus pruebas, y genera un informe que puedes [subir a codecov](https://codecov.io/).
ja: [pytest-cov](https://pytest-cov.readthedocs.io/en/latest/) を使うと、テスト中にパッケージのコードカバレッジを分析し、 [codecov](https://codecov.io/) にアップロードできるレポートを生成することができます。

source: Learn more about code coverage here. (add link)
es: Aprende más sobre la cobertura de código aquí. (agregar enlace)
ja: コードカバレッジについてはこちらをご覧ください。 (リンクを追加)

source: Your editor or IDE may add additional convenience for running tests, setting breakpoints, and toggling the `–no-cov` flag. Check your editor's documentation for more information.
es: Tu editor o IDE puede agregar comodidades adicionales para ejecutar pruebas, establecer puntos de interrupción y alternar el parámetro `–no-cov`. Consulta la documentación de tu editor para obtener más información.
ja: お使いのエディタや IDE には、テストを実行したり、ブレークポイントを設定したり、 `-no-cov` フラグを切り替えたりするための便利な機能が追加されているかもしれません。 詳しくはエディタのドキュメントを参照してください。

source: Run tests using pytest
es: Ejecuta pruebas usando pytest
ja: pytest を使ってテストを実行する

source: If you are using **pytest**, you can run your tests locally by calling:
es: Si estás usando **pytest**, puedes ejecutar tus pruebas localmente llamando:
ja: **pytest** を使用している場合、テストをローカルで実行することができます:

source: Or if you want to run a specific test file - let's call this file "`test_module.py`" - you can run:
es: O si deseas ejecutar un archivo de prueba específico - por ejemplo "`test_module.py`" - puedes ejecutar:
ja: また、特定のテストファイル - このファイルを "`test_module.py`" と呼ぶことにします - を実行したい場合は、次のようにします:

source: Learn more from the [get started docs](https://docs.pytest.org/en/7.1.x/getting-started.html).
es: Aprende más en la [documentación de inicio](https://docs.pytest.org/en/7.1.x/getting-started.html).
ja: 詳しくは [ドキュメントスタートガイド](https://docs.pytest.org/en/7.1.x/getting-started.html) をご覧ください。

source: Running pytest on your computer is going to run your tests in whatever Python environment you currently have activated. This means that tests will be run on a single version of Python and only on the operating system that you are running locally.
es: Ejecutar pytest en tu ordenador ejecutará tus pruebas en el entorno de Python que tengas activado actualmente. Esto significa que las pruebas se ejecutarán en una sola versión de Python y solo en el sistema operativo que estás ejecutando localmente.
ja: あなたのコンピュータで pytest を実行すると、現在有効になっている Python 環境でテストが実行されます。 つまり、テストは単一のバージョンのPythonで、ローカルで実行しているオペレーティングシステム上でのみ実行されます。

source: An automation tool can simplify the process of running tests in various Python environments.
es: Una herramienta de automatización puede simplificar el proceso de ejecutar pruebas en varios entornos de Python.
ja: 自動化ツールは、様々な Python 環境でテストを実行するプロセスを単純化することができます。

source: Tests across operating systems
es: Pruebas en diferentes sistemas operativos
ja: オペレーティングシステムをまたいだテスト

source: If you want to run your tests across different operating systems you can [continuous integration. Learn more here](tests-ci).
es: Si deseas ejecutar tus pruebas en diferentes sistemas operativos, puedes utilizar [la integración continua. Aprende más aquí](tests-ci).
ja: 異なるオペレーティングシステム間でテストを実行したい場合は、 [継続的インテグレーション。 詳細はこちら](tests-ci) を使用することができます。

source: Tools to automate running your tests
es: Herramientas para automatizar la ejecución de tus pruebas
ja: テストの実行を自動化するツール

source: To run tests on various Python versions or in various specific environments with a single command, you can use an automation tool such as `nox` or `tox`. Both `nox` and `tox` can create an isolated virtual environments. This allows you to easily run your tests in multiple environments and across Python versions.
es: Para ejecutar pruebas en varias versiones de Python o en varios entornos específicos con un solo comando, puedes utilizar una herramienta de automatización como `nox` o `tox`. Tanto `nox` como `tox` pueden crear entornos virtuales aislados. Esto te permite ejecutar fácilmente tus pruebas en múltiples entornos y en diferentes versiones de Python.
ja: 一つのコマンドで様々な Python のバージョンや特定の環境でテストを実行するには、 `nox` や `tox` のような自動化ツールを使うことができます。 `nox` も `tox` も、隔離された仮想環境を作成することができます。 これにより、複数の環境や Python のバージョンをまたいだテストを簡単に実行することができます。
