Repository: pyOpenSci/python-package-guide
Catalog: locales/*/LC_MESSAGES/tests.po
Languages: es, ja

source: For scientific packages, creating short tutorials that highlight core workflows that your package supports, that are run when your documentation is built could also serve as end-to-end tests.
es: Para paquetes científicos, crear tutoriales cortos que destaquen flujos de trabajo fundamentales que tu paquete soporta, que se ejecutan cuando se construye tu documentación, también podría servir como pruebas de extremo a extremo.
ja: 科学的なパッケージの場合、パッケージがサポートする中核的なワークフローを強調する短いチュートリアルを作成し、ドキュメントのビルド時に実行することで、エンドツーエンドのテストを兼ねることができます。

source: Comparing unit, integration and end-to-end tests
es: Comparando pruebas unitarias, de integración y de extremo a extremo
ja: ユニットテスト、統合テスト、エンドツーエンドテストの比較

source: Unit tests, integration tests, and end-to-end tests have complementary advantages and disadvantages. The fine-grained nature of unit tests make them well-suited for isolating where errors are occurring. However, unit tests are not useful for verifying that different sections of code work together.
es: Las pruebas unitarias, las pruebas de integración y las pruebas de extremo a extremo tienen ventajas y desventajas complementarias. La naturaleza detallada de las pruebas unitarias las hace adecuadas para aislar dónde se están produciendo errores. Sin embargo, las pruebas unitarias no son útiles para verificar que diferentes secciones de código funcionen juntas.
ja: 単体テスト、統合テスト、エンドツーエンドテストには、それぞれ相補的な長所と短所があります。 単体テストは、そのきめ細かな性質から、どこでエラーが発生しているかを切り分けるのに適しています。 しかし、ユニットテストは、コードの異なるセクションが連携して動作することを検証するのには役に立ちません。

source: Integration and end-to-end tests verify that the different portions of the program work together, but are less well-suited for isolating where errors are occurring. For example, when you refactor your code, it is possible that that your end-to-end tests will break. But if the refactor didn't introduce new behavior to your existing code, then you can rely on your unit tests to continue to pass, testing the original functionality of your code.
es: Las pruebas de integración y de extremo a extremo verifican que las diferentes partes del programa funcionen juntas, pero son menos adecuadas para aislar dónde se están produciendo errores. Por ejemplo, cuando reescribes tu código, es posible que tus pruebas de extremo a extremo se rompan. Pero si la reescritura no introdujo un nuevo comportamiento en tu código existente, entonces puedes confiar en tus pruebas unitarias para que sigan pasando, probando la funcionalidad original de tu código.
ja: 統合テストとエンドツーエンドテストは、プログラムのさまざまな部分が連携して動作することを検証しますが、どこでエラーが発生しているかを切り分けるにはあまり適していません。例えば、コードをリファクタリングすると、エンドツーエンドのテストが壊れる可能性があります。しかし、リファクタリングによって既存のコードに新しい動作が導入されなかったのであれば、コードの元の機能をテストするユニットテストがパスし続けることに頼ることができます。

source: It is important to note that you don't need to spend energy worrying about the specifics surrounding the different types of tests. When you begin to work on your test suite, consider what your package does and how you may need to test parts of your package. Bring familiar with the different types of tests can provides a framework to help you think about writing tests and how different types of tests can complement each other.
es: Es importante tener en cuenta que no necesitas preocuparte por los detalles que rodean los diferentes tipos de pruebas. Cuando comiences a trabajar en tu conjunto de pruebas, considera qué hace tu paquete y cómo tienes que probar las diferentes partes de tu paquete. Entender los diferentes tipos de pruebas te ayudará a pensar en cómo escribir pruebas y cómo los diferentes tipos se complementan entre sí.
ja: 重要なのは、さまざまな種類のテストにまつわる詳細について心配することにエネルギーを費やす必要はないということです。テストスイートの作成に取りかかるときには、パッケージが何をするのか、そしてパッケージの一部をどのようにテストする必要があるのかを考えてください。さまざまな種類のテストに慣れ親しむことは、テストの書き方や、さまざまな種類のテストが互いにどのように補完し合えるかを考える際のフレームワークとなります。

source: Run tests with Continuous Integration
es: Ejecuta pruebas con Integración Continua
ja: 継続的インテグレーションによるテストの実行

source: Running your [test suite locally](run-tests) is useful as you develop code and also test new features or changes to the code base. However, you also will want to setup Continuous Integration (CI) to run your tests online. CI allows you to run all of your tests in the cloud. While you may only be able to run tests locally on a specific operating system, using CI you can specify tests to run both on various versions of Python and across different operating systems.
es: Ejecutar tu [conjunto de pruebas localmente](run-tests) es útil mientras desarrollas código y ademásayuda mientras añades nuevas características o cambias el código. Sin embargo, también debes considerar la Integración Continua (CI) para ejecutar tus pruebas en línea. La CI te permite ejecutar todas tus pruebas en la nube. Mientras que solo puedes ejecutar pruebas localmente en un sistema operativo específico (el de tu ordenador), utilizando CI puedes hacer con que tus pruebas se ejecuten en diferentes versiones de Python y en diferentes sistemas operativos.
ja: [テストスイートをローカルで実行する](run-tests) ことは、コードを開発したり、新しい機能やコード・ベースの変更をテストしたりするときに便利です。しかし、テストをオンラインで実行するために、継続的インテグレーション（CI）もセットアップしたいです。CIを使えば、すべてのテストをクラウド上で実行できます。特定のオペレーティングシステム上でしかローカルにテストを実行できないかもしれませんが、CIを使用すると、Pythonのさまざまなバージョンや異なるオペレーティングシステム間で実行するテストを指定できます。

source: CI can also be triggered for pull requests and pushes to your repository. This means that every pull request that you, your maintainer team or a contributor submit, can be tested. In the end CI testing ensures your code continues to run as expected even as changes are made to the code base.
es: La CI también se puede activar cuando tu repositorio recibe pull requests y pushes. Esto significa que cada pull request que tú, tu equipo de mantenimiento o un contribuidor envíe, es probado automaticamente. Al final, las pruebas de CI aseguran que tu código sigue funcionando como se espera incluso mientras se realizan cambios.
ja: CIは、プルリクエストやリポジトリへのプッシュをトリガーすることもできます。 これは、あなた、あなたのメンテナチーム、またはコントリビューターが提出するすべてのプルリクエストをテストできることを意味します。 最終的にCIテストは、コードベースに変更が加えられても、あなたのコードが期待通りに実行され続けることを保証します。

source: Learn more about Continuous Integration and how it can be used, here. (add link)
es: Aprende más sobre la Integración Continua y cómo se puede utilizar, aquí. (añadir enlace)
ja: 継続的インテグレーションとその使用方法については、こちらをご覧ください。 (リンクを追加)

source: CI & pull requests
es: CI y pull requests
ja: CIとプルリクエスト

source: CI is invaluable if you have outside people contributing to your software. You can setup CI to run on all pull requests submitted to your repository. CI can make your repository more friendly to new potential contributors. It allows users to contribute code, documentation fixes and more without having to create development environments, run tests and build documentation locally.
es: La CI es invaluable si tienes colaboradores externos contribuyendo a tu proyecto. Puedes configurar la CI para que se ejecute en todos los pull requests enviados a tu repositorio, haciendo que tu repositorio sea más accesible a nuevos colaboradores. CI permite a los usuarios contribuir con código, correcciones de documentación y más sin tener que crear entornos de desarrollo, ejecutar pruebas y construir documentación localmente.
ja: CIは、外部の人があなたのソフトウェアに貢献している場合、非常に貴重です。 リポジトリに投稿されたすべてのプルリクエストに対してCIを実行するように設定できます。 CIは、あなたのリポジトリを新しい将来の貢献者によりフレンドリーなものにします。 開発環境の構築、テストの実行、ドキュメントのビルドをローカルで行うことなく、コードやドキュメントの修正などに貢献することができます。

source: Example GitHub Actions that runs tests
ja: テストを実行する GitHub Actionsの例

source: Below is an example GitHub Actions that runs tests using nox across both Windows, Mac and Linux and on Python versions 3.9-3.11.
ja: 以下は、Windows、Mac、Linuxの両方で、Pythonのバージョン3.9-3.11でnoxを使ってテストを実行するGitHub Actionsの例です。

source: To work properly, this file should be located in a root directory of your GitHub repository:
es: Para funcionar correctamente, este archivo debe estar ubicado en el directorio raíz de tu repositorio de GitHub:
ja: 正しく動作させるには、このファイルをGitHubリポジトリのルートディレクトリに置く必要があります:

source: Write tests for your Python package
es: Escribe pruebas para tu paquete de Python
ja: Pythonパッケージのテストを書く

source: Writing code that tests your package code, also known as test suites, is important for you as a maintainer, your users, and package contributors. Test suites consist of sets of functions, methods, and classes that are written with the intention of making sure a specific part of your code works as you expected it to.
es: Escribir código que pruebe tu código de paquete, también conocido como conjuntos de pruebas, es importante para ti como mantenedor, tus usuarios y los contribuidores de tu paquete. Los conjuntos de pruebas consisten en conjuntos de funciones, métodos y clases que se escriben con la intención de asegurarse de que una parte específica de tu código funcione como esperabas.
ja: パッケージのコードをテストするコードを書くことは、テスト・スイートとしても知られています。 テスト・スイートは、関数、メソッド、クラスのセットで構成され、コードの特定の部分が期待通りに動作することを確認することを意図して書かれます。

source: Why write tests for your package?
es: Porque debes escribir pruebas para tu paquete?
ja: なぜパッケージのテストを書くのか？

source: Tests act as a safety net for code changes. They help you spot and rectify bugs before they affect users. Tests also instill confidence that code alterations from contributors won't breaking existing functionality.
es: Las pruebas actúan como una red de seguridad para los cambios de código. Te ayudan a detectar y corregir errores antes de que afecten a los usuarios. Las pruebas también infunden confianza en que las alteraciones de código de los contribuidores no romperán la funcionalidad existente.
ja: テストはコード変更のセーフティネットとして機能します。 バグがユーザーに影響を与える前に発見し、修正するのに役立ちます。 テストはまた、貢献者によるコード改変が既存の機能を壊さないという確信を与えます。

source: Writing tests for your Python package is important because:
es: Escribir pruebas para tu paquete de Python es importante porque:
ja: Pythonパッケージのテストを書くことは重要です:

source: **Catch Mistakes:** Tests are a safety net. When you make changes or add new features to your package, tests can quickly tell you if you accidentally broke something that was working fine before.
es: **Detectar Errores:** Las pruebas son una red de seguridad. Cuando haces cambios o añades nuevas características a tu paquete, las pruebas pueden detectar rápidamente si algo que funcionaba antes se rompió accidentalmente.
ja: **キャッチミス:** テストはセーフティネットです。パッケージに変更を加えたり、新機能を追加したりした場合、テストによって、以前は問題なく動作していたものを誤って壊してしまったかどうかをすぐに知ることができます。

source: **Save Time:** Imagine you have a magic button that can automatically check if your package is still working properly. Tests are like that magic button! They can run all those checks for you saving you time.
es: **Ahorrar Tiempo:** Imagina que tienes un botón mágico que puede comprobar automáticamente si tu paquete sigue funcionando correctamente. ¡Las pruebas son ese botón mágico! Pueden ejecutar todas esas comprobaciones por ti, ahorrándote un montón de tiempo.
ja: **時間を節約する:** あなたのパッケージがまだ正常に動作しているかどうかを自動的にチェックできる魔法のボタンがあるとしましょう。テストは魔法のボタンのようなものです！ あなたの時間を節約するために、すべてのチェックを実行してくれます。

source: **Easier Collaboration:** If you're working with others, or have outside contributors, tests help everyone stay on the same page. Your tests explain how your package is supposed to work, making it easier for others to understand and contribute to your project.
es: **Colaboración más Sencilla:** Si estás trabajando con otros o tienes colaboradores externos, las pruebas ayudan a que todos puedan entender el contexto del paquere. Tus pruebas explican cómo se supone que debe funcionar tu paquete, facilitando que otros entiendan y contribuyan a tu proyecto.
ja: **より容易なコラボレーション:** 他の人と一緒に仕事をしていたり、外部の協力者がいる場合、テストは全員が同じページにとどまるのに役立ちます。テストは、パッケージがどのように動作するかを説明し、他の人が理解しやすくし、プロジェクトに貢献しやすくします。

source: **Fearless Refactoring:** Refactoring means making improvements to your code structure without changing its behavior. Tests empower you to make these changes as if you break something, test failures will let you know.
es: **Refactorización sin Miedo:** Refactorizar significa hacer mejoras en la estructura de tu código sin cambiar su comportamiento. Las pruebas te permiten hacer estos cambios, ya que si rompes algo, las pruebas que fallen te indicaran los problemas.
ja: **大胆不敵なリファクタリング:** リファクタリングとは、コードの振る舞いを変えることなく、コード構造を改善することです。 テストは、あなたが何かを壊した場合、テストの失敗があなたに知らせてくれるので、このような変更を行う力を与えてくれます。

source: **Documentation:** Tests serve as technical examples of how to use your package. This can be helpful for a new technical contributor that wants to contribute code to your package. They can look at your tests to understand how parts of your code functionality fits together.
es: **Documentación:** Las pruebas sirven como ejemplos técnicos de cómo usar tu paquete. Esto puede ser útil para un nuevo colaborador técnico que quiera contribuir código a tu paquete. Pueden mirar tus pruebas para entender mejor cómo encajan las funcionalidades de tu código.
ja: **文書化:** テストは、あなたのパッケージの使い方の技術的な例となります。 これは、あなたのパッケージにコードを提供しようとする新しい技術的貢献者にとって役に立ちます。 彼らはあなたのテストを見て、コードの機能の一部がどのように組み合わされているかを理解することができます。

source: **Long-Term ease of maintenance:** As your package evolves, tests ensure that your code continues to behave as expected, even as you make changes over time. Thus you are helping your future self when writing tests.
es: **Facilidad de Mantenimiento a Largo Plazo:** A medida que tu paquete evoluciona, las pruebas aseguran que tu código continua comportándose como se espera, incluso a medida que realizas cambios durante un largo periodo de tiempo. Por lo tanto, es como ayudar a la versión futura de ti mismo.
ja: **長期的なメンテナンスの容易さ:** パッケージが進化するにつれて、テストは、時間の経過とともに変更を加えても、コードが期待通りに動作し続けることを保証します。こうして、テストを書くときに将来の自分を助けることになります。

source: **Easier pull request reviews:** By running your tests in a CI framework such as GitHub Actions, each time you or a contributor makes a change to your code-base, you can catch issues and things that may have changed in your code base. This ensures that your software behaves the way you expect it to.
ja: **より簡単なプルリクエストのレビュー:** GitHub Actionsのような CI フレームワークでテストを実行することで、あなたや貢献者がコードベースに変更を加えるたびに、コードベースの問題や変更点をキャッチすることができます。 これにより、あなたのソフトウェアが期待通りに動作することが保証されます。

source: Tests for user edge cases
es: Tests para casos límite de usuario
ja: ユーザーエッジケースのテスト

source: Edge cases refer to unexpected or "outlier" ways that some users may use your package. Tests enable you to address various edge cases that could impair your package's functionality. For example, what occurs if a function expects a pandas `dataframe` but a user supplies a numpy `array`? Does your code gracefully handle this situation, providing clear feedback, or does it leave users frustrated by an unexplained failure?
es: Edge cases (casos limite) son formas inesperadas o "atípicas" en las que algunos usuarios pueden usar tu paquete. Las pruebas te permiten abordar varios edge cases que podrían afectar la funcionalidad de tu paquete. Por ejemplo, ¿qué ocurre si una función espera un `dataframe` de pandas pero un usuario proporciona un `array` de numpy? ¿Tu código maneja esta situación de forma elegante, proporcionando un mensaje de error claro, o deja a los usuarios frustrados por un fallo inexplicado?
ja: エッジケースとは、あるユーザがあなたのパッケージを使用する際の、予期せぬ、あるいは "外れ値" の使い方を指します。 テストによって、パッケージの機能を損なう可能性のある様々なエッジケースに対処することができます。 例えば、ある関数がpandasの `dataframe` を期待したのに、ユーザがnumpyの `array` を提供した場合、何が起こるでしょうか？ あなたのコードは、このような状況を丁寧に処理し、明確なフィードバックを提供していますか？それとも、原因不明の失敗でユーザーをイライラさせたままにしていますか？

source: For a good introduction to testing, see [this Software Carpentry lesson](https://swcarpentry.github.io/python-novice-inflammation/10-defensive.html)
es: Para una buena introducción a las pruebas, consulta [esta lección de Software Carpentry](https://swcarpentry.github.io/python-novice-inflammation/10-defensive.html)
ja: テストの入門書としては、 [このSoftware Carpentryのレッスン](https://swcarpentry.github.io/python-novice-inflammation/10-defensive.html) を参照してください。

source: Imagine you're working on a puzzle where each puzzle piece represents a function, method, class or attribute in your Python package that you want other people to be able to use. Would you want to give someone a puzzle that has missing pieces or pieces that don't fit together? Providing people with the right puzzle pieces that work together can be compared to writing tests for your Python package.
es: Imagina que estás resolviendo un rompecabezas donde cada pieza representa una función, método, clase o atributo en tu paquete de Python que deseas que otras personas puedan usar. ¿Darias a alguien un rompecabezas al que falten piezas o en el que las piezas que no encajan? Dar un rompecabezas con las piezas correctas y que conecten entre si se puede comparar con escribir pruebas para tu paquete de Python.
ja: パズルのピースが、あなたのPythonパッケージの関数、メソッド、クラス、属性を表しているとしましょう。 そしてあなたは他の人に使ってもらいたいと思っています。 ピースが欠けていたり、ピースが合わなかったりするパズルを誰かに渡したいと思いますか？ パズルのピースを正しく組み合わせて提供することは、Python パッケージのテストを書くことに例えることができます。

source: Test examples
es: Ejemplos de pruebas
ja: テスト例

source: Let’s say you have a Python function that adds two numbers a and b together.
es: Imagina que tienes una función de Python que suma dos números a y b.
ja: 例えば、2つの数値aとbを足し合わせるPython関数があるとしましょう。

source: A test to ensure that function runs as you might expect when provided with different numbers might look like this:
es: Una prueba para asegurarte de que la función se ejecute como esperas cuando se le proporcionan diferentes números podría escribirse así:
ja: 異なる数値が与えられたときに、その関数が期待通りに実行されることを確認するテストは次のようになります:

source: How do I know what type of tests to write?
es: ¿Cómo sé qué tipo de pruebas escribir?
ja: どのような種類のテストを書けばいいのか、どうすればわかりますか？

source: This section has been adapted from [a presentation by Nick Murphy](https://zenodo.org/record/8185113).
es: Esta sección ha sido adaptada de [una presentación de Nick Murphy](https://zenodo.org/record/8185113).
ja: このセクションは、 [Nick Murphyのプレゼンテーション](https://zenodo.org/record/8185113) から引用しました。

source: At this point, you may be wondering - what should you be testing in your package? Below are a few examples:
es: En este punto puede que te estés preguntando - ¿qué deberías probar en tu paquete? A continuación hay algunos ejemplos:
ja: この時点で、あなたは疑問に思うかもしれません-あなたのパッケージで何をテストすべきか？ 以下にいくつか例を挙げます:

source: **Test some typical cases:** Test that the package functions as you expect it to when users use it. For instance, if your package is supposed to add two numbers, test that the outcome value of adding those two numbers is correct.
es: **Prueba algunos casos típicos:** Prueba que el paquete funcione como esperas cuando los usuarios lo usan. Por ejemplo, si tu paquete debe sumar dos números, prueba que el valor resultante de sumar esos dos números sea correcto.
ja: **いくつかの典型的なケースをテスト:** パッケージが、ユーザーが使用したときに期待通りに機能することをテストします。例えば、パッケージが2つの数値を足すことになっている場合、その2つの数値を足した結果が正しいかどうかをテストします。

source: **Test special cases:** Sometimes there are special or outlier cases. For instance, if a function performs a specific calculation that may become problematic closer to the value = 0, test it with the input of both 0 and
es: **Prueba casos especiales:** A veces hay casos especiales o atípicos. Por ejemplo, si una función realiza un cálculo específico que puede ser problemático cerca del valor = 0, pruébalo con la entrada de 0 y un valor normal.
ja: **特別なケースをテストする:** 時には特殊なケースや異常なケースもあります。例えば、ある関数が特定の計算を実行し、その計算が値=0に近いほど問題になる可能性がある場合、その関数の入力を0と

source: **Test at and near the expected boundaries:** If a function requires a value that is greater than or equal to 1, make sure that the function still works with both the values 1 and less than one and 1.001 as well (something close to the constraint value)..
es: **Prueba cerca de y en los límites esperados:** Si una función requiere un valor mayor o igual a 1, asegúrate de que la función se comporta correctamente con los valores 1 y menos de uno y con 1.001 (algo cercano al valor de la restricción).
ja: **予想される境界線とその付近でテストする:** 関数が1以上の値を必要とする場合、この関数が、1と1未満と1.001の両方の値 (制約値に近い値) でも動作することを確認してください。

source: **Test that code fails correctly:** If a function requires a value greater than or equal to 1, then test at 0.999. Make sure that the function fails gracefully when given unexpected values and help and that the user can easily understand why if failed (provides a useful error message).
es: **Prueba que el código falle correctamente:** Si una función requiere un valor mayor o igual a 1, entonces prueba con 0.999. Asegúrate de que la función falle de forma elegante cuando se le dan valores inesperados y que el usuario pueda entender fácilmente por qué falló (proporciona un mensaje de error útil).
ja: **コードが正しく失敗するかテストする** 関数が1以上の値を必要とする場合は、0.999でテストします。 予期しない値やヘルプが与えられたときに、関数が差し障り無く失敗し、ユーザが失敗した理由を簡単に理解できるようにします(有用なエラーメッセージを提供します)。

source: Tools to run your tests
es: Herramientas para ejecutar tus pruebas
